TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan  4 16:08:36 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/ImitatePLC/Software/uCOS-II/Ports/C28x/
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\ImitatePLC\Examples\TI\TMDSDOCK2833
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    1403                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1404                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1405              
    1406              $C$DW$T$25      .dwtag  DW_TAG_typedef
    1407                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    1408                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    1409                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1410              
    1411              $C$DW$T$33      .dwtag  DW_TAG_typedef
    1412                      .dwattr $C$DW$T$33, DW_AT_name("OS_STK")
    1413                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    1414                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1415              
    1416              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1417                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1418                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1419              
    1420              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1421                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1422                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1423                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1424              
    1425              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1426                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1427                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1428                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1429              
    1430              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1431                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1432                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1433                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1434              
    1435              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1436                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1437                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1438                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1439              
    1440              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1441                      .dwattr $C$DW$T$28, DW_AT_name("INT32U")
    1442                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    1443                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1444              
    1445              $C$DW$79        .dwtag  DW_TAG_TI_far_type
    1446                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$28)
    1447              
    1448              $C$DW$T$58      .dwtag  DW_TAG_volatile_type
    1449                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$79)
    1450              
    1451              
    1452              $C$DW$T$41      .dwtag  DW_TAG_array_type
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   29

    1453                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    1454                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1455                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1456              $C$DW$80        .dwtag  DW_TAG_subrange_type
    1457                      .dwattr $C$DW$80, DW_AT_upper_bound(0x00)
    1458              
    1459                      .dwendtag $C$DW$T$41
    1460              
    1461              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1462                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$28)
    1463                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    1464              
    1465              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1466                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1467                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1468                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1469              
    1470              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1471                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1472                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1473                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1474              
    1475              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1476                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1477                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1478                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1479              
    1480              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1481                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1482                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1483                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1484              
    1485              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1486                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1487                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1488                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    1489              
    1490              
    1491              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1492                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    1493                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1494              $C$DW$81        .dwtag  DW_TAG_member
    1495                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1496                      .dwattr $C$DW$81, DW_AT_name("OSEventType")
    1497                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_OSEventType")
    1498                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1500              
    1501              $C$DW$82        .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$3)
    1503                      .dwattr $C$DW$82, DW_AT_name("OSEventPtr")
    1504                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_OSEventPtr")
    1505                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1506                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1507              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   30

    1508              $C$DW$83        .dwtag  DW_TAG_member
    1509                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1510                      .dwattr $C$DW$83, DW_AT_name("OSEventCnt")
    1511                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_OSEventCnt")
    1512                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1513                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1514              
    1515              $C$DW$84        .dwtag  DW_TAG_member
    1516                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1517                      .dwattr $C$DW$84, DW_AT_name("OSEventGrp")
    1518                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_OSEventGrp")
    1519                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1520                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1521              
    1522              $C$DW$85        .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    1524                      .dwattr $C$DW$85, DW_AT_name("OSEventTbl")
    1525                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_OSEventTbl")
    1526                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1527                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$86        .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$23)
    1531                      .dwattr $C$DW$86, DW_AT_name("OSEventName")
    1532                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_OSEventName")
    1533                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1534                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536                      .dwendtag $C$DW$T$24
    1537              
    1538              $C$DW$T$36      .dwtag  DW_TAG_typedef
    1539                      .dwattr $C$DW$T$36, DW_AT_name("OS_EVENT")
    1540                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
    1541                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1542              
    1543              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1544                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1545                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    1546              
    1547              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    1548                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1549                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    1550              
    1551              
    1552              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_grp")
    1554                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1555              $C$DW$87        .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1557                      .dwattr $C$DW$87, DW_AT_name("OSFlagType")
    1558                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_OSFlagType")
    1559                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1561              
    1562              $C$DW$88        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   31

    1563                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$3)
    1564                      .dwattr $C$DW$88, DW_AT_name("OSFlagWaitList")
    1565                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_OSFlagWaitList")
    1566                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1567                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1568              
    1569              $C$DW$89        .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1571                      .dwattr $C$DW$89, DW_AT_name("OSFlagFlags")
    1572                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_OSFlagFlags")
    1573                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1574                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1575              
    1576              $C$DW$90        .dwtag  DW_TAG_member
    1577                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
    1578                      .dwattr $C$DW$90, DW_AT_name("OSFlagName")
    1579                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_OSFlagName")
    1580                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1581                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1582              
    1583                      .dwendtag $C$DW$T$26
    1584              
    1585              $C$DW$T$60      .dwtag  DW_TAG_typedef
    1586                      .dwattr $C$DW$T$60, DW_AT_name("OS_FLAG_GRP")
    1587                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$26)
    1588                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1589              
    1590              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    1591                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1592                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    1593              
    1594              
    1595              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1596                      .dwattr $C$DW$T$27, DW_AT_name("os_flag_node")
    1597                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    1598              $C$DW$91        .dwtag  DW_TAG_member
    1599                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$3)
    1600                      .dwattr $C$DW$91, DW_AT_name("OSFlagNodeNext")
    1601                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    1602                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1603                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1604              
    1605              $C$DW$92        .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$3)
    1607                      .dwattr $C$DW$92, DW_AT_name("OSFlagNodePrev")
    1608                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    1609                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1610                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1611              
    1612              $C$DW$93        .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$3)
    1614                      .dwattr $C$DW$93, DW_AT_name("OSFlagNodeTCB")
    1615                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    1616                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1617                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   32

    1618              
    1619              $C$DW$94        .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$3)
    1621                      .dwattr $C$DW$94, DW_AT_name("OSFlagNodeFlagGrp")
    1622                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    1623                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1624                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1625              
    1626              $C$DW$95        .dwtag  DW_TAG_member
    1627                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$25)
    1628                      .dwattr $C$DW$95, DW_AT_name("OSFlagNodeFlags")
    1629                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    1630                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1631                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1632              
    1633              $C$DW$96        .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$96, DW_AT_name("OSFlagNodeWaitType")
    1636                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    1637                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1638                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1639              
    1640                      .dwendtag $C$DW$T$27
    1641              
    1642              $C$DW$T$39      .dwtag  DW_TAG_typedef
    1643                      .dwattr $C$DW$T$39, DW_AT_name("OS_FLAG_NODE")
    1644                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$27)
    1645                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1646              
    1647              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1648                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1649                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    1650              
    1651              
    1652              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1653                      .dwattr $C$DW$T$29, DW_AT_name("os_mem")
    1654                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    1655              $C$DW$97        .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$3)
    1657                      .dwattr $C$DW$97, DW_AT_name("OSMemAddr")
    1658                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_OSMemAddr")
    1659                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1661              
    1662              $C$DW$98        .dwtag  DW_TAG_member
    1663                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$3)
    1664                      .dwattr $C$DW$98, DW_AT_name("OSMemFreeList")
    1665                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_OSMemFreeList")
    1666                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1667                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1668              
    1669              $C$DW$99        .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1671                      .dwattr $C$DW$99, DW_AT_name("OSMemBlkSize")
    1672                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_OSMemBlkSize")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   33

    1673                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1674                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1675              
    1676              $C$DW$100       .dwtag  DW_TAG_member
    1677                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1678                      .dwattr $C$DW$100, DW_AT_name("OSMemNBlks")
    1679                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_OSMemNBlks")
    1680                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1681                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1682              
    1683              $C$DW$101       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
    1685                      .dwattr $C$DW$101, DW_AT_name("OSMemNFree")
    1686                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_OSMemNFree")
    1687                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1688                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1689              
    1690              $C$DW$102       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$23)
    1692                      .dwattr $C$DW$102, DW_AT_name("OSMemName")
    1693                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_OSMemName")
    1694                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1695                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1696              
    1697                      .dwendtag $C$DW$T$29
    1698              
    1699              $C$DW$T$62      .dwtag  DW_TAG_typedef
    1700                      .dwattr $C$DW$T$62, DW_AT_name("OS_MEM")
    1701                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$29)
    1702                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1703              
    1704              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    1705                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1706                      .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    1707              
    1708              
    1709              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1710                      .dwattr $C$DW$T$32, DW_AT_name("os_q")
    1711                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0c)
    1712              $C$DW$103       .dwtag  DW_TAG_member
    1713                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$30)
    1714                      .dwattr $C$DW$103, DW_AT_name("OSQPtr")
    1715                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_OSQPtr")
    1716                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1717                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1718              
    1719              $C$DW$104       .dwtag  DW_TAG_member
    1720                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$31)
    1721                      .dwattr $C$DW$104, DW_AT_name("OSQStart")
    1722                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_OSQStart")
    1723                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1724                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1725              
    1726              $C$DW$105       .dwtag  DW_TAG_member
    1727                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   34

    1728                      .dwattr $C$DW$105, DW_AT_name("OSQEnd")
    1729                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_OSQEnd")
    1730                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1731                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1732              
    1733              $C$DW$106       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$31)
    1735                      .dwattr $C$DW$106, DW_AT_name("OSQIn")
    1736                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_OSQIn")
    1737                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1738                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1739              
    1740              $C$DW$107       .dwtag  DW_TAG_member
    1741                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$31)
    1742                      .dwattr $C$DW$107, DW_AT_name("OSQOut")
    1743                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_OSQOut")
    1744                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1745                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1746              
    1747              $C$DW$108       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1749                      .dwattr $C$DW$108, DW_AT_name("OSQSize")
    1750                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_OSQSize")
    1751                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1752                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1753              
    1754              $C$DW$109       .dwtag  DW_TAG_member
    1755                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1756                      .dwattr $C$DW$109, DW_AT_name("OSQEntries")
    1757                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_OSQEntries")
    1758                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1759                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1760              
    1761                      .dwendtag $C$DW$T$32
    1762              
    1763              $C$DW$T$64      .dwtag  DW_TAG_typedef
    1764                      .dwattr $C$DW$T$64, DW_AT_name("OS_Q")
    1765                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$32)
    1766                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1767              
    1768              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    1769                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1770                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
    1771              
    1772              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1773                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$32)
    1774                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    1775              
    1776              
    1777              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1778                      .dwattr $C$DW$T$42, DW_AT_name("os_tcb")
    1779                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x30)
    1780              $C$DW$110       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$34)
    1782                      .dwattr $C$DW$110, DW_AT_name("OSTCBStkPtr")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   35

    1783                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    1784                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1786              
    1787              $C$DW$111       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$3)
    1789                      .dwattr $C$DW$111, DW_AT_name("OSTCBExtPtr")
    1790                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    1791                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1792                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1793              
    1794              $C$DW$112       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
    1796                      .dwattr $C$DW$112, DW_AT_name("OSTCBStkBottom")
    1797                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    1798                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1799                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1800              
    1801              $C$DW$113       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$28)
    1803                      .dwattr $C$DW$113, DW_AT_name("OSTCBStkSize")
    1804                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_OSTCBStkSize")
    1805                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1806                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1807              
    1808              $C$DW$114       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1810                      .dwattr $C$DW$114, DW_AT_name("OSTCBOpt")
    1811                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_OSTCBOpt")
    1812                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1813                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1814              
    1815              $C$DW$115       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1817                      .dwattr $C$DW$115, DW_AT_name("OSTCBId")
    1818                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_OSTCBId")
    1819                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1820                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1821              
    1822              $C$DW$116       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$35)
    1824                      .dwattr $C$DW$116, DW_AT_name("OSTCBNext")
    1825                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_OSTCBNext")
    1826                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1827                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1828              
    1829              $C$DW$117       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$35)
    1831                      .dwattr $C$DW$117, DW_AT_name("OSTCBPrev")
    1832                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_OSTCBPrev")
    1833                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1834                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1835              
    1836              $C$DW$118       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$37)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   36

    1838                      .dwattr $C$DW$118, DW_AT_name("OSTCBEventPtr")
    1839                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    1840                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1841                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1842              
    1843              $C$DW$119       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$38)
    1845                      .dwattr $C$DW$119, DW_AT_name("OSTCBEventMultiPtr")
    1846                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    1847                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1848                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1849              
    1850              $C$DW$120       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$3)
    1852                      .dwattr $C$DW$120, DW_AT_name("OSTCBMsg")
    1853                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_OSTCBMsg")
    1854                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1855                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1856              
    1857              $C$DW$121       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$40)
    1859                      .dwattr $C$DW$121, DW_AT_name("OSTCBFlagNode")
    1860                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    1861                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1862                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1863              
    1864              $C$DW$122       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$25)
    1866                      .dwattr $C$DW$122, DW_AT_name("OSTCBFlagsRdy")
    1867                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    1868                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1869                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1870              
    1871              $C$DW$123       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$28)
    1873                      .dwattr $C$DW$123, DW_AT_name("OSTCBDly")
    1874                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_OSTCBDly")
    1875                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1876                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1877              
    1878              $C$DW$124       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$124, DW_AT_name("OSTCBStat")
    1881                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_OSTCBStat")
    1882                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1883                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1884              
    1885              $C$DW$125       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$125, DW_AT_name("OSTCBStatPend")
    1888                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_OSTCBStatPend")
    1889                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1890                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1891              
    1892              $C$DW$126       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   37

    1893                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$126, DW_AT_name("OSTCBPrio")
    1895                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_OSTCBPrio")
    1896                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1897                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1898              
    1899              $C$DW$127       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$127, DW_AT_name("OSTCBX")
    1902                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_OSTCBX")
    1903                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1904                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1905              
    1906              $C$DW$128       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1908                      .dwattr $C$DW$128, DW_AT_name("OSTCBY")
    1909                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_OSTCBY")
    1910                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1911                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1912              
    1913              $C$DW$129       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    1915                      .dwattr $C$DW$129, DW_AT_name("OSTCBBitX")
    1916                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_OSTCBBitX")
    1917                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1918                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1919              
    1920              $C$DW$130       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1922                      .dwattr $C$DW$130, DW_AT_name("OSTCBBitY")
    1923                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_OSTCBBitY")
    1924                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1925                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1926              
    1927              $C$DW$131       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$131, DW_AT_name("OSTCBDelReq")
    1930                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_OSTCBDelReq")
    1931                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1932                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1933              
    1934              $C$DW$132       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$28)
    1936                      .dwattr $C$DW$132, DW_AT_name("OSTCBCtxSwCtr")
    1937                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    1938                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1939                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1940              
    1941              $C$DW$133       .dwtag  DW_TAG_member
    1942                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$28)
    1943                      .dwattr $C$DW$133, DW_AT_name("OSTCBCyclesTot")
    1944                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    1945                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1946                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1947              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   38

    1948              $C$DW$134       .dwtag  DW_TAG_member
    1949                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$28)
    1950                      .dwattr $C$DW$134, DW_AT_name("OSTCBCyclesStart")
    1951                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    1952                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1953                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1954              
    1955              $C$DW$135       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$34)
    1957                      .dwattr $C$DW$135, DW_AT_name("OSTCBStkBase")
    1958                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_OSTCBStkBase")
    1959                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1960                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1961              
    1962              $C$DW$136       .dwtag  DW_TAG_member
    1963                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$28)
    1964                      .dwattr $C$DW$136, DW_AT_name("OSTCBStkUsed")
    1965                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    1966                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1967                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1968              
    1969              $C$DW$137       .dwtag  DW_TAG_member
    1970                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    1971                      .dwattr $C$DW$137, DW_AT_name("OSTCBTaskName")
    1972                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OSTCBTaskName")
    1973                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1974                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1975              
    1976              $C$DW$138       .dwtag  DW_TAG_member
    1977                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$41)
    1978                      .dwattr $C$DW$138, DW_AT_name("OSTCBRegTbl")
    1979                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    1980                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1981                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1982              
    1983                      .dwendtag $C$DW$T$42
    1984              
    1985              $C$DW$T$45      .dwtag  DW_TAG_typedef
    1986                      .dwattr $C$DW$T$45, DW_AT_name("OS_TCB")
    1987                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$42)
    1988                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1989              
    1990              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    1991                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1992                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    1993              
    1994              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1995                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    1996                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    1997              
    1998                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1999              
    2000              ;***************************************************************
    2001              ;* DWARF CIE ENTRIES                                           *
    2002              ;***************************************************************
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:37 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   39

    2003              
    2004              $C$DW$CIE       .dwcie 26
    2005                      .dwcfi  cfa_register, 20
    2006                      .dwcfi  cfa_offset, 0
    2007                      .dwcfi  same_value, 28
    2008                      .dwcfi  same_value, 6
    2009                      .dwcfi  same_value, 7
    2010                      .dwcfi  same_value, 8
    2011                      .dwcfi  same_value, 9
    2012                      .dwcfi  same_value, 10
    2013                      .dwcfi  same_value, 11
    2014                      .dwcfi  same_value, 59
    2015                      .dwcfi  same_value, 63
    2016                      .dwcfi  same_value, 67
    2017                      .dwcfi  same_value, 71
    2018                      .dwendentry
    2019              
    2020              ;***************************************************************
    2021              ;* DWARF REGISTER MAP                                          *
    2022              ;***************************************************************
    2023              
    2024              $C$DW$139       .dwtag  DW_TAG_TI_assign_register
    2025                      .dwattr $C$DW$139, DW_AT_name("AL")
    2026                      .dwattr $C$DW$139, DW_AT_location[DW_OP_reg0]
    2027              
    2028              $C$DW$140       .dwtag  DW_TAG_TI_assign_register
    2029                      .dwattr $C$DW$140, DW_AT_name("AH")
    2030                      .dwattr $C$DW$140, DW_AT_location[DW_OP_reg1]
    2031              
    2032              $C$DW$141       .dwtag  DW_TAG_TI_assign_register
    2033                      .dwattr $C$DW$141, DW_AT_name("PL")
    2034                      .dwattr $C$DW$141, DW_AT_location[DW_OP_reg2]
    2035              
    2036              $C$DW$142       .dwtag  DW_TAG_TI_assign_register
    2037                      .dwattr $C$DW$142, DW_AT_name("PH")
    2038                      .dwattr $C$DW$142, DW_AT_location[DW_OP_reg3]
    2039              
    2040              $C$DW$143       .dwtag  DW_TAG_TI_assign_register
    2041                      .dwattr $C$DW$143, DW_AT_name("SP")
    2042                      .dwattr $C$DW$143, DW_AT_location[DW_OP_reg20]
    2043              
    2044              $C$DW$144       .dwtag  DW_TAG_TI_assign_register
