TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue Feb 16 00:15:57 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Ports/C28x/Generic/CCS
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              ;**************************************************************
      14              ;* CINIT RECORDS                                              *

    1330              $C$DW$T$25      .dwtag  DW_TAG_typedef
    1331                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    1332                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    1333                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1334              
    1335              $C$DW$T$33      .dwtag  DW_TAG_typedef
    1336                      .dwattr $C$DW$T$33, DW_AT_name("OS_STK")
    1337                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$9)
    1338                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    1339              
    1340              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    1341                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    1342                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    1343              
    1344              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1345                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1346                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1347                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1348              
    1349              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1350                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1351                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1352                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1353              
    1354              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1355                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1356                      .dwattr $C$DW$T$12, DW_AT_name("long")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   27

    1357                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1358              
    1359              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1360                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1361                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1362                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1363              
    1364              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1365                      .dwattr $C$DW$T$28, DW_AT_name("INT32U")
    1366                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    1367                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1368              
    1369              $C$DW$79        .dwtag  DW_TAG_TI_far_type
    1370                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$28)
    1371              
    1372              $C$DW$T$58      .dwtag  DW_TAG_volatile_type
    1373                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$79)
    1374              
    1375              
    1376              $C$DW$T$41      .dwtag  DW_TAG_array_type
    1377                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$28)
    1378                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1379                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x02)
    1380              $C$DW$80        .dwtag  DW_TAG_subrange_type
    1381                      .dwattr $C$DW$80, DW_AT_upper_bound(0x00)
    1382              
    1383                      .dwendtag $C$DW$T$41
    1384              
    1385              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1386                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$28)
    1387                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    1388              
    1389              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1390                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1391                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1392                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1393              
    1394              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1395                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1396                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1397                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1398              
    1399              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1400                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1401                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1402                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1403              
    1404              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1405                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1406                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1407                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1408              
    1409              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1410                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1411                      .dwattr $C$DW$T$18, DW_AT_name("long double")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   28

    1412                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    1413              
    1414              
    1415              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1416                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    1417                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1418              $C$DW$81        .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1420                      .dwattr $C$DW$81, DW_AT_name("OSEventType")
    1421                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_OSEventType")
    1422                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1423                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1424              
    1425              $C$DW$82        .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$3)
    1427                      .dwattr $C$DW$82, DW_AT_name("OSEventPtr")
    1428                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_OSEventPtr")
    1429                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1430                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1431              
    1432              $C$DW$83        .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1434                      .dwattr $C$DW$83, DW_AT_name("OSEventCnt")
    1435                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_OSEventCnt")
    1436                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1437                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1438              
    1439              $C$DW$84        .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1441                      .dwattr $C$DW$84, DW_AT_name("OSEventGrp")
    1442                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_OSEventGrp")
    1443                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1444                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1445              
    1446              $C$DW$85        .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$22)
    1448                      .dwattr $C$DW$85, DW_AT_name("OSEventTbl")
    1449                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_OSEventTbl")
    1450                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1451                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1452              
    1453              $C$DW$86        .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$23)
    1455                      .dwattr $C$DW$86, DW_AT_name("OSEventName")
    1456                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_OSEventName")
    1457                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1458                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1459              
    1460                      .dwendtag $C$DW$T$24
    1461              
    1462              $C$DW$T$36      .dwtag  DW_TAG_typedef
    1463                      .dwattr $C$DW$T$36, DW_AT_name("OS_EVENT")
    1464                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$24)
    1465                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1466              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   29

    1467              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    1468                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    1469                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    1470              
    1471              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    1472                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    1473                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    1474              
    1475              
    1476              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1477                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_grp")
    1478                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    1479              $C$DW$87        .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$87, DW_AT_name("OSFlagType")
    1482                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_OSFlagType")
    1483                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1484                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1485              
    1486              $C$DW$88        .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$3)
    1488                      .dwattr $C$DW$88, DW_AT_name("OSFlagWaitList")
    1489                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_OSFlagWaitList")
    1490                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1491                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1492              
    1493              $C$DW$89        .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1495                      .dwattr $C$DW$89, DW_AT_name("OSFlagFlags")
    1496                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_OSFlagFlags")
    1497                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1498                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1499              
    1500              $C$DW$90        .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$23)
    1502                      .dwattr $C$DW$90, DW_AT_name("OSFlagName")
    1503                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_OSFlagName")
    1504                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1505                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1506              
    1507                      .dwendtag $C$DW$T$26
    1508              
    1509              $C$DW$T$60      .dwtag  DW_TAG_typedef
    1510                      .dwattr $C$DW$T$60, DW_AT_name("OS_FLAG_GRP")
    1511                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$26)
    1512                      .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    1513              
    1514              $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    1515                      .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    1516                      .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    1517              
    1518              
    1519              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1520                      .dwattr $C$DW$T$27, DW_AT_name("os_flag_node")
    1521                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   30

    1522              $C$DW$91        .dwtag  DW_TAG_member
    1523                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$3)
    1524                      .dwattr $C$DW$91, DW_AT_name("OSFlagNodeNext")
    1525                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    1526                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1528              
    1529              $C$DW$92        .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$3)
    1531                      .dwattr $C$DW$92, DW_AT_name("OSFlagNodePrev")
    1532                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    1533                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1534                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1535              
    1536              $C$DW$93        .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$3)
    1538                      .dwattr $C$DW$93, DW_AT_name("OSFlagNodeTCB")
    1539                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    1540                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1541                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1542              
    1543              $C$DW$94        .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$3)
    1545                      .dwattr $C$DW$94, DW_AT_name("OSFlagNodeFlagGrp")
    1546                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    1547                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1548                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1549              
    1550              $C$DW$95        .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$25)
    1552                      .dwattr $C$DW$95, DW_AT_name("OSFlagNodeFlags")
    1553                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    1554                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1555                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1556              
    1557              $C$DW$96        .dwtag  DW_TAG_member
    1558                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$96, DW_AT_name("OSFlagNodeWaitType")
    1560                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    1561                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1562                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1563              
    1564                      .dwendtag $C$DW$T$27
    1565              
    1566              $C$DW$T$39      .dwtag  DW_TAG_typedef
    1567                      .dwattr $C$DW$T$39, DW_AT_name("OS_FLAG_NODE")
    1568                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$27)
    1569                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1570              
    1571              $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    1572                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    1573                      .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    1574              
    1575              
    1576              $C$DW$T$29      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   31

    1577                      .dwattr $C$DW$T$29, DW_AT_name("os_mem")
    1578                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    1579              $C$DW$97        .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$3)
    1581                      .dwattr $C$DW$97, DW_AT_name("OSMemAddr")
    1582                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_OSMemAddr")
    1583                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1585              
    1586              $C$DW$98        .dwtag  DW_TAG_member
    1587                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$3)
    1588                      .dwattr $C$DW$98, DW_AT_name("OSMemFreeList")
    1589                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_OSMemFreeList")
    1590                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1591                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1592              
    1593              $C$DW$99        .dwtag  DW_TAG_member
    1594                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1595                      .dwattr $C$DW$99, DW_AT_name("OSMemBlkSize")
    1596                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_OSMemBlkSize")
    1597                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1598                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1599              
    1600              $C$DW$100       .dwtag  DW_TAG_member
    1601                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1602                      .dwattr $C$DW$100, DW_AT_name("OSMemNBlks")
    1603                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_OSMemNBlks")
    1604                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1605                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1606              
    1607              $C$DW$101       .dwtag  DW_TAG_member
    1608                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$28)
    1609                      .dwattr $C$DW$101, DW_AT_name("OSMemNFree")
    1610                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_OSMemNFree")
    1611                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1612                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1613              
    1614              $C$DW$102       .dwtag  DW_TAG_member
    1615                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$23)
    1616                      .dwattr $C$DW$102, DW_AT_name("OSMemName")
    1617                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_OSMemName")
    1618                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1619                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1620              
    1621                      .dwendtag $C$DW$T$29
    1622              
    1623              $C$DW$T$62      .dwtag  DW_TAG_typedef
    1624                      .dwattr $C$DW$T$62, DW_AT_name("OS_MEM")
    1625                      .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$29)
    1626                      .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1627              
    1628              $C$DW$T$63      .dwtag  DW_TAG_pointer_type
    1629                      .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$62)
    1630                      .dwattr $C$DW$T$63, DW_AT_address_class(0x20)
    1631              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   32

    1632              
    1633              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    1634                      .dwattr $C$DW$T$32, DW_AT_name("os_q")
    1635                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0c)
    1636              $C$DW$103       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$30)
    1638                      .dwattr $C$DW$103, DW_AT_name("OSQPtr")
    1639                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_OSQPtr")
    1640                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1642              
    1643              $C$DW$104       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$31)
    1645                      .dwattr $C$DW$104, DW_AT_name("OSQStart")
    1646                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_OSQStart")
    1647                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1648                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1649              
    1650              $C$DW$105       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$31)
    1652                      .dwattr $C$DW$105, DW_AT_name("OSQEnd")
    1653                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_OSQEnd")
    1654                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1655                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1656              
    1657              $C$DW$106       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$31)
    1659                      .dwattr $C$DW$106, DW_AT_name("OSQIn")
    1660                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_OSQIn")
    1661                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1662                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1663              
    1664              $C$DW$107       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$31)
    1666                      .dwattr $C$DW$107, DW_AT_name("OSQOut")
    1667                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_OSQOut")
    1668                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1669                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1670              
    1671              $C$DW$108       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1673                      .dwattr $C$DW$108, DW_AT_name("OSQSize")
    1674                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_OSQSize")
    1675                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1676                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1677              
    1678              $C$DW$109       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1680                      .dwattr $C$DW$109, DW_AT_name("OSQEntries")
    1681                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_OSQEntries")
    1682                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1683                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1684              
    1685                      .dwendtag $C$DW$T$32
    1686              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   33

    1687              $C$DW$T$64      .dwtag  DW_TAG_typedef
    1688                      .dwattr $C$DW$T$64, DW_AT_name("OS_Q")
    1689                      .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$32)
    1690                      .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1691              
    1692              $C$DW$T$65      .dwtag  DW_TAG_pointer_type
    1693                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1694                      .dwattr $C$DW$T$65, DW_AT_address_class(0x20)
    1695              
    1696              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1697                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$32)
    1698                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    1699              
    1700              
    1701              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1702                      .dwattr $C$DW$T$42, DW_AT_name("os_tcb")
    1703                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x30)
    1704              $C$DW$110       .dwtag  DW_TAG_member
    1705                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$34)
    1706                      .dwattr $C$DW$110, DW_AT_name("OSTCBStkPtr")
    1707                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    1708                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1709                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1710              
    1711              $C$DW$111       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$3)
    1713                      .dwattr $C$DW$111, DW_AT_name("OSTCBExtPtr")
    1714                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    1715                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1716                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1717              
    1718              $C$DW$112       .dwtag  DW_TAG_member
    1719                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
    1720                      .dwattr $C$DW$112, DW_AT_name("OSTCBStkBottom")
    1721                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    1722                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1723                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1724              
    1725              $C$DW$113       .dwtag  DW_TAG_member
    1726                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$28)
    1727                      .dwattr $C$DW$113, DW_AT_name("OSTCBStkSize")
    1728                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_OSTCBStkSize")
    1729                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1730                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1731              
    1732              $C$DW$114       .dwtag  DW_TAG_member
    1733                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1734                      .dwattr $C$DW$114, DW_AT_name("OSTCBOpt")
    1735                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_OSTCBOpt")
    1736                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1737                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1738              
    1739              $C$DW$115       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1741                      .dwattr $C$DW$115, DW_AT_name("OSTCBId")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   34

    1742                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_OSTCBId")
    1743                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1744                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1745              
    1746              $C$DW$116       .dwtag  DW_TAG_member
    1747                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$35)
    1748                      .dwattr $C$DW$116, DW_AT_name("OSTCBNext")
    1749                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_OSTCBNext")
    1750                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1751                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1752              
    1753              $C$DW$117       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$35)
    1755                      .dwattr $C$DW$117, DW_AT_name("OSTCBPrev")
    1756                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_OSTCBPrev")
    1757                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1758                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1759              
    1760              $C$DW$118       .dwtag  DW_TAG_member
    1761                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$37)
    1762                      .dwattr $C$DW$118, DW_AT_name("OSTCBEventPtr")
    1763                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    1764                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1765                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1766              
    1767              $C$DW$119       .dwtag  DW_TAG_member
    1768                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$38)
    1769                      .dwattr $C$DW$119, DW_AT_name("OSTCBEventMultiPtr")
    1770                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    1771                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1772                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1773              
    1774              $C$DW$120       .dwtag  DW_TAG_member
    1775                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$3)
    1776                      .dwattr $C$DW$120, DW_AT_name("OSTCBMsg")
    1777                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_OSTCBMsg")
    1778                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1779                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1780              
    1781              $C$DW$121       .dwtag  DW_TAG_member
    1782                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$40)
    1783                      .dwattr $C$DW$121, DW_AT_name("OSTCBFlagNode")
    1784                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    1785                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1786                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1787              
    1788              $C$DW$122       .dwtag  DW_TAG_member
    1789                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$25)
    1790                      .dwattr $C$DW$122, DW_AT_name("OSTCBFlagsRdy")
    1791                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    1792                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1793                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1794              
    1795              $C$DW$123       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$28)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   35

    1797                      .dwattr $C$DW$123, DW_AT_name("OSTCBDly")
    1798                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_OSTCBDly")
    1799                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1800                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1801              
    1802              $C$DW$124       .dwtag  DW_TAG_member
    1803                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1804                      .dwattr $C$DW$124, DW_AT_name("OSTCBStat")
    1805                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_OSTCBStat")
    1806                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1807                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1808              
    1809              $C$DW$125       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1811                      .dwattr $C$DW$125, DW_AT_name("OSTCBStatPend")
    1812                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_OSTCBStatPend")
    1813                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1814                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1815              
    1816              $C$DW$126       .dwtag  DW_TAG_member
    1817                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1818                      .dwattr $C$DW$126, DW_AT_name("OSTCBPrio")
    1819                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_OSTCBPrio")
    1820                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1821                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1822              
    1823              $C$DW$127       .dwtag  DW_TAG_member
    1824                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1825                      .dwattr $C$DW$127, DW_AT_name("OSTCBX")
    1826                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_OSTCBX")
    1827                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1828                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1829              
    1830              $C$DW$128       .dwtag  DW_TAG_member
    1831                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1832                      .dwattr $C$DW$128, DW_AT_name("OSTCBY")
    1833                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_OSTCBY")
    1834                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1835                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1836              
    1837              $C$DW$129       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
    1839                      .dwattr $C$DW$129, DW_AT_name("OSTCBBitX")
    1840                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_OSTCBBitX")
    1841                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1842                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1843              
    1844              $C$DW$130       .dwtag  DW_TAG_member
    1845                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
    1846                      .dwattr $C$DW$130, DW_AT_name("OSTCBBitY")
    1847                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_OSTCBBitY")
    1848                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1849                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1850              
    1851              $C$DW$131       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   36

    1852                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1853                      .dwattr $C$DW$131, DW_AT_name("OSTCBDelReq")
    1854                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_OSTCBDelReq")
    1855                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1856                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1857              
    1858              $C$DW$132       .dwtag  DW_TAG_member
    1859                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$28)
    1860                      .dwattr $C$DW$132, DW_AT_name("OSTCBCtxSwCtr")
    1861                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    1862                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1863                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1864              
    1865              $C$DW$133       .dwtag  DW_TAG_member
    1866                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$28)
    1867                      .dwattr $C$DW$133, DW_AT_name("OSTCBCyclesTot")
    1868                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    1869                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1870                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1871              
    1872              $C$DW$134       .dwtag  DW_TAG_member
    1873                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$28)
    1874                      .dwattr $C$DW$134, DW_AT_name("OSTCBCyclesStart")
    1875                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    1876                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1877                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1878              
    1879              $C$DW$135       .dwtag  DW_TAG_member
    1880                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$34)
    1881                      .dwattr $C$DW$135, DW_AT_name("OSTCBStkBase")
    1882                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_OSTCBStkBase")
    1883                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1884                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1885              
    1886              $C$DW$136       .dwtag  DW_TAG_member
    1887                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$28)
    1888                      .dwattr $C$DW$136, DW_AT_name("OSTCBStkUsed")
    1889                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    1890                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1891                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1892              
    1893              $C$DW$137       .dwtag  DW_TAG_member
    1894                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    1895                      .dwattr $C$DW$137, DW_AT_name("OSTCBTaskName")
    1896                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OSTCBTaskName")
    1897                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1898                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1899              
    1900              $C$DW$138       .dwtag  DW_TAG_member
    1901                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$41)
    1902                      .dwattr $C$DW$138, DW_AT_name("OSTCBRegTbl")
    1903                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    1904                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1905                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1906              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   37

    1907                      .dwendtag $C$DW$T$42
    1908              
    1909              $C$DW$T$45      .dwtag  DW_TAG_typedef
    1910                      .dwattr $C$DW$T$45, DW_AT_name("OS_TCB")
    1911                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$42)
    1912                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    1913              
    1914              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    1915                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    1916                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    1917              
    1918              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1919                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$42)
    1920                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    1921              
    1922                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1923              
    1924              ;***************************************************************
    1925              ;* DWARF CIE ENTRIES                                           *
    1926              ;***************************************************************
    1927              
    1928              $C$DW$CIE       .dwcie 26
    1929                      .dwcfi  cfa_register, 20
    1930                      .dwcfi  cfa_offset, 0
    1931                      .dwcfi  same_value, 28
    1932                      .dwcfi  same_value, 6
    1933                      .dwcfi  same_value, 7
    1934                      .dwcfi  same_value, 8
    1935                      .dwcfi  same_value, 9
    1936                      .dwcfi  same_value, 10
    1937                      .dwcfi  same_value, 11
    1938                      .dwendentry
    1939              
    1940              ;***************************************************************
    1941              ;* DWARF REGISTER MAP                                          *
    1942              ;***************************************************************
    1943              
    1944              $C$DW$139       .dwtag  DW_TAG_TI_assign_register
    1945                      .dwattr $C$DW$139, DW_AT_name("AL")
    1946                      .dwattr $C$DW$139, DW_AT_location[DW_OP_reg0]
    1947              
    1948              $C$DW$140       .dwtag  DW_TAG_TI_assign_register
    1949                      .dwattr $C$DW$140, DW_AT_name("AH")
    1950                      .dwattr $C$DW$140, DW_AT_location[DW_OP_reg1]
    1951              
    1952              $C$DW$141       .dwtag  DW_TAG_TI_assign_register
    1953                      .dwattr $C$DW$141, DW_AT_name("PL")
    1954                      .dwattr $C$DW$141, DW_AT_location[DW_OP_reg2]
    1955              
    1956              $C$DW$142       .dwtag  DW_TAG_TI_assign_register
    1957                      .dwattr $C$DW$142, DW_AT_name("PH")
    1958                      .dwattr $C$DW$142, DW_AT_location[DW_OP_reg3]
    1959              
    1960              $C$DW$143       .dwtag  DW_TAG_TI_assign_register
    1961                      .dwattr $C$DW$143, DW_AT_name("SP")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_cpu_c.asm                                                         PAGE   38

    1962                      .dwattr $C$DW$143, DW_AT_location[DW_OP_reg20]
    1963              
    1964              $C$DW$144       .dwtag  DW_TAG_TI_assign_register
    1965                      .dwattr $C$DW$144, DW_AT_name("XT")
