TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan 11 16:45:35 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uC-LIB/lib_mem.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CPU_SW_Exception")

    5693                      .dwattr $C$DW$408, DW_AT_const_value(0x2775)
    5694              
    5695              $C$DW$409       .dwtag  DW_TAG_enumerator
    5696                      .dwattr $C$DW$409, DW_AT_name("LIB_MEM_ERR_INVALID_SEG_SIZE")
    5697                      .dwattr $C$DW$409, DW_AT_const_value(0x277e)
    5698              
    5699              $C$DW$410       .dwtag  DW_TAG_enumerator
    5700                      .dwattr $C$DW$410, DW_AT_name("LIB_MEM_ERR_INVALID_SEG_OVERLAP")
    5701                      .dwattr $C$DW$410, DW_AT_const_value(0x277f)
    5702              
    5703              $C$DW$411       .dwtag  DW_TAG_enumerator
    5704                      .dwattr $C$DW$411, DW_AT_name("LIB_MEM_ERR_INVALID_SEG_EXISTS")
    5705                      .dwattr $C$DW$411, DW_AT_const_value(0x2780)
    5706              
    5707              $C$DW$412       .dwtag  DW_TAG_enumerator
    5708                      .dwattr $C$DW$412, DW_AT_name("LIB_MEM_ERR_INVALID_POOL")
    5709                      .dwattr $C$DW$412, DW_AT_const_value(0x2788)
    5710              
    5711              $C$DW$413       .dwtag  DW_TAG_enumerator
    5712                      .dwattr $C$DW$413, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_NBR")
    5713                      .dwattr $C$DW$413, DW_AT_const_value(0x2792)
    5714              
    5715              $C$DW$414       .dwtag  DW_TAG_enumerator
    5716                      .dwattr $C$DW$414, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_SIZE")
    5717                      .dwattr $C$DW$414, DW_AT_const_value(0x2793)
    5718              
    5719              $C$DW$415       .dwtag  DW_TAG_enumerator
    5720                      .dwattr $C$DW$415, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_ALIGN")
    5721                      .dwattr $C$DW$415, DW_AT_const_value(0x2794)
    5722              
    5723              $C$DW$416       .dwtag  DW_TAG_enumerator
    5724                      .dwattr $C$DW$416, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_IX")
    5725                      .dwattr $C$DW$416, DW_AT_const_value(0x2795)
    5726              
    5727              $C$DW$417       .dwtag  DW_TAG_enumerator
    5728                      .dwattr $C$DW$417, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_ADDR")
    5729                      .dwattr $C$DW$417, DW_AT_const_value(0x2797)
    5730              
    5731              $C$DW$418       .dwtag  DW_TAG_enumerator
    5732                      .dwattr $C$DW$418, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_ADDR_IN_POOL")
    5733                      .dwattr $C$DW$418, DW_AT_const_value(0x2798)
    5734              
    5735              $C$DW$419       .dwtag  DW_TAG_enumerator
    5736                      .dwattr $C$DW$419, DW_AT_name("LIB_MEM_ERR_SEG_EMPTY")
    5737                      .dwattr $C$DW$419, DW_AT_const_value(0x27d8)
    5738              
    5739              $C$DW$420       .dwtag  DW_TAG_enumerator
    5740                      .dwattr $C$DW$420, DW_AT_name("LIB_MEM_ERR_SEG_OVF")
    5741                      .dwattr $C$DW$420, DW_AT_const_value(0x27d9)
    5742              
    5743              $C$DW$421       .dwtag  DW_TAG_enumerator
    5744                      .dwattr $C$DW$421, DW_AT_name("LIB_MEM_ERR_POOL_FULL")
    5745                      .dwattr $C$DW$421, DW_AT_const_value(0x27dd)
    5746              
    5747              $C$DW$422       .dwtag  DW_TAG_enumerator
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  109

    5748                      .dwattr $C$DW$422, DW_AT_name("LIB_MEM_ERR_POOL_EMPTY")
    5749                      .dwattr $C$DW$422, DW_AT_const_value(0x27de)
    5750              
    5751              $C$DW$423       .dwtag  DW_TAG_enumerator
    5752                      .dwattr $C$DW$423, DW_AT_name("LIB_MEM_ERR_POOL_UNLIMITED")
    5753                      .dwattr $C$DW$423, DW_AT_const_value(0x27df)
    5754              
    5755              $C$DW$424       .dwtag  DW_TAG_enumerator
    5756                      .dwattr $C$DW$424, DW_AT_name("LIB_MEM_ERR_HEAP_EMPTY")
    5757                      .dwattr $C$DW$424, DW_AT_const_value(0x27e2)
    5758              
    5759              $C$DW$425       .dwtag  DW_TAG_enumerator
    5760                      .dwattr $C$DW$425, DW_AT_name("LIB_MEM_ERR_HEAP_OVF")
    5761                      .dwattr $C$DW$425, DW_AT_const_value(0x27e3)
    5762              
    5763              $C$DW$426       .dwtag  DW_TAG_enumerator
    5764                      .dwattr $C$DW$426, DW_AT_name("LIB_MEM_ERR_HEAP_NOT_FOUND")
    5765                      .dwattr $C$DW$426, DW_AT_const_value(0x27e7)
    5766              
    5767                      .dwendtag $C$DW$T$31
    5768              
    5769              $C$DW$T$32      .dwtag  DW_TAG_typedef
    5770                      .dwattr $C$DW$T$32, DW_AT_name("LIB_ERR")
    5771                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    5772                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    5773              
    5774              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    5775                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    5776                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    5777              
    5778              
    5779              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5780                      .dwattr $C$DW$T$24, DW_AT_name("mem_dyn_pool")
    5781                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    5782              $C$DW$427       .dwtag  DW_TAG_member
    5783                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    5784                      .dwattr $C$DW$427, DW_AT_name("PoolSegPtr")
    5785                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_PoolSegPtr")
    5786                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5787                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5788              
    5789              $C$DW$428       .dwtag  DW_TAG_member
    5790                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$23)
    5791                      .dwattr $C$DW$428, DW_AT_name("BlkSize")
    5792                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_BlkSize")
    5793                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5794                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5795              
    5796              $C$DW$429       .dwtag  DW_TAG_member
    5797                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$23)
    5798                      .dwattr $C$DW$429, DW_AT_name("BlkAlign")
    5799                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_BlkAlign")
    5800                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5801                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5802              
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  110

    5803              $C$DW$430       .dwtag  DW_TAG_member
    5804                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$23)
    5805                      .dwattr $C$DW$430, DW_AT_name("BlkPaddingAlign")
    5806                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_BlkPaddingAlign")
    5807                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5808                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5809              
    5810              $C$DW$431       .dwtag  DW_TAG_member
    5811                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$3)
    5812                      .dwattr $C$DW$431, DW_AT_name("BlkFreePtr")
    5813                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_BlkFreePtr")
    5814                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5815                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5816              
    5817              $C$DW$432       .dwtag  DW_TAG_member
    5818                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
    5819                      .dwattr $C$DW$432, DW_AT_name("BlkQtyMax")
    5820                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_BlkQtyMax")
    5821                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5822                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5823              
    5824              $C$DW$433       .dwtag  DW_TAG_member
    5825                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$23)
    5826                      .dwattr $C$DW$433, DW_AT_name("BlkAllocCnt")
    5827                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_BlkAllocCnt")
    5828                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5829                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5830              
    5831                      .dwendtag $C$DW$T$24
    5832              
    5833              $C$DW$T$44      .dwtag  DW_TAG_typedef
    5834                      .dwattr $C$DW$T$44, DW_AT_name("MEM_DYN_POOL")
    5835                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$24)
    5836                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5837              
    5838              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5839                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5840                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5841              
    5842              
    5843              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5844                      .dwattr $C$DW$T$27, DW_AT_name("mem_pool")
    5845                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
    5846              $C$DW$434       .dwtag  DW_TAG_member
    5847                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$3)
    5848                      .dwattr $C$DW$434, DW_AT_name("PoolAddrStart")
    5849                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_PoolAddrStart")
    5850                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5851                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5852              
    5853              $C$DW$435       .dwtag  DW_TAG_member
    5854                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$3)
    5855                      .dwattr $C$DW$435, DW_AT_name("PoolAddrEnd")
    5856                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_PoolAddrEnd")
    5857                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  111

    5858                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5859              
    5860              $C$DW$436       .dwtag  DW_TAG_member
    5861                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$25)
    5862                      .dwattr $C$DW$436, DW_AT_name("BlkNbr")
    5863                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_BlkNbr")
    5864                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5865                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5866              
    5867              $C$DW$437       .dwtag  DW_TAG_member
    5868                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    5869                      .dwattr $C$DW$437, DW_AT_name("BlkSize")
    5870                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_BlkSize")
    5871                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5872                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5873              
    5874              $C$DW$438       .dwtag  DW_TAG_member
    5875                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$26)
    5876                      .dwattr $C$DW$438, DW_AT_name("BlkFreeTbl")
    5877                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_BlkFreeTbl")
    5878                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5879                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5880              
    5881              $C$DW$439       .dwtag  DW_TAG_member
    5882                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$23)
    5883                      .dwattr $C$DW$439, DW_AT_name("BlkFreeTblIx")
    5884                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_BlkFreeTblIx")
    5885                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5886                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5887              
    5888                      .dwendtag $C$DW$T$27
    5889              
    5890              $C$DW$T$41      .dwtag  DW_TAG_typedef
    5891                      .dwattr $C$DW$T$41, DW_AT_name("MEM_POOL")
    5892                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$27)
    5893                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    5894              
    5895              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5896                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    5897                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    5898              
    5899              
    5900              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5901                      .dwattr $C$DW$T$28, DW_AT_name("mem_seg")
    5902                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    5903              $C$DW$440       .dwtag  DW_TAG_member
    5904                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    5905                      .dwattr $C$DW$440, DW_AT_name("AddrBase")
    5906                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_AddrBase")
    5907                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5908                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5909              
    5910              $C$DW$441       .dwtag  DW_TAG_member
    5911                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    5912                      .dwattr $C$DW$441, DW_AT_name("AddrEnd")
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  112

    5913                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_AddrEnd")
    5914                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5915                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5916              
    5917              $C$DW$442       .dwtag  DW_TAG_member
    5918                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    5919                      .dwattr $C$DW$442, DW_AT_name("AddrNext")
    5920                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_AddrNext")
    5921                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5922                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5923              
    5924              $C$DW$443       .dwtag  DW_TAG_member
    5925                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    5926                      .dwattr $C$DW$443, DW_AT_name("NextPtr")
    5927                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_NextPtr")
    5928                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5929                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5930              
    5931              $C$DW$444       .dwtag  DW_TAG_member
    5932                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
    5933                      .dwattr $C$DW$444, DW_AT_name("PaddingAlign")
    5934                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_PaddingAlign")
    5935                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5936                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5937              
    5938                      .dwendtag $C$DW$T$28
    5939              
    5940              $C$DW$T$19      .dwtag  DW_TAG_typedef
    5941                      .dwattr $C$DW$T$19, DW_AT_name("MEM_SEG")
    5942                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$28)
    5943                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    5944              
    5945              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    5946                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    5947                      .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    5948              
    5949              
    5950              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5951                      .dwattr $C$DW$T$29, DW_AT_name("mem_seg_info")
    5952                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    5953              $C$DW$445       .dwtag  DW_TAG_member
    5954                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$23)
    5955                      .dwattr $C$DW$445, DW_AT_name("UsedSize")
    5956                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_UsedSize")
    5957                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5958                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5959              
    5960              $C$DW$446       .dwtag  DW_TAG_member
    5961                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
    5962                      .dwattr $C$DW$446, DW_AT_name("TotalSize")
    5963                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_TotalSize")
    5964                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5965                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5966              
    5967              $C$DW$447       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  113

    5968                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
    5969                      .dwattr $C$DW$447, DW_AT_name("AddrBase")
    5970                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_AddrBase")
    5971                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5972                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5973              
    5974              $C$DW$448       .dwtag  DW_TAG_member
    5975                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
    5976                      .dwattr $C$DW$448, DW_AT_name("AddrNextAlloc")
    5977                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_AddrNextAlloc")
    5978                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5979                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5980              
    5981                      .dwendtag $C$DW$T$29
    5982              
    5983              $C$DW$T$95      .dwtag  DW_TAG_typedef
    5984                      .dwattr $C$DW$T$95, DW_AT_name("MEM_SEG_INFO")
    5985                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$29)
    5986                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    5987              
    5988              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    5989                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    5990                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    5991              
    5992                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5993              
    5994              ;***************************************************************
    5995              ;* DWARF CIE ENTRIES                                           *
    5996              ;***************************************************************
    5997              
    5998              $C$DW$CIE       .dwcie 26
    5999                      .dwcfi  cfa_register, 20
    6000                      .dwcfi  cfa_offset, 0
    6001                      .dwcfi  same_value, 28
    6002                      .dwcfi  same_value, 6
    6003                      .dwcfi  same_value, 7
    6004                      .dwcfi  same_value, 8
    6005                      .dwcfi  same_value, 9
    6006                      .dwcfi  same_value, 10
    6007                      .dwcfi  same_value, 11
    6008                      .dwendentry
    6009              
    6010              ;***************************************************************
    6011              ;* DWARF REGISTER MAP                                          *
    6012              ;***************************************************************
    6013              
    6014              $C$DW$449       .dwtag  DW_TAG_TI_assign_register
    6015                      .dwattr $C$DW$449, DW_AT_name("AL")
    6016                      .dwattr $C$DW$449, DW_AT_location[DW_OP_reg0]
    6017              
    6018              $C$DW$450       .dwtag  DW_TAG_TI_assign_register
    6019                      .dwattr $C$DW$450, DW_AT_name("AH")
    6020                      .dwattr $C$DW$450, DW_AT_location[DW_OP_reg1]
    6021              
    6022              $C$DW$451       .dwtag  DW_TAG_TI_assign_register
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:35 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  114

    6023                      .dwattr $C$DW$451, DW_AT_name("PL")
    6024                      .dwattr $C$DW$451, DW_AT_location[DW_OP_reg2]
    6025              
    6026              $C$DW$452       .dwtag  DW_TAG_TI_assign_register
    6027                      .dwattr $C$DW$452, DW_AT_name("PH")
    6028                      .dwattr $C$DW$452, DW_AT_location[DW_OP_reg3]
    6029              
    6030              $C$DW$453       .dwtag  DW_TAG_TI_assign_register
    6031                      .dwattr $C$DW$453, DW_AT_name("SP")
    6032                      .dwattr $C$DW$453, DW_AT_location[DW_OP_reg20]
    6033              
    6034              $C$DW$454       .dwtag  DW_TAG_TI_assign_register
    6035                      .dwattr $C$DW$454, DW_AT_name("XT")
    6036                      .dwattr $C$DW$454, DW_AT_location[DW_OP_reg21]
    6037              
    6038              $C$DW$455       .dwtag  DW_TAG_TI_assign_register
    6039                      .dwattr $C$DW$455, DW_AT_name("T")
    6040                      .dwattr $C$DW$455, DW_AT_location[DW_OP_reg22]
    6041              
    6042              $C$DW$456       .dwtag  DW_TAG_TI_assign_register
