TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan  4 16:08:35 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/ImitatePLC/Software/uC-LIB/lib_mem.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\ImitatePLC\Examples\TI\TMDSDOCK2833
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("CPU_SW_Exception")

    5698                      .dwattr $C$DW$408, DW_AT_const_value(0x2775)
    5699              
    5700              $C$DW$409       .dwtag  DW_TAG_enumerator
    5701                      .dwattr $C$DW$409, DW_AT_name("LIB_MEM_ERR_INVALID_SEG_SIZE")
    5702                      .dwattr $C$DW$409, DW_AT_const_value(0x277e)
    5703              
    5704              $C$DW$410       .dwtag  DW_TAG_enumerator
    5705                      .dwattr $C$DW$410, DW_AT_name("LIB_MEM_ERR_INVALID_SEG_OVERLAP")
    5706                      .dwattr $C$DW$410, DW_AT_const_value(0x277f)
    5707              
    5708              $C$DW$411       .dwtag  DW_TAG_enumerator
    5709                      .dwattr $C$DW$411, DW_AT_name("LIB_MEM_ERR_INVALID_SEG_EXISTS")
    5710                      .dwattr $C$DW$411, DW_AT_const_value(0x2780)
    5711              
    5712              $C$DW$412       .dwtag  DW_TAG_enumerator
    5713                      .dwattr $C$DW$412, DW_AT_name("LIB_MEM_ERR_INVALID_POOL")
    5714                      .dwattr $C$DW$412, DW_AT_const_value(0x2788)
    5715              
    5716              $C$DW$413       .dwtag  DW_TAG_enumerator
    5717                      .dwattr $C$DW$413, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_NBR")
    5718                      .dwattr $C$DW$413, DW_AT_const_value(0x2792)
    5719              
    5720              $C$DW$414       .dwtag  DW_TAG_enumerator
    5721                      .dwattr $C$DW$414, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_SIZE")
    5722                      .dwattr $C$DW$414, DW_AT_const_value(0x2793)
    5723              
    5724              $C$DW$415       .dwtag  DW_TAG_enumerator
    5725                      .dwattr $C$DW$415, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_ALIGN")
    5726                      .dwattr $C$DW$415, DW_AT_const_value(0x2794)
    5727              
    5728              $C$DW$416       .dwtag  DW_TAG_enumerator
    5729                      .dwattr $C$DW$416, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_IX")
    5730                      .dwattr $C$DW$416, DW_AT_const_value(0x2795)
    5731              
    5732              $C$DW$417       .dwtag  DW_TAG_enumerator
    5733                      .dwattr $C$DW$417, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_ADDR")
    5734                      .dwattr $C$DW$417, DW_AT_const_value(0x2797)
    5735              
    5736              $C$DW$418       .dwtag  DW_TAG_enumerator
    5737                      .dwattr $C$DW$418, DW_AT_name("LIB_MEM_ERR_INVALID_BLK_ADDR_IN_POOL")
    5738                      .dwattr $C$DW$418, DW_AT_const_value(0x2798)
    5739              
    5740              $C$DW$419       .dwtag  DW_TAG_enumerator
    5741                      .dwattr $C$DW$419, DW_AT_name("LIB_MEM_ERR_SEG_EMPTY")
    5742                      .dwattr $C$DW$419, DW_AT_const_value(0x27d8)
    5743              
    5744              $C$DW$420       .dwtag  DW_TAG_enumerator
    5745                      .dwattr $C$DW$420, DW_AT_name("LIB_MEM_ERR_SEG_OVF")
    5746                      .dwattr $C$DW$420, DW_AT_const_value(0x27d9)
    5747              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  109

    5748              $C$DW$421       .dwtag  DW_TAG_enumerator
    5749                      .dwattr $C$DW$421, DW_AT_name("LIB_MEM_ERR_POOL_FULL")
    5750                      .dwattr $C$DW$421, DW_AT_const_value(0x27dd)
    5751              
    5752              $C$DW$422       .dwtag  DW_TAG_enumerator
    5753                      .dwattr $C$DW$422, DW_AT_name("LIB_MEM_ERR_POOL_EMPTY")
    5754                      .dwattr $C$DW$422, DW_AT_const_value(0x27de)
    5755              
    5756              $C$DW$423       .dwtag  DW_TAG_enumerator
    5757                      .dwattr $C$DW$423, DW_AT_name("LIB_MEM_ERR_POOL_UNLIMITED")
    5758                      .dwattr $C$DW$423, DW_AT_const_value(0x27df)
    5759              
    5760              $C$DW$424       .dwtag  DW_TAG_enumerator
    5761                      .dwattr $C$DW$424, DW_AT_name("LIB_MEM_ERR_HEAP_EMPTY")
    5762                      .dwattr $C$DW$424, DW_AT_const_value(0x27e2)
    5763              
    5764              $C$DW$425       .dwtag  DW_TAG_enumerator
    5765                      .dwattr $C$DW$425, DW_AT_name("LIB_MEM_ERR_HEAP_OVF")
    5766                      .dwattr $C$DW$425, DW_AT_const_value(0x27e3)
    5767              
    5768              $C$DW$426       .dwtag  DW_TAG_enumerator
    5769                      .dwattr $C$DW$426, DW_AT_name("LIB_MEM_ERR_HEAP_NOT_FOUND")
    5770                      .dwattr $C$DW$426, DW_AT_const_value(0x27e7)
    5771              
    5772                      .dwendtag $C$DW$T$31
    5773              
    5774              $C$DW$T$32      .dwtag  DW_TAG_typedef
    5775                      .dwattr $C$DW$T$32, DW_AT_name("LIB_ERR")
    5776                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    5777                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    5778              
    5779              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    5780                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    5781                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    5782              
    5783              
    5784              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    5785                      .dwattr $C$DW$T$24, DW_AT_name("mem_dyn_pool")
    5786                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x0e)
    5787              $C$DW$427       .dwtag  DW_TAG_member
    5788                      .dwattr $C$DW$427, DW_AT_type(*$C$DW$T$20)
    5789                      .dwattr $C$DW$427, DW_AT_name("PoolSegPtr")
    5790                      .dwattr $C$DW$427, DW_AT_TI_symbol_name("_PoolSegPtr")
    5791                      .dwattr $C$DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5792                      .dwattr $C$DW$427, DW_AT_accessibility(DW_ACCESS_public)
    5793              
    5794              $C$DW$428       .dwtag  DW_TAG_member
    5795                      .dwattr $C$DW$428, DW_AT_type(*$C$DW$T$23)
    5796                      .dwattr $C$DW$428, DW_AT_name("BlkSize")
    5797                      .dwattr $C$DW$428, DW_AT_TI_symbol_name("_BlkSize")
    5798                      .dwattr $C$DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5799                      .dwattr $C$DW$428, DW_AT_accessibility(DW_ACCESS_public)
    5800              
    5801              $C$DW$429       .dwtag  DW_TAG_member
    5802                      .dwattr $C$DW$429, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  110

    5803                      .dwattr $C$DW$429, DW_AT_name("BlkAlign")
    5804                      .dwattr $C$DW$429, DW_AT_TI_symbol_name("_BlkAlign")
    5805                      .dwattr $C$DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5806                      .dwattr $C$DW$429, DW_AT_accessibility(DW_ACCESS_public)
    5807              
    5808              $C$DW$430       .dwtag  DW_TAG_member
    5809                      .dwattr $C$DW$430, DW_AT_type(*$C$DW$T$23)
    5810                      .dwattr $C$DW$430, DW_AT_name("BlkPaddingAlign")
    5811                      .dwattr $C$DW$430, DW_AT_TI_symbol_name("_BlkPaddingAlign")
    5812                      .dwattr $C$DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5813                      .dwattr $C$DW$430, DW_AT_accessibility(DW_ACCESS_public)
    5814              
    5815              $C$DW$431       .dwtag  DW_TAG_member
    5816                      .dwattr $C$DW$431, DW_AT_type(*$C$DW$T$3)
    5817                      .dwattr $C$DW$431, DW_AT_name("BlkFreePtr")
    5818                      .dwattr $C$DW$431, DW_AT_TI_symbol_name("_BlkFreePtr")
    5819                      .dwattr $C$DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5820                      .dwattr $C$DW$431, DW_AT_accessibility(DW_ACCESS_public)
    5821              
    5822              $C$DW$432       .dwtag  DW_TAG_member
    5823                      .dwattr $C$DW$432, DW_AT_type(*$C$DW$T$23)
    5824                      .dwattr $C$DW$432, DW_AT_name("BlkQtyMax")
    5825                      .dwattr $C$DW$432, DW_AT_TI_symbol_name("_BlkQtyMax")
    5826                      .dwattr $C$DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5827                      .dwattr $C$DW$432, DW_AT_accessibility(DW_ACCESS_public)
    5828              
    5829              $C$DW$433       .dwtag  DW_TAG_member
    5830                      .dwattr $C$DW$433, DW_AT_type(*$C$DW$T$23)
    5831                      .dwattr $C$DW$433, DW_AT_name("BlkAllocCnt")
    5832                      .dwattr $C$DW$433, DW_AT_TI_symbol_name("_BlkAllocCnt")
    5833                      .dwattr $C$DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5834                      .dwattr $C$DW$433, DW_AT_accessibility(DW_ACCESS_public)
    5835              
    5836                      .dwendtag $C$DW$T$24
    5837              
    5838              $C$DW$T$44      .dwtag  DW_TAG_typedef
    5839                      .dwattr $C$DW$T$44, DW_AT_name("MEM_DYN_POOL")
    5840                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$24)
    5841                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    5842              
    5843              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    5844                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    5845                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    5846              
    5847              
    5848              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    5849                      .dwattr $C$DW$T$27, DW_AT_name("mem_pool")
    5850                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
    5851              $C$DW$434       .dwtag  DW_TAG_member
    5852                      .dwattr $C$DW$434, DW_AT_type(*$C$DW$T$3)
    5853                      .dwattr $C$DW$434, DW_AT_name("PoolAddrStart")
    5854                      .dwattr $C$DW$434, DW_AT_TI_symbol_name("_PoolAddrStart")
    5855                      .dwattr $C$DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5856                      .dwattr $C$DW$434, DW_AT_accessibility(DW_ACCESS_public)
    5857              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  111

    5858              $C$DW$435       .dwtag  DW_TAG_member
    5859                      .dwattr $C$DW$435, DW_AT_type(*$C$DW$T$3)
    5860                      .dwattr $C$DW$435, DW_AT_name("PoolAddrEnd")
    5861                      .dwattr $C$DW$435, DW_AT_TI_symbol_name("_PoolAddrEnd")
    5862                      .dwattr $C$DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5863                      .dwattr $C$DW$435, DW_AT_accessibility(DW_ACCESS_public)
    5864              
    5865              $C$DW$436       .dwtag  DW_TAG_member
    5866                      .dwattr $C$DW$436, DW_AT_type(*$C$DW$T$25)
    5867                      .dwattr $C$DW$436, DW_AT_name("BlkNbr")
    5868                      .dwattr $C$DW$436, DW_AT_TI_symbol_name("_BlkNbr")
    5869                      .dwattr $C$DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5870                      .dwattr $C$DW$436, DW_AT_accessibility(DW_ACCESS_public)
    5871              
    5872              $C$DW$437       .dwtag  DW_TAG_member
    5873                      .dwattr $C$DW$437, DW_AT_type(*$C$DW$T$23)
    5874                      .dwattr $C$DW$437, DW_AT_name("BlkSize")
    5875                      .dwattr $C$DW$437, DW_AT_TI_symbol_name("_BlkSize")
    5876                      .dwattr $C$DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5877                      .dwattr $C$DW$437, DW_AT_accessibility(DW_ACCESS_public)
    5878              
    5879              $C$DW$438       .dwtag  DW_TAG_member
    5880                      .dwattr $C$DW$438, DW_AT_type(*$C$DW$T$26)
    5881                      .dwattr $C$DW$438, DW_AT_name("BlkFreeTbl")
    5882                      .dwattr $C$DW$438, DW_AT_TI_symbol_name("_BlkFreeTbl")
    5883                      .dwattr $C$DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5884                      .dwattr $C$DW$438, DW_AT_accessibility(DW_ACCESS_public)
    5885              
    5886              $C$DW$439       .dwtag  DW_TAG_member
    5887                      .dwattr $C$DW$439, DW_AT_type(*$C$DW$T$23)
    5888                      .dwattr $C$DW$439, DW_AT_name("BlkFreeTblIx")
    5889                      .dwattr $C$DW$439, DW_AT_TI_symbol_name("_BlkFreeTblIx")
    5890                      .dwattr $C$DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5891                      .dwattr $C$DW$439, DW_AT_accessibility(DW_ACCESS_public)
    5892              
    5893                      .dwendtag $C$DW$T$27
    5894              
    5895              $C$DW$T$41      .dwtag  DW_TAG_typedef
    5896                      .dwattr $C$DW$T$41, DW_AT_name("MEM_POOL")
    5897                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$27)
    5898                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    5899              
    5900              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    5901                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    5902                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    5903              
    5904              
    5905              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    5906                      .dwattr $C$DW$T$28, DW_AT_name("mem_seg")
    5907                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0a)
    5908              $C$DW$440       .dwtag  DW_TAG_member
    5909                      .dwattr $C$DW$440, DW_AT_type(*$C$DW$T$22)
    5910                      .dwattr $C$DW$440, DW_AT_name("AddrBase")
    5911                      .dwattr $C$DW$440, DW_AT_TI_symbol_name("_AddrBase")
    5912                      .dwattr $C$DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  112

    5913                      .dwattr $C$DW$440, DW_AT_accessibility(DW_ACCESS_public)
    5914              
    5915              $C$DW$441       .dwtag  DW_TAG_member
    5916                      .dwattr $C$DW$441, DW_AT_type(*$C$DW$T$22)
    5917                      .dwattr $C$DW$441, DW_AT_name("AddrEnd")
    5918                      .dwattr $C$DW$441, DW_AT_TI_symbol_name("_AddrEnd")
    5919                      .dwattr $C$DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5920                      .dwattr $C$DW$441, DW_AT_accessibility(DW_ACCESS_public)
    5921              
    5922              $C$DW$442       .dwtag  DW_TAG_member
    5923                      .dwattr $C$DW$442, DW_AT_type(*$C$DW$T$22)
    5924                      .dwattr $C$DW$442, DW_AT_name("AddrNext")
    5925                      .dwattr $C$DW$442, DW_AT_TI_symbol_name("_AddrNext")
    5926                      .dwattr $C$DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5927                      .dwattr $C$DW$442, DW_AT_accessibility(DW_ACCESS_public)
    5928              
    5929              $C$DW$443       .dwtag  DW_TAG_member
    5930                      .dwattr $C$DW$443, DW_AT_type(*$C$DW$T$20)
    5931                      .dwattr $C$DW$443, DW_AT_name("NextPtr")
    5932                      .dwattr $C$DW$443, DW_AT_TI_symbol_name("_NextPtr")
    5933                      .dwattr $C$DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5934                      .dwattr $C$DW$443, DW_AT_accessibility(DW_ACCESS_public)
    5935              
    5936              $C$DW$444       .dwtag  DW_TAG_member
    5937                      .dwattr $C$DW$444, DW_AT_type(*$C$DW$T$23)
    5938                      .dwattr $C$DW$444, DW_AT_name("PaddingAlign")
    5939                      .dwattr $C$DW$444, DW_AT_TI_symbol_name("_PaddingAlign")
    5940                      .dwattr $C$DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5941                      .dwattr $C$DW$444, DW_AT_accessibility(DW_ACCESS_public)
    5942              
    5943                      .dwendtag $C$DW$T$28
    5944              
    5945              $C$DW$T$19      .dwtag  DW_TAG_typedef
    5946                      .dwattr $C$DW$T$19, DW_AT_name("MEM_SEG")
    5947                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$28)
    5948                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    5949              
    5950              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    5951                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    5952                      .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    5953              
    5954              
    5955              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    5956                      .dwattr $C$DW$T$29, DW_AT_name("mem_seg_info")
    5957                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    5958              $C$DW$445       .dwtag  DW_TAG_member
    5959                      .dwattr $C$DW$445, DW_AT_type(*$C$DW$T$23)
    5960                      .dwattr $C$DW$445, DW_AT_name("UsedSize")
    5961                      .dwattr $C$DW$445, DW_AT_TI_symbol_name("_UsedSize")
    5962                      .dwattr $C$DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5963                      .dwattr $C$DW$445, DW_AT_accessibility(DW_ACCESS_public)
    5964              
    5965              $C$DW$446       .dwtag  DW_TAG_member
    5966                      .dwattr $C$DW$446, DW_AT_type(*$C$DW$T$23)
    5967                      .dwattr $C$DW$446, DW_AT_name("TotalSize")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  113

    5968                      .dwattr $C$DW$446, DW_AT_TI_symbol_name("_TotalSize")
    5969                      .dwattr $C$DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5970                      .dwattr $C$DW$446, DW_AT_accessibility(DW_ACCESS_public)
    5971              
    5972              $C$DW$447       .dwtag  DW_TAG_member
    5973                      .dwattr $C$DW$447, DW_AT_type(*$C$DW$T$22)
    5974                      .dwattr $C$DW$447, DW_AT_name("AddrBase")
    5975                      .dwattr $C$DW$447, DW_AT_TI_symbol_name("_AddrBase")
    5976                      .dwattr $C$DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5977                      .dwattr $C$DW$447, DW_AT_accessibility(DW_ACCESS_public)
    5978              
    5979              $C$DW$448       .dwtag  DW_TAG_member
    5980                      .dwattr $C$DW$448, DW_AT_type(*$C$DW$T$22)
    5981                      .dwattr $C$DW$448, DW_AT_name("AddrNextAlloc")
    5982                      .dwattr $C$DW$448, DW_AT_TI_symbol_name("_AddrNextAlloc")
    5983                      .dwattr $C$DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5984                      .dwattr $C$DW$448, DW_AT_accessibility(DW_ACCESS_public)
    5985              
    5986                      .dwendtag $C$DW$T$29
    5987              
    5988              $C$DW$T$95      .dwtag  DW_TAG_typedef
    5989                      .dwattr $C$DW$T$95, DW_AT_name("MEM_SEG_INFO")
    5990                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$29)
    5991                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    5992              
    5993              $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    5994                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    5995                      .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    5996              
    5997                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    5998              
    5999              ;***************************************************************
    6000              ;* DWARF CIE ENTRIES                                           *
    6001              ;***************************************************************
    6002              
    6003              $C$DW$CIE       .dwcie 26
    6004                      .dwcfi  cfa_register, 20
    6005                      .dwcfi  cfa_offset, 0
    6006                      .dwcfi  same_value, 28
    6007                      .dwcfi  same_value, 6
    6008                      .dwcfi  same_value, 7
    6009                      .dwcfi  same_value, 8
    6010                      .dwcfi  same_value, 9
    6011                      .dwcfi  same_value, 10
    6012                      .dwcfi  same_value, 11
    6013                      .dwcfi  same_value, 59
    6014                      .dwcfi  same_value, 63
    6015                      .dwcfi  same_value, 67
    6016                      .dwcfi  same_value, 71
    6017                      .dwendentry
    6018              
    6019              ;***************************************************************
    6020              ;* DWARF REGISTER MAP                                          *
    6021              ;***************************************************************
    6022              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:36 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
lib_mem.asm                                                          PAGE  114

    6023              $C$DW$449       .dwtag  DW_TAG_TI_assign_register
    6024                      .dwattr $C$DW$449, DW_AT_name("AL")
    6025                      .dwattr $C$DW$449, DW_AT_location[DW_OP_reg0]
    6026              
    6027              $C$DW$450       .dwtag  DW_TAG_TI_assign_register
    6028                      .dwattr $C$DW$450, DW_AT_name("AH")
    6029                      .dwattr $C$DW$450, DW_AT_location[DW_OP_reg1]
    6030              
    6031              $C$DW$451       .dwtag  DW_TAG_TI_assign_register
    6032                      .dwattr $C$DW$451, DW_AT_name("PL")
    6033                      .dwattr $C$DW$451, DW_AT_location[DW_OP_reg2]
    6034              
    6035              $C$DW$452       .dwtag  DW_TAG_TI_assign_register
    6036                      .dwattr $C$DW$452, DW_AT_name("PH")
    6037                      .dwattr $C$DW$452, DW_AT_location[DW_OP_reg3]
    6038              
    6039              $C$DW$453       .dwtag  DW_TAG_TI_assign_register
    6040                      .dwattr $C$DW$453, DW_AT_name("SP")
    6041                      .dwattr $C$DW$453, DW_AT_location[DW_OP_reg20]
    6042              
    6043              $C$DW$454       .dwtag  DW_TAG_TI_assign_register
    6044                      .dwattr $C$DW$454, DW_AT_name("XT")
    6045                      .dwattr $C$DW$454, DW_AT_location[DW_OP_reg21]
    6046              
    6047              $C$DW$455       .dwtag  DW_TAG_TI_assign_register
