TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue Feb 16 00:15:57 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_core.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    6458              $C$DW$T$34      .dwtag  DW_TAG_typedef
    6459                      .dwattr $C$DW$T$34, DW_AT_name("OS_STK")
    6460                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$9)
    6461                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    6462              
    6463              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    6464                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    6465                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    6466              
    6467              
    6468              $C$DW$T$95      .dwtag  DW_TAG_array_type
    6469                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$34)
    6470                      .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    6471                      .dwattr $C$DW$T$95, DW_AT_byte_size(0x100)
    6472              $C$DW$356       .dwtag  DW_TAG_subrange_type
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  124

    6473                      .dwattr $C$DW$356, DW_AT_upper_bound(0xff)
    6474              
    6475                      .dwendtag $C$DW$T$95
    6476              
    6477              $C$DW$T$10      .dwtag  DW_TAG_base_type
    6478                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    6479                      .dwattr $C$DW$T$10, DW_AT_name("int")
    6480                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    6481              
    6482              $C$DW$T$11      .dwtag  DW_TAG_base_type
    6483                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    6484                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    6485                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    6486              
    6487              $C$DW$T$12      .dwtag  DW_TAG_base_type
    6488                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    6489                      .dwattr $C$DW$T$12, DW_AT_name("long")
    6490                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    6491              
    6492              $C$DW$T$13      .dwtag  DW_TAG_base_type
    6493                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    6494                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    6495                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    6496              
    6497              $C$DW$T$28      .dwtag  DW_TAG_typedef
    6498                      .dwattr $C$DW$T$28, DW_AT_name("INT32U")
    6499                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$13)
    6500                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    6501              
    6502              $C$DW$357       .dwtag  DW_TAG_TI_far_type
    6503                      .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$28)
    6504              
    6505              $C$DW$T$96      .dwtag  DW_TAG_volatile_type
    6506                      .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$357)
    6507              
    6508              
    6509              $C$DW$T$42      .dwtag  DW_TAG_array_type
    6510                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$28)
    6511                      .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    6512                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x02)
    6513              $C$DW$358       .dwtag  DW_TAG_subrange_type
    6514                      .dwattr $C$DW$358, DW_AT_upper_bound(0x00)
    6515              
    6516                      .dwendtag $C$DW$T$42
    6517              
    6518              $C$DW$T$14      .dwtag  DW_TAG_base_type
    6519                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    6520                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    6521                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    6522              
    6523              $C$DW$T$15      .dwtag  DW_TAG_base_type
    6524                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    6525                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    6526                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    6527              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  125

    6528              $C$DW$T$16      .dwtag  DW_TAG_base_type
    6529                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    6530                      .dwattr $C$DW$T$16, DW_AT_name("float")
    6531                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    6532              
    6533              $C$DW$T$17      .dwtag  DW_TAG_base_type
    6534                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    6535                      .dwattr $C$DW$T$17, DW_AT_name("double")
    6536                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    6537              
    6538              $C$DW$T$18      .dwtag  DW_TAG_base_type
    6539                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    6540                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    6541                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    6542              
    6543              
    6544              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    6545                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    6546                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    6547              $C$DW$359       .dwtag  DW_TAG_member
    6548                      .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$19)
    6549                      .dwattr $C$DW$359, DW_AT_name("OSEventType")
    6550                      .dwattr $C$DW$359, DW_AT_TI_symbol_name("_OSEventType")
    6551                      .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6552                      .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    6553              
    6554              $C$DW$360       .dwtag  DW_TAG_member
    6555                      .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$3)
    6556                      .dwattr $C$DW$360, DW_AT_name("OSEventPtr")
    6557                      .dwattr $C$DW$360, DW_AT_TI_symbol_name("_OSEventPtr")
    6558                      .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6559                      .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    6560              
    6561              $C$DW$361       .dwtag  DW_TAG_member
    6562                      .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$20)
    6563                      .dwattr $C$DW$361, DW_AT_name("OSEventCnt")
    6564                      .dwattr $C$DW$361, DW_AT_TI_symbol_name("_OSEventCnt")
    6565                      .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6566                      .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    6567              
    6568              $C$DW$362       .dwtag  DW_TAG_member
    6569                      .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$21)
    6570                      .dwattr $C$DW$362, DW_AT_name("OSEventGrp")
    6571                      .dwattr $C$DW$362, DW_AT_TI_symbol_name("_OSEventGrp")
    6572                      .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    6573                      .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    6574              
    6575              $C$DW$363       .dwtag  DW_TAG_member
    6576                      .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$22)
    6577                      .dwattr $C$DW$363, DW_AT_name("OSEventTbl")
    6578                      .dwattr $C$DW$363, DW_AT_TI_symbol_name("_OSEventTbl")
    6579                      .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6580                      .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    6581              
    6582              $C$DW$364       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  126

    6583                      .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$23)
    6584                      .dwattr $C$DW$364, DW_AT_name("OSEventName")
    6585                      .dwattr $C$DW$364, DW_AT_TI_symbol_name("_OSEventName")
    6586                      .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6587                      .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    6588              
    6589                      .dwendtag $C$DW$T$24
    6590              
    6591              $C$DW$T$37      .dwtag  DW_TAG_typedef
    6592                      .dwattr $C$DW$T$37, DW_AT_name("OS_EVENT")
    6593                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$24)
    6594                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    6595              
    6596              $C$DW$T$38      .dwtag  DW_TAG_pointer_type
    6597                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$37)
    6598                      .dwattr $C$DW$T$38, DW_AT_address_class(0x20)
    6599              
    6600              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    6601                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    6602                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    6603              
    6604              
    6605              $C$DW$T$100     .dwtag  DW_TAG_array_type
    6606                      .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$37)
    6607                      .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    6608                      .dwattr $C$DW$T$100, DW_AT_byte_size(0xa0)
    6609              $C$DW$365       .dwtag  DW_TAG_subrange_type
    6610                      .dwattr $C$DW$365, DW_AT_upper_bound(0x09)
    6611              
    6612                      .dwendtag $C$DW$T$100
    6613              
    6614              
    6615              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    6616                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_grp")
    6617                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    6618              $C$DW$366       .dwtag  DW_TAG_member
    6619                      .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$19)
    6620                      .dwattr $C$DW$366, DW_AT_name("OSFlagType")
    6621                      .dwattr $C$DW$366, DW_AT_TI_symbol_name("_OSFlagType")
    6622                      .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6623                      .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6624              
    6625              $C$DW$367       .dwtag  DW_TAG_member
    6626                      .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$3)
    6627                      .dwattr $C$DW$367, DW_AT_name("OSFlagWaitList")
    6628                      .dwattr $C$DW$367, DW_AT_TI_symbol_name("_OSFlagWaitList")
    6629                      .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6630                      .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6631              
    6632              $C$DW$368       .dwtag  DW_TAG_member
    6633                      .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$25)
    6634                      .dwattr $C$DW$368, DW_AT_name("OSFlagFlags")
    6635                      .dwattr $C$DW$368, DW_AT_TI_symbol_name("_OSFlagFlags")
    6636                      .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6637                      .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  127

    6638              
    6639              $C$DW$369       .dwtag  DW_TAG_member
    6640                      .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$23)
    6641                      .dwattr $C$DW$369, DW_AT_name("OSFlagName")
    6642                      .dwattr $C$DW$369, DW_AT_TI_symbol_name("_OSFlagName")
    6643                      .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6644                      .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6645              
    6646                      .dwendtag $C$DW$T$26
    6647              
    6648              $C$DW$T$101     .dwtag  DW_TAG_typedef
    6649                      .dwattr $C$DW$T$101, DW_AT_name("OS_FLAG_GRP")
    6650                      .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$26)
    6651                      .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    6652              
    6653              
    6654              $C$DW$T$102     .dwtag  DW_TAG_array_type
    6655                      .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    6656                      .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    6657                      .dwattr $C$DW$T$102, DW_AT_byte_size(0x28)
    6658              $C$DW$370       .dwtag  DW_TAG_subrange_type
    6659                      .dwattr $C$DW$370, DW_AT_upper_bound(0x04)
    6660              
    6661                      .dwendtag $C$DW$T$102
    6662              
    6663              $C$DW$T$103     .dwtag  DW_TAG_pointer_type
    6664                      .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$101)
    6665                      .dwattr $C$DW$T$103, DW_AT_address_class(0x20)
    6666              
    6667              
    6668              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    6669                      .dwattr $C$DW$T$27, DW_AT_name("os_flag_node")
    6670                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    6671              $C$DW$371       .dwtag  DW_TAG_member
    6672                      .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$3)
    6673                      .dwattr $C$DW$371, DW_AT_name("OSFlagNodeNext")
    6674                      .dwattr $C$DW$371, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    6675                      .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6676                      .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6677              
    6678              $C$DW$372       .dwtag  DW_TAG_member
    6679                      .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$3)
    6680                      .dwattr $C$DW$372, DW_AT_name("OSFlagNodePrev")
    6681                      .dwattr $C$DW$372, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    6682                      .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6683                      .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6684              
    6685              $C$DW$373       .dwtag  DW_TAG_member
    6686                      .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$3)
    6687                      .dwattr $C$DW$373, DW_AT_name("OSFlagNodeTCB")
    6688                      .dwattr $C$DW$373, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    6689                      .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6690                      .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6691              
    6692              $C$DW$374       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  128

    6693                      .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$3)
    6694                      .dwattr $C$DW$374, DW_AT_name("OSFlagNodeFlagGrp")
    6695                      .dwattr $C$DW$374, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    6696                      .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6697                      .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6698              
    6699              $C$DW$375       .dwtag  DW_TAG_member
    6700                      .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$25)
    6701                      .dwattr $C$DW$375, DW_AT_name("OSFlagNodeFlags")
    6702                      .dwattr $C$DW$375, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    6703                      .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6704                      .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6705              
    6706              $C$DW$376       .dwtag  DW_TAG_member
    6707                      .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$19)
    6708                      .dwattr $C$DW$376, DW_AT_name("OSFlagNodeWaitType")
    6709                      .dwattr $C$DW$376, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    6710                      .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6711                      .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6712              
    6713                      .dwendtag $C$DW$T$27
    6714              
    6715              $C$DW$T$40      .dwtag  DW_TAG_typedef
    6716                      .dwattr $C$DW$T$40, DW_AT_name("OS_FLAG_NODE")
    6717                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$27)
    6718                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    6719              
    6720              $C$DW$T$41      .dwtag  DW_TAG_pointer_type
    6721                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$40)
    6722                      .dwattr $C$DW$T$41, DW_AT_address_class(0x20)
    6723              
    6724              
    6725              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    6726                      .dwattr $C$DW$T$29, DW_AT_name("os_mem")
    6727                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    6728              $C$DW$377       .dwtag  DW_TAG_member
    6729                      .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$3)
    6730                      .dwattr $C$DW$377, DW_AT_name("OSMemAddr")
    6731                      .dwattr $C$DW$377, DW_AT_TI_symbol_name("_OSMemAddr")
    6732                      .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6733                      .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6734              
    6735              $C$DW$378       .dwtag  DW_TAG_member
    6736                      .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$3)
    6737                      .dwattr $C$DW$378, DW_AT_name("OSMemFreeList")
    6738                      .dwattr $C$DW$378, DW_AT_TI_symbol_name("_OSMemFreeList")
    6739                      .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6740                      .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6741              
    6742              $C$DW$379       .dwtag  DW_TAG_member
    6743                      .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$28)
    6744                      .dwattr $C$DW$379, DW_AT_name("OSMemBlkSize")
    6745                      .dwattr $C$DW$379, DW_AT_TI_symbol_name("_OSMemBlkSize")
    6746                      .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6747                      .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  129

    6748              
    6749              $C$DW$380       .dwtag  DW_TAG_member
    6750                      .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$28)
    6751                      .dwattr $C$DW$380, DW_AT_name("OSMemNBlks")
    6752                      .dwattr $C$DW$380, DW_AT_TI_symbol_name("_OSMemNBlks")
    6753                      .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6754                      .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6755              
    6756              $C$DW$381       .dwtag  DW_TAG_member
    6757                      .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$28)
    6758                      .dwattr $C$DW$381, DW_AT_name("OSMemNFree")
    6759                      .dwattr $C$DW$381, DW_AT_TI_symbol_name("_OSMemNFree")
    6760                      .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6761                      .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6762              
    6763              $C$DW$382       .dwtag  DW_TAG_member
    6764                      .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$23)
    6765                      .dwattr $C$DW$382, DW_AT_name("OSMemName")
    6766                      .dwattr $C$DW$382, DW_AT_TI_symbol_name("_OSMemName")
    6767                      .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6768                      .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6769              
    6770                      .dwendtag $C$DW$T$29
    6771              
    6772              $C$DW$T$104     .dwtag  DW_TAG_typedef
    6773                      .dwattr $C$DW$T$104, DW_AT_name("OS_MEM")
    6774                      .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$29)
    6775                      .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    6776              
    6777              $C$DW$T$105     .dwtag  DW_TAG_pointer_type
    6778                      .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$104)
    6779                      .dwattr $C$DW$T$105, DW_AT_address_class(0x20)
    6780              
    6781              
    6782              $C$DW$T$106     .dwtag  DW_TAG_array_type
    6783                      .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$104)
    6784                      .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    6785                      .dwattr $C$DW$T$106, DW_AT_byte_size(0x3c)
    6786              $C$DW$383       .dwtag  DW_TAG_subrange_type
    6787                      .dwattr $C$DW$383, DW_AT_upper_bound(0x04)
    6788              
    6789                      .dwendtag $C$DW$T$106
    6790              
    6791              
    6792              $C$DW$T$32      .dwtag  DW_TAG_structure_type
    6793                      .dwattr $C$DW$T$32, DW_AT_name("os_q")
    6794                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x0c)
    6795              $C$DW$384       .dwtag  DW_TAG_member
    6796                      .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$30)
    6797                      .dwattr $C$DW$384, DW_AT_name("OSQPtr")
    6798                      .dwattr $C$DW$384, DW_AT_TI_symbol_name("_OSQPtr")
    6799                      .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6800                      .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6801              
    6802              $C$DW$385       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  130

    6803                      .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$31)
    6804                      .dwattr $C$DW$385, DW_AT_name("OSQStart")
    6805                      .dwattr $C$DW$385, DW_AT_TI_symbol_name("_OSQStart")
    6806                      .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6807                      .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6808              
    6809              $C$DW$386       .dwtag  DW_TAG_member
    6810                      .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$31)
    6811                      .dwattr $C$DW$386, DW_AT_name("OSQEnd")
    6812                      .dwattr $C$DW$386, DW_AT_TI_symbol_name("_OSQEnd")
    6813                      .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6814                      .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6815              
    6816              $C$DW$387       .dwtag  DW_TAG_member
    6817                      .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$31)
    6818                      .dwattr $C$DW$387, DW_AT_name("OSQIn")
    6819                      .dwattr $C$DW$387, DW_AT_TI_symbol_name("_OSQIn")
    6820                      .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6821                      .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6822              
    6823              $C$DW$388       .dwtag  DW_TAG_member
    6824                      .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$31)
    6825                      .dwattr $C$DW$388, DW_AT_name("OSQOut")
    6826                      .dwattr $C$DW$388, DW_AT_TI_symbol_name("_OSQOut")
    6827                      .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6828                      .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6829              
    6830              $C$DW$389       .dwtag  DW_TAG_member
    6831                      .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$20)
    6832                      .dwattr $C$DW$389, DW_AT_name("OSQSize")
    6833                      .dwattr $C$DW$389, DW_AT_TI_symbol_name("_OSQSize")
    6834                      .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6835                      .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6836              
    6837              $C$DW$390       .dwtag  DW_TAG_member
    6838                      .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$20)
    6839                      .dwattr $C$DW$390, DW_AT_name("OSQEntries")
    6840                      .dwattr $C$DW$390, DW_AT_TI_symbol_name("_OSQEntries")
    6841                      .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    6842                      .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6843              
    6844                      .dwendtag $C$DW$T$32
    6845              
    6846              $C$DW$T$107     .dwtag  DW_TAG_typedef
    6847                      .dwattr $C$DW$T$107, DW_AT_name("OS_Q")
    6848                      .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$32)
    6849                      .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    6850              
    6851              $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    6852                      .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    6853                      .dwattr $C$DW$T$108, DW_AT_address_class(0x20)
    6854              
    6855              
    6856              $C$DW$T$109     .dwtag  DW_TAG_array_type
    6857                      .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$107)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  131

    6858                      .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    6859                      .dwattr $C$DW$T$109, DW_AT_byte_size(0x30)
    6860              $C$DW$391       .dwtag  DW_TAG_subrange_type
    6861                      .dwattr $C$DW$391, DW_AT_upper_bound(0x03)
    6862              
    6863                      .dwendtag $C$DW$T$109
    6864              
    6865              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    6866                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$32)
    6867                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    6868              
    6869              
    6870              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    6871                      .dwattr $C$DW$T$33, DW_AT_name("os_stk_data")
    6872                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x04)
    6873              $C$DW$392       .dwtag  DW_TAG_member
    6874                      .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$28)
    6875                      .dwattr $C$DW$392, DW_AT_name("OSFree")
    6876                      .dwattr $C$DW$392, DW_AT_TI_symbol_name("_OSFree")
    6877                      .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6878                      .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6879              
    6880              $C$DW$393       .dwtag  DW_TAG_member
    6881                      .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$28)
    6882                      .dwattr $C$DW$393, DW_AT_name("OSUsed")
    6883                      .dwattr $C$DW$393, DW_AT_TI_symbol_name("_OSUsed")
    6884                      .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6885                      .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6886              
    6887                      .dwendtag $C$DW$T$33
    6888              
    6889              $C$DW$T$80      .dwtag  DW_TAG_typedef
    6890                      .dwattr $C$DW$T$80, DW_AT_name("OS_STK_DATA")
    6891                      .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$33)
    6892                      .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    6893              
    6894              $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    6895                      .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    6896                      .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    6897              
    6898              
    6899              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    6900                      .dwattr $C$DW$T$43, DW_AT_name("os_tcb")
    6901                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x30)
    6902              $C$DW$394       .dwtag  DW_TAG_member
    6903                      .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$35)
    6904                      .dwattr $C$DW$394, DW_AT_name("OSTCBStkPtr")
    6905                      .dwattr $C$DW$394, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    6906                      .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6907                      .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6908              
    6909              $C$DW$395       .dwtag  DW_TAG_member
    6910                      .dwattr $C$DW$395, DW_AT_type(*$C$DW$T$3)
    6911                      .dwattr $C$DW$395, DW_AT_name("OSTCBExtPtr")
    6912                      .dwattr $C$DW$395, DW_AT_TI_symbol_name("_OSTCBExtPtr")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  132

    6913                      .dwattr $C$DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6914                      .dwattr $C$DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6915              
    6916              $C$DW$396       .dwtag  DW_TAG_member
    6917                      .dwattr $C$DW$396, DW_AT_type(*$C$DW$T$35)
    6918                      .dwattr $C$DW$396, DW_AT_name("OSTCBStkBottom")
    6919                      .dwattr $C$DW$396, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    6920                      .dwattr $C$DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6921                      .dwattr $C$DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6922              
    6923              $C$DW$397       .dwtag  DW_TAG_member
    6924                      .dwattr $C$DW$397, DW_AT_type(*$C$DW$T$28)
    6925                      .dwattr $C$DW$397, DW_AT_name("OSTCBStkSize")
    6926                      .dwattr $C$DW$397, DW_AT_TI_symbol_name("_OSTCBStkSize")
    6927                      .dwattr $C$DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6928                      .dwattr $C$DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6929              
    6930              $C$DW$398       .dwtag  DW_TAG_member
    6931                      .dwattr $C$DW$398, DW_AT_type(*$C$DW$T$20)
    6932                      .dwattr $C$DW$398, DW_AT_name("OSTCBOpt")
    6933                      .dwattr $C$DW$398, DW_AT_TI_symbol_name("_OSTCBOpt")
    6934                      .dwattr $C$DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6935                      .dwattr $C$DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6936              
    6937              $C$DW$399       .dwtag  DW_TAG_member
    6938                      .dwattr $C$DW$399, DW_AT_type(*$C$DW$T$20)
    6939                      .dwattr $C$DW$399, DW_AT_name("OSTCBId")
    6940                      .dwattr $C$DW$399, DW_AT_TI_symbol_name("_OSTCBId")
    6941                      .dwattr $C$DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    6942                      .dwattr $C$DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6943              
    6944              $C$DW$400       .dwtag  DW_TAG_member
    6945                      .dwattr $C$DW$400, DW_AT_type(*$C$DW$T$36)
    6946                      .dwattr $C$DW$400, DW_AT_name("OSTCBNext")
    6947                      .dwattr $C$DW$400, DW_AT_TI_symbol_name("_OSTCBNext")
    6948                      .dwattr $C$DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6949                      .dwattr $C$DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6950              
    6951              $C$DW$401       .dwtag  DW_TAG_member
    6952                      .dwattr $C$DW$401, DW_AT_type(*$C$DW$T$36)
    6953                      .dwattr $C$DW$401, DW_AT_name("OSTCBPrev")
    6954                      .dwattr $C$DW$401, DW_AT_TI_symbol_name("_OSTCBPrev")
    6955                      .dwattr $C$DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6956                      .dwattr $C$DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6957              
    6958              $C$DW$402       .dwtag  DW_TAG_member
    6959                      .dwattr $C$DW$402, DW_AT_type(*$C$DW$T$38)
    6960                      .dwattr $C$DW$402, DW_AT_name("OSTCBEventPtr")
    6961                      .dwattr $C$DW$402, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    6962                      .dwattr $C$DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    6963                      .dwattr $C$DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6964              
    6965              $C$DW$403       .dwtag  DW_TAG_member
    6966                      .dwattr $C$DW$403, DW_AT_type(*$C$DW$T$39)
    6967                      .dwattr $C$DW$403, DW_AT_name("OSTCBEventMultiPtr")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  133

    6968                      .dwattr $C$DW$403, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    6969                      .dwattr $C$DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6970                      .dwattr $C$DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6971              
    6972              $C$DW$404       .dwtag  DW_TAG_member
    6973                      .dwattr $C$DW$404, DW_AT_type(*$C$DW$T$3)
    6974                      .dwattr $C$DW$404, DW_AT_name("OSTCBMsg")
    6975                      .dwattr $C$DW$404, DW_AT_TI_symbol_name("_OSTCBMsg")
    6976                      .dwattr $C$DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    6977                      .dwattr $C$DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6978              
    6979              $C$DW$405       .dwtag  DW_TAG_member
    6980                      .dwattr $C$DW$405, DW_AT_type(*$C$DW$T$41)
    6981                      .dwattr $C$DW$405, DW_AT_name("OSTCBFlagNode")
    6982                      .dwattr $C$DW$405, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    6983                      .dwattr $C$DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6984                      .dwattr $C$DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6985              
    6986              $C$DW$406       .dwtag  DW_TAG_member
    6987                      .dwattr $C$DW$406, DW_AT_type(*$C$DW$T$25)
    6988                      .dwattr $C$DW$406, DW_AT_name("OSTCBFlagsRdy")
    6989                      .dwattr $C$DW$406, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    6990                      .dwattr $C$DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    6991                      .dwattr $C$DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6992              
    6993              $C$DW$407       .dwtag  DW_TAG_member
    6994                      .dwattr $C$DW$407, DW_AT_type(*$C$DW$T$28)
    6995                      .dwattr $C$DW$407, DW_AT_name("OSTCBDly")
    6996                      .dwattr $C$DW$407, DW_AT_TI_symbol_name("_OSTCBDly")
    6997                      .dwattr $C$DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6998                      .dwattr $C$DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6999              
    7000              $C$DW$408       .dwtag  DW_TAG_member
    7001                      .dwattr $C$DW$408, DW_AT_type(*$C$DW$T$19)
    7002                      .dwattr $C$DW$408, DW_AT_name("OSTCBStat")
    7003                      .dwattr $C$DW$408, DW_AT_TI_symbol_name("_OSTCBStat")
    7004                      .dwattr $C$DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    7005                      .dwattr $C$DW$408, DW_AT_accessibility(DW_ACCESS_public)
    7006              
    7007              $C$DW$409       .dwtag  DW_TAG_member
    7008                      .dwattr $C$DW$409, DW_AT_type(*$C$DW$T$19)
    7009                      .dwattr $C$DW$409, DW_AT_name("OSTCBStatPend")
    7010                      .dwattr $C$DW$409, DW_AT_TI_symbol_name("_OSTCBStatPend")
    7011                      .dwattr $C$DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    7012                      .dwattr $C$DW$409, DW_AT_accessibility(DW_ACCESS_public)
    7013              
    7014              $C$DW$410       .dwtag  DW_TAG_member
    7015                      .dwattr $C$DW$410, DW_AT_type(*$C$DW$T$19)
    7016                      .dwattr $C$DW$410, DW_AT_name("OSTCBPrio")
    7017                      .dwattr $C$DW$410, DW_AT_TI_symbol_name("_OSTCBPrio")
    7018                      .dwattr $C$DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7019                      .dwattr $C$DW$410, DW_AT_accessibility(DW_ACCESS_public)
    7020              
    7021              $C$DW$411       .dwtag  DW_TAG_member
    7022                      .dwattr $C$DW$411, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  134

    7023                      .dwattr $C$DW$411, DW_AT_name("OSTCBX")
    7024                      .dwattr $C$DW$411, DW_AT_TI_symbol_name("_OSTCBX")
    7025                      .dwattr $C$DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    7026                      .dwattr $C$DW$411, DW_AT_accessibility(DW_ACCESS_public)
    7027              
    7028              $C$DW$412       .dwtag  DW_TAG_member
    7029                      .dwattr $C$DW$412, DW_AT_type(*$C$DW$T$19)
    7030                      .dwattr $C$DW$412, DW_AT_name("OSTCBY")
    7031                      .dwattr $C$DW$412, DW_AT_TI_symbol_name("_OSTCBY")
    7032                      .dwattr $C$DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    7033                      .dwattr $C$DW$412, DW_AT_accessibility(DW_ACCESS_public)
    7034              
    7035              $C$DW$413       .dwtag  DW_TAG_member
    7036                      .dwattr $C$DW$413, DW_AT_type(*$C$DW$T$21)
    7037                      .dwattr $C$DW$413, DW_AT_name("OSTCBBitX")
    7038                      .dwattr $C$DW$413, DW_AT_TI_symbol_name("_OSTCBBitX")
    7039                      .dwattr $C$DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    7040                      .dwattr $C$DW$413, DW_AT_accessibility(DW_ACCESS_public)
    7041              
    7042              $C$DW$414       .dwtag  DW_TAG_member
    7043                      .dwattr $C$DW$414, DW_AT_type(*$C$DW$T$21)
    7044                      .dwattr $C$DW$414, DW_AT_name("OSTCBBitY")
    7045                      .dwattr $C$DW$414, DW_AT_TI_symbol_name("_OSTCBBitY")
    7046                      .dwattr $C$DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    7047                      .dwattr $C$DW$414, DW_AT_accessibility(DW_ACCESS_public)
    7048              
    7049              $C$DW$415       .dwtag  DW_TAG_member
    7050                      .dwattr $C$DW$415, DW_AT_type(*$C$DW$T$19)
    7051                      .dwattr $C$DW$415, DW_AT_name("OSTCBDelReq")
    7052                      .dwattr $C$DW$415, DW_AT_TI_symbol_name("_OSTCBDelReq")
    7053                      .dwattr $C$DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    7054                      .dwattr $C$DW$415, DW_AT_accessibility(DW_ACCESS_public)
    7055              
    7056              $C$DW$416       .dwtag  DW_TAG_member
    7057                      .dwattr $C$DW$416, DW_AT_type(*$C$DW$T$28)
    7058                      .dwattr $C$DW$416, DW_AT_name("OSTCBCtxSwCtr")
    7059                      .dwattr $C$DW$416, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    7060                      .dwattr $C$DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    7061                      .dwattr $C$DW$416, DW_AT_accessibility(DW_ACCESS_public)
    7062              
    7063              $C$DW$417       .dwtag  DW_TAG_member
    7064                      .dwattr $C$DW$417, DW_AT_type(*$C$DW$T$28)
    7065                      .dwattr $C$DW$417, DW_AT_name("OSTCBCyclesTot")
    7066                      .dwattr $C$DW$417, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    7067                      .dwattr $C$DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    7068                      .dwattr $C$DW$417, DW_AT_accessibility(DW_ACCESS_public)
    7069              
    7070              $C$DW$418       .dwtag  DW_TAG_member
    7071                      .dwattr $C$DW$418, DW_AT_type(*$C$DW$T$28)
    7072                      .dwattr $C$DW$418, DW_AT_name("OSTCBCyclesStart")
    7073                      .dwattr $C$DW$418, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    7074                      .dwattr $C$DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    7075                      .dwattr $C$DW$418, DW_AT_accessibility(DW_ACCESS_public)
    7076              
    7077              $C$DW$419       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  135

    7078                      .dwattr $C$DW$419, DW_AT_type(*$C$DW$T$35)
    7079                      .dwattr $C$DW$419, DW_AT_name("OSTCBStkBase")
    7080                      .dwattr $C$DW$419, DW_AT_TI_symbol_name("_OSTCBStkBase")
    7081                      .dwattr $C$DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    7082                      .dwattr $C$DW$419, DW_AT_accessibility(DW_ACCESS_public)
    7083              
    7084              $C$DW$420       .dwtag  DW_TAG_member
    7085                      .dwattr $C$DW$420, DW_AT_type(*$C$DW$T$28)
    7086                      .dwattr $C$DW$420, DW_AT_name("OSTCBStkUsed")
    7087                      .dwattr $C$DW$420, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    7088                      .dwattr $C$DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    7089                      .dwattr $C$DW$420, DW_AT_accessibility(DW_ACCESS_public)
    7090              
    7091              $C$DW$421       .dwtag  DW_TAG_member
    7092                      .dwattr $C$DW$421, DW_AT_type(*$C$DW$T$23)
    7093                      .dwattr $C$DW$421, DW_AT_name("OSTCBTaskName")
    7094                      .dwattr $C$DW$421, DW_AT_TI_symbol_name("_OSTCBTaskName")
    7095                      .dwattr $C$DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    7096                      .dwattr $C$DW$421, DW_AT_accessibility(DW_ACCESS_public)
    7097              
    7098              $C$DW$422       .dwtag  DW_TAG_member
    7099                      .dwattr $C$DW$422, DW_AT_type(*$C$DW$T$42)
    7100                      .dwattr $C$DW$422, DW_AT_name("OSTCBRegTbl")
    7101                      .dwattr $C$DW$422, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    7102                      .dwattr $C$DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    7103                      .dwattr $C$DW$422, DW_AT_accessibility(DW_ACCESS_public)
    7104              
    7105                      .dwendtag $C$DW$T$43
    7106              
    7107              $C$DW$T$55      .dwtag  DW_TAG_typedef
    7108                      .dwattr $C$DW$T$55, DW_AT_name("OS_TCB")
    7109                      .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$43)
    7110                      .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    7111              
    7112              $C$DW$T$56      .dwtag  DW_TAG_pointer_type
    7113                      .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    7114                      .dwattr $C$DW$T$56, DW_AT_address_class(0x20)
    7115              
    7116              
    7117              $C$DW$T$110     .dwtag  DW_TAG_array_type
    7118                      .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$56)
    7119                      .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    7120                      .dwattr $C$DW$T$110, DW_AT_byte_size(0x80)
    7121              $C$DW$423       .dwtag  DW_TAG_subrange_type
    7122                      .dwattr $C$DW$423, DW_AT_upper_bound(0x3f)
    7123              
    7124                      .dwendtag $C$DW$T$110
    7125              
    7126              
    7127              $C$DW$T$112     .dwtag  DW_TAG_array_type
    7128                      .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$55)
    7129                      .dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
    7130                      .dwattr $C$DW$T$112, DW_AT_byte_size(0x420)
    7131              $C$DW$424       .dwtag  DW_TAG_subrange_type
    7132                      .dwattr $C$DW$424, DW_AT_upper_bound(0x15)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:57 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_core.asm                                                          PAGE  136

    7133              
    7134                      .dwendtag $C$DW$T$112
    7135              
    7136              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    7137                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$43)
    7138                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    7139              
    7140                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    7141              
    7142              ;***************************************************************
    7143              ;* DWARF CIE ENTRIES                                           *
    7144              ;***************************************************************
    7145              
    7146              $C$DW$CIE       .dwcie 26
    7147                      .dwcfi  cfa_register, 20
    7148                      .dwcfi  cfa_offset, 0
    7149                      .dwcfi  same_value, 28
    7150                      .dwcfi  same_value, 6
    7151                      .dwcfi  same_value, 7
    7152                      .dwcfi  same_value, 8
    7153                      .dwcfi  same_value, 9
    7154                      .dwcfi  same_value, 10
    7155                      .dwcfi  same_value, 11
    7156                      .dwendentry
    7157              
    7158              ;***************************************************************
    7159              ;* DWARF REGISTER MAP                                          *
    7160              ;***************************************************************
    7161              
    7162              $C$DW$425       .dwtag  DW_TAG_TI_assign_register
    7163                      .dwattr $C$DW$425, DW_AT_name("AL")
    7164                      .dwattr $C$DW$425, DW_AT_location[DW_OP_reg0]
    7165              
    7166              $C$DW$426       .dwtag  DW_TAG_TI_assign_register
    7167                      .dwattr $C$DW$426, DW_AT_name("AH")
