TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue Feb 16 00:15:58 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_flag.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    3547                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    3548                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    3549                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3550              
    3551              $C$DW$T$25      .dwtag  DW_TAG_typedef
    3552                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    3553                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    3554                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3555              
    3556              $C$DW$T$39      .dwtag  DW_TAG_typedef
    3557                      .dwattr $C$DW$T$39, DW_AT_name("OS_CPU_SR")
    3558                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$9)
    3559                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3560              
    3561              $C$DW$T$28      .dwtag  DW_TAG_typedef
    3562                      .dwattr $C$DW$T$28, DW_AT_name("OS_STK")
    3563                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$9)
    3564                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3565              
    3566              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3567                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    3568                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3569              
    3570              $C$DW$T$10      .dwtag  DW_TAG_base_type
    3571                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3572                      .dwattr $C$DW$T$10, DW_AT_name("int")
    3573                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    3574              
    3575              $C$DW$T$11      .dwtag  DW_TAG_base_type
    3576                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   69

    3577                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3578                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    3579              
    3580              $C$DW$T$12      .dwtag  DW_TAG_base_type
    3581                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    3582                      .dwattr $C$DW$T$12, DW_AT_name("long")
    3583                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    3584              
    3585              $C$DW$T$13      .dwtag  DW_TAG_base_type
    3586                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    3587                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    3588                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    3589              
    3590              $C$DW$T$30      .dwtag  DW_TAG_typedef
    3591                      .dwattr $C$DW$T$30, DW_AT_name("INT32U")
    3592                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$13)
    3593                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3594              
    3595              
    3596              $C$DW$T$37      .dwtag  DW_TAG_array_type
    3597                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$30)
    3598                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3599                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    3600              $C$DW$209       .dwtag  DW_TAG_subrange_type
    3601                      .dwattr $C$DW$209, DW_AT_upper_bound(0x00)
    3602              
    3603                      .dwendtag $C$DW$T$37
    3604              
    3605              $C$DW$T$14      .dwtag  DW_TAG_base_type
    3606                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3607                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    3608                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    3609              
    3610              $C$DW$T$15      .dwtag  DW_TAG_base_type
    3611                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3612                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3613                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    3614              
    3615              $C$DW$T$16      .dwtag  DW_TAG_base_type
    3616                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3617                      .dwattr $C$DW$T$16, DW_AT_name("float")
    3618                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    3619              
    3620              $C$DW$T$17      .dwtag  DW_TAG_base_type
    3621                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3622                      .dwattr $C$DW$T$17, DW_AT_name("double")
    3623                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    3624              
    3625              $C$DW$T$18      .dwtag  DW_TAG_base_type
    3626                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3627                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    3628                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    3629              
    3630              
    3631              $C$DW$T$24      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   70

    3632                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    3633                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    3634              $C$DW$210       .dwtag  DW_TAG_member
    3635                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3636                      .dwattr $C$DW$210, DW_AT_name("OSEventType")
    3637                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_OSEventType")
    3638                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3639                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3640              
    3641              $C$DW$211       .dwtag  DW_TAG_member
    3642                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$3)
    3643                      .dwattr $C$DW$211, DW_AT_name("OSEventPtr")
    3644                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_OSEventPtr")
    3645                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3646                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3647              
    3648              $C$DW$212       .dwtag  DW_TAG_member
    3649                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$20)
    3650                      .dwattr $C$DW$212, DW_AT_name("OSEventCnt")
    3651                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_OSEventCnt")
    3652                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3653                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3654              
    3655              $C$DW$213       .dwtag  DW_TAG_member
    3656                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$21)
    3657                      .dwattr $C$DW$213, DW_AT_name("OSEventGrp")
    3658                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_OSEventGrp")
    3659                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3660                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3661              
    3662              $C$DW$214       .dwtag  DW_TAG_member
    3663                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$22)
    3664                      .dwattr $C$DW$214, DW_AT_name("OSEventTbl")
    3665                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_OSEventTbl")
    3666                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3667                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3668              
    3669              $C$DW$215       .dwtag  DW_TAG_member
    3670                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$23)
    3671                      .dwattr $C$DW$215, DW_AT_name("OSEventName")
    3672                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_OSEventName")
    3673                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3674                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3675              
    3676                      .dwendtag $C$DW$T$24
    3677              
    3678              $C$DW$T$32      .dwtag  DW_TAG_typedef
    3679                      .dwattr $C$DW$T$32, DW_AT_name("OS_EVENT")
    3680                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    3681                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3682              
    3683              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    3684                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    3685                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    3686              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   71

    3687              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3688                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3689                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3690              
    3691              
    3692              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3693                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_grp")
    3694                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x08)
    3695              $C$DW$216       .dwtag  DW_TAG_member
    3696                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    3697                      .dwattr $C$DW$216, DW_AT_name("OSFlagType")
    3698                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_OSFlagType")
    3699                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3700                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3701              
    3702              $C$DW$217       .dwtag  DW_TAG_member
    3703                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$3)
    3704                      .dwattr $C$DW$217, DW_AT_name("OSFlagWaitList")
    3705                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_OSFlagWaitList")
    3706                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3707                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3708              
    3709              $C$DW$218       .dwtag  DW_TAG_member
    3710                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    3711                      .dwattr $C$DW$218, DW_AT_name("OSFlagFlags")
    3712                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_OSFlagFlags")
    3713                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3714                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3715              
    3716              $C$DW$219       .dwtag  DW_TAG_member
    3717                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$23)
    3718                      .dwattr $C$DW$219, DW_AT_name("OSFlagName")
    3719                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_OSFlagName")
    3720                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3721                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3722              
    3723                      .dwendtag $C$DW$T$26
    3724              
    3725              $C$DW$T$46      .dwtag  DW_TAG_typedef
    3726                      .dwattr $C$DW$T$46, DW_AT_name("OS_FLAG_GRP")
    3727                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$26)
    3728                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3729              
    3730              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    3731                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3732                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    3733              
    3734              
    3735              $C$DW$T$71      .dwtag  DW_TAG_array_type
    3736                      .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$46)
    3737                      .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3738                      .dwattr $C$DW$T$71, DW_AT_byte_size(0x28)
    3739              $C$DW$220       .dwtag  DW_TAG_subrange_type
    3740                      .dwattr $C$DW$220, DW_AT_upper_bound(0x04)
    3741              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   72

    3742                      .dwendtag $C$DW$T$71
    3743              
    3744              
    3745              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3746                      .dwattr $C$DW$T$27, DW_AT_name("os_flag_node")
    3747                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    3748              $C$DW$221       .dwtag  DW_TAG_member
    3749                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$3)
    3750                      .dwattr $C$DW$221, DW_AT_name("OSFlagNodeNext")
    3751                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    3752                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3753                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3754              
    3755              $C$DW$222       .dwtag  DW_TAG_member
    3756                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$3)
    3757                      .dwattr $C$DW$222, DW_AT_name("OSFlagNodePrev")
    3758                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    3759                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3760                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3761              
    3762              $C$DW$223       .dwtag  DW_TAG_member
    3763                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$3)
    3764                      .dwattr $C$DW$223, DW_AT_name("OSFlagNodeTCB")
    3765                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    3766                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3767                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3768              
    3769              $C$DW$224       .dwtag  DW_TAG_member
    3770                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$3)
    3771                      .dwattr $C$DW$224, DW_AT_name("OSFlagNodeFlagGrp")
    3772                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    3773                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3774                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3775              
    3776              $C$DW$225       .dwtag  DW_TAG_member
    3777                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$25)
    3778                      .dwattr $C$DW$225, DW_AT_name("OSFlagNodeFlags")
    3779                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    3780                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3781                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3782              
    3783              $C$DW$226       .dwtag  DW_TAG_member
    3784                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3785                      .dwattr $C$DW$226, DW_AT_name("OSFlagNodeWaitType")
    3786                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    3787                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3788                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3789              
    3790                      .dwendtag $C$DW$T$27
    3791              
    3792              $C$DW$T$35      .dwtag  DW_TAG_typedef
    3793                      .dwattr $C$DW$T$35, DW_AT_name("OS_FLAG_NODE")
    3794                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$27)
    3795                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3796              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   73

    3797              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    3798                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3799                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    3800              
    3801              
    3802              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3803                      .dwattr $C$DW$T$38, DW_AT_name("os_tcb")
    3804                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x30)
    3805              $C$DW$227       .dwtag  DW_TAG_member
    3806                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$29)
    3807                      .dwattr $C$DW$227, DW_AT_name("OSTCBStkPtr")
    3808                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    3809                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3810                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3811              
    3812              $C$DW$228       .dwtag  DW_TAG_member
    3813                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$3)
    3814                      .dwattr $C$DW$228, DW_AT_name("OSTCBExtPtr")
    3815                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    3816                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3817                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3818              
    3819              $C$DW$229       .dwtag  DW_TAG_member
    3820                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$29)
    3821                      .dwattr $C$DW$229, DW_AT_name("OSTCBStkBottom")
    3822                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    3823                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3824                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3825              
    3826              $C$DW$230       .dwtag  DW_TAG_member
    3827                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$30)
    3828                      .dwattr $C$DW$230, DW_AT_name("OSTCBStkSize")
    3829                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_OSTCBStkSize")
    3830                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3831                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3832              
    3833              $C$DW$231       .dwtag  DW_TAG_member
    3834                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$20)
    3835                      .dwattr $C$DW$231, DW_AT_name("OSTCBOpt")
    3836                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_OSTCBOpt")
    3837                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3838                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3839              
    3840              $C$DW$232       .dwtag  DW_TAG_member
    3841                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$20)
    3842                      .dwattr $C$DW$232, DW_AT_name("OSTCBId")
    3843                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_OSTCBId")
    3844                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3845                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3846              
    3847              $C$DW$233       .dwtag  DW_TAG_member
    3848                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$31)
    3849                      .dwattr $C$DW$233, DW_AT_name("OSTCBNext")
    3850                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_OSTCBNext")
    3851                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   74

    3852                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3853              
    3854              $C$DW$234       .dwtag  DW_TAG_member
    3855                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$31)
    3856                      .dwattr $C$DW$234, DW_AT_name("OSTCBPrev")
    3857                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_OSTCBPrev")
    3858                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3859                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3860              
    3861              $C$DW$235       .dwtag  DW_TAG_member
    3862                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$33)
    3863                      .dwattr $C$DW$235, DW_AT_name("OSTCBEventPtr")
    3864                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    3865                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3866                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3867              
    3868              $C$DW$236       .dwtag  DW_TAG_member
    3869                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$34)
    3870                      .dwattr $C$DW$236, DW_AT_name("OSTCBEventMultiPtr")
    3871                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    3872                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3873                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3874              
    3875              $C$DW$237       .dwtag  DW_TAG_member
    3876                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$3)
    3877                      .dwattr $C$DW$237, DW_AT_name("OSTCBMsg")
    3878                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_OSTCBMsg")
    3879                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3880                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3881              
    3882              $C$DW$238       .dwtag  DW_TAG_member
    3883                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$36)
    3884                      .dwattr $C$DW$238, DW_AT_name("OSTCBFlagNode")
    3885                      .dwattr $C$DW$238, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    3886                      .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3887                      .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3888              
    3889              $C$DW$239       .dwtag  DW_TAG_member
    3890                      .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$25)
    3891                      .dwattr $C$DW$239, DW_AT_name("OSTCBFlagsRdy")
    3892                      .dwattr $C$DW$239, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    3893                      .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3894                      .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3895              
    3896              $C$DW$240       .dwtag  DW_TAG_member
    3897                      .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$30)
    3898                      .dwattr $C$DW$240, DW_AT_name("OSTCBDly")
    3899                      .dwattr $C$DW$240, DW_AT_TI_symbol_name("_OSTCBDly")
    3900                      .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3901                      .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3902              
    3903              $C$DW$241       .dwtag  DW_TAG_member
    3904                      .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    3905                      .dwattr $C$DW$241, DW_AT_name("OSTCBStat")
    3906                      .dwattr $C$DW$241, DW_AT_TI_symbol_name("_OSTCBStat")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   75

    3907                      .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3908                      .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3909              
    3910              $C$DW$242       .dwtag  DW_TAG_member
    3911                      .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    3912                      .dwattr $C$DW$242, DW_AT_name("OSTCBStatPend")
    3913                      .dwattr $C$DW$242, DW_AT_TI_symbol_name("_OSTCBStatPend")
    3914                      .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3915                      .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3916              
    3917              $C$DW$243       .dwtag  DW_TAG_member
    3918                      .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    3919                      .dwattr $C$DW$243, DW_AT_name("OSTCBPrio")
    3920                      .dwattr $C$DW$243, DW_AT_TI_symbol_name("_OSTCBPrio")
    3921                      .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3922                      .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3923              
    3924              $C$DW$244       .dwtag  DW_TAG_member
    3925                      .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    3926                      .dwattr $C$DW$244, DW_AT_name("OSTCBX")
    3927                      .dwattr $C$DW$244, DW_AT_TI_symbol_name("_OSTCBX")
    3928                      .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3929                      .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3930              
    3931              $C$DW$245       .dwtag  DW_TAG_member
    3932                      .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    3933                      .dwattr $C$DW$245, DW_AT_name("OSTCBY")
    3934                      .dwattr $C$DW$245, DW_AT_TI_symbol_name("_OSTCBY")
    3935                      .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3936                      .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3937              
    3938              $C$DW$246       .dwtag  DW_TAG_member
    3939                      .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$21)
    3940                      .dwattr $C$DW$246, DW_AT_name("OSTCBBitX")
    3941                      .dwattr $C$DW$246, DW_AT_TI_symbol_name("_OSTCBBitX")
    3942                      .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3943                      .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3944              
    3945              $C$DW$247       .dwtag  DW_TAG_member
    3946                      .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$21)
    3947                      .dwattr $C$DW$247, DW_AT_name("OSTCBBitY")
    3948                      .dwattr $C$DW$247, DW_AT_TI_symbol_name("_OSTCBBitY")
    3949                      .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3950                      .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3951              
    3952              $C$DW$248       .dwtag  DW_TAG_member
    3953                      .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3954                      .dwattr $C$DW$248, DW_AT_name("OSTCBDelReq")
    3955                      .dwattr $C$DW$248, DW_AT_TI_symbol_name("_OSTCBDelReq")
    3956                      .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3957                      .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3958              
    3959              $C$DW$249       .dwtag  DW_TAG_member
    3960                      .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$30)
    3961                      .dwattr $C$DW$249, DW_AT_name("OSTCBCtxSwCtr")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   76

    3962                      .dwattr $C$DW$249, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    3963                      .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3964                      .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3965              
    3966              $C$DW$250       .dwtag  DW_TAG_member
    3967                      .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$30)
    3968                      .dwattr $C$DW$250, DW_AT_name("OSTCBCyclesTot")
    3969                      .dwattr $C$DW$250, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    3970                      .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3971                      .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3972              
    3973              $C$DW$251       .dwtag  DW_TAG_member
    3974                      .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$30)
    3975                      .dwattr $C$DW$251, DW_AT_name("OSTCBCyclesStart")
    3976                      .dwattr $C$DW$251, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    3977                      .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3978                      .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3979              
    3980              $C$DW$252       .dwtag  DW_TAG_member
    3981                      .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$29)
    3982                      .dwattr $C$DW$252, DW_AT_name("OSTCBStkBase")
    3983                      .dwattr $C$DW$252, DW_AT_TI_symbol_name("_OSTCBStkBase")
    3984                      .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3985                      .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3986              
    3987              $C$DW$253       .dwtag  DW_TAG_member
    3988                      .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$30)
    3989                      .dwattr $C$DW$253, DW_AT_name("OSTCBStkUsed")
    3990                      .dwattr $C$DW$253, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    3991                      .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3992                      .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3993              
    3994              $C$DW$254       .dwtag  DW_TAG_member
    3995                      .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$23)
    3996                      .dwattr $C$DW$254, DW_AT_name("OSTCBTaskName")
    3997                      .dwattr $C$DW$254, DW_AT_TI_symbol_name("_OSTCBTaskName")
    3998                      .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3999                      .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    4000              
    4001              $C$DW$255       .dwtag  DW_TAG_member
    4002                      .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$37)
    4003                      .dwattr $C$DW$255, DW_AT_name("OSTCBRegTbl")
    4004                      .dwattr $C$DW$255, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    4005                      .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4006                      .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    4007              
    4008                      .dwendtag $C$DW$T$38
    4009              
    4010              $C$DW$T$72      .dwtag  DW_TAG_typedef
    4011                      .dwattr $C$DW$T$72, DW_AT_name("OS_TCB")
    4012                      .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$38)
    4013                      .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    4014              
    4015              $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    4016                      .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_flag.asm                                                          PAGE   77

    4017                      .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    4018              
    4019              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4020                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$38)
    4021                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4022              
    4023                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4024              
    4025              ;***************************************************************
    4026              ;* DWARF CIE ENTRIES                                           *
    4027              ;***************************************************************
    4028              
    4029              $C$DW$CIE       .dwcie 26
    4030                      .dwcfi  cfa_register, 20
    4031                      .dwcfi  cfa_offset, 0
    4032                      .dwcfi  same_value, 28
    4033                      .dwcfi  same_value, 6
    4034                      .dwcfi  same_value, 7
    4035                      .dwcfi  same_value, 8
    4036                      .dwcfi  same_value, 9
    4037                      .dwcfi  same_value, 10
    4038                      .dwcfi  same_value, 11
    4039                      .dwendentry
    4040              
    4041              ;***************************************************************
    4042              ;* DWARF REGISTER MAP                                          *
    4043              ;***************************************************************
    4044              
    4045              $C$DW$256       .dwtag  DW_TAG_TI_assign_register
    4046                      .dwattr $C$DW$256, DW_AT_name("AL")
    4047                      .dwattr $C$DW$256, DW_AT_location[DW_OP_reg0]
    4048              
    4049              $C$DW$257       .dwtag  DW_TAG_TI_assign_register
    4050                      .dwattr $C$DW$257, DW_AT_name("AH")
    4051                      .dwattr $C$DW$257, DW_AT_location[DW_OP_reg1]
    4052              
    4053              $C$DW$258       .dwtag  DW_TAG_TI_assign_register
    4054                      .dwattr $C$DW$258, DW_AT_name("PL")
    4055                      .dwattr $C$DW$258, DW_AT_location[DW_OP_reg2]
    4056              
    4057              $C$DW$259       .dwtag  DW_TAG_TI_assign_register
    4058                      .dwattr $C$DW$259, DW_AT_name("PH")
    4059                      .dwattr $C$DW$259, DW_AT_location[DW_OP_reg3]
    4060              
    4061              $C$DW$260       .dwtag  DW_TAG_TI_assign_register
    4062                      .dwattr $C$DW$260, DW_AT_name("SP")
    4063                      .dwattr $C$DW$260, DW_AT_location[DW_OP_reg20]
    4064              
    4065              $C$DW$261       .dwtag  DW_TAG_TI_assign_register
    4066                      .dwattr $C$DW$261, DW_AT_name("XT")
    4067                      .dwattr $C$DW$261, DW_AT_location[DW_OP_reg21]
    4068              
    4069              $C$DW$262       .dwtag  DW_TAG_TI_assign_register
