TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan  4 16:08:39 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/ImitatePLC/Software/uCOS-II/Source/os_m
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\ImitatePLC\Examples\TI\TMDSDOCK2833
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    2484                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    2485                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2486                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2487              
    2488              $C$DW$T$25      .dwtag  DW_TAG_typedef
    2489                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    2490                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    2491                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2492              
    2493              $C$DW$T$40      .dwtag  DW_TAG_typedef
    2494                      .dwattr $C$DW$T$40, DW_AT_name("OS_CPU_SR")
    2495                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$9)
    2496                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2497              
    2498              $C$DW$T$29      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   49

    2499                      .dwattr $C$DW$T$29, DW_AT_name("OS_STK")
    2500                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    2501                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2502              
    2503              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    2504                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2505                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    2506              
    2507              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2508                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2509                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2510                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2511              
    2512              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2513                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2514                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2515                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2516              
    2517              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2518                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2519                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2520                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2521              
    2522              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2523                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2524                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2525                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2526              
    2527              $C$DW$T$31      .dwtag  DW_TAG_typedef
    2528                      .dwattr $C$DW$T$31, DW_AT_name("INT32U")
    2529                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    2530                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2531              
    2532              
    2533              $C$DW$T$38      .dwtag  DW_TAG_array_type
    2534                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    2535                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2536                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2537              $C$DW$132       .dwtag  DW_TAG_subrange_type
    2538                      .dwattr $C$DW$132, DW_AT_upper_bound(0x00)
    2539              
    2540                      .dwendtag $C$DW$T$38
    2541              
    2542              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2543                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2544                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2545                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2546              
    2547              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2548                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2549                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2550                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2551              
    2552              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2553                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   50

    2554                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2555                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2556              
    2557              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2558                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2559                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2560                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2561              
    2562              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2563                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2564                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2565                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    2566              
    2567              
    2568              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2569                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    2570                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    2571              $C$DW$133       .dwtag  DW_TAG_member
    2572                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2573                      .dwattr $C$DW$133, DW_AT_name("OSEventType")
    2574                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_OSEventType")
    2575                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2576                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2577              
    2578              $C$DW$134       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$3)
    2580                      .dwattr $C$DW$134, DW_AT_name("OSEventPtr")
    2581                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSEventPtr")
    2582                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2583                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2584              
    2585              $C$DW$135       .dwtag  DW_TAG_member
    2586                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2587                      .dwattr $C$DW$135, DW_AT_name("OSEventCnt")
    2588                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_OSEventCnt")
    2589                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2590                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2591              
    2592              $C$DW$136       .dwtag  DW_TAG_member
    2593                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2594                      .dwattr $C$DW$136, DW_AT_name("OSEventGrp")
    2595                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_OSEventGrp")
    2596                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2597                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2598              
    2599              $C$DW$137       .dwtag  DW_TAG_member
    2600                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    2601                      .dwattr $C$DW$137, DW_AT_name("OSEventTbl")
    2602                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OSEventTbl")
    2603                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2604                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2605              
    2606              $C$DW$138       .dwtag  DW_TAG_member
    2607                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2608                      .dwattr $C$DW$138, DW_AT_name("OSEventName")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   51

    2609                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OSEventName")
    2610                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2611                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2612              
    2613                      .dwendtag $C$DW$T$24
    2614              
    2615              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2616                      .dwattr $C$DW$T$33, DW_AT_name("OS_EVENT")
    2617                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
    2618                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2619              
    2620              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2621                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2622                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2623              
    2624              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2625                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2626                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    2627              
    2628              
    2629              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2630                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    2631                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    2632              $C$DW$139       .dwtag  DW_TAG_member
    2633                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$3)
    2634                      .dwattr $C$DW$139, DW_AT_name("OSFlagNodeNext")
    2635                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    2636                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2637                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2638              
    2639              $C$DW$140       .dwtag  DW_TAG_member
    2640                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$3)
    2641                      .dwattr $C$DW$140, DW_AT_name("OSFlagNodePrev")
    2642                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    2643                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2644                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2645              
    2646              $C$DW$141       .dwtag  DW_TAG_member
    2647                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    2648                      .dwattr $C$DW$141, DW_AT_name("OSFlagNodeTCB")
    2649                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    2650                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2651                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2652              
    2653              $C$DW$142       .dwtag  DW_TAG_member
    2654                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$3)
    2655                      .dwattr $C$DW$142, DW_AT_name("OSFlagNodeFlagGrp")
    2656                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    2657                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2658                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2659              
    2660              $C$DW$143       .dwtag  DW_TAG_member
    2661                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    2662                      .dwattr $C$DW$143, DW_AT_name("OSFlagNodeFlags")
    2663                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   52

    2664                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2665                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2666              
    2667              $C$DW$144       .dwtag  DW_TAG_member
    2668                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2669                      .dwattr $C$DW$144, DW_AT_name("OSFlagNodeWaitType")
    2670                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    2671                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2672                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2673              
    2674                      .dwendtag $C$DW$T$26
    2675              
    2676              $C$DW$T$36      .dwtag  DW_TAG_typedef
    2677                      .dwattr $C$DW$T$36, DW_AT_name("OS_FLAG_NODE")
    2678                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$26)
    2679                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2680              
    2681              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2682                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2683                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    2684              
    2685              
    2686              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2687                      .dwattr $C$DW$T$28, DW_AT_name("os_mutex_data")
    2688                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2689              $C$DW$145       .dwtag  DW_TAG_member
    2690                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2691                      .dwattr $C$DW$145, DW_AT_name("OSEventTbl")
    2692                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_OSEventTbl")
    2693                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2694                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2695              
    2696              $C$DW$146       .dwtag  DW_TAG_member
    2697                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    2698                      .dwattr $C$DW$146, DW_AT_name("OSEventGrp")
    2699                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_OSEventGrp")
    2700                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2701                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2702              
    2703              $C$DW$147       .dwtag  DW_TAG_member
    2704                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2705                      .dwattr $C$DW$147, DW_AT_name("OSValue")
    2706                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_OSValue")
    2707                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2708                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2709              
    2710              $C$DW$148       .dwtag  DW_TAG_member
    2711                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2712                      .dwattr $C$DW$148, DW_AT_name("OSOwnerPrio")
    2713                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_OSOwnerPrio")
    2714                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2715                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2716              
    2717              $C$DW$149       .dwtag  DW_TAG_member
    2718                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   53

    2719                      .dwattr $C$DW$149, DW_AT_name("OSMutexPCP")
    2720                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_OSMutexPCP")
    2721                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2722                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2723              
    2724                      .dwendtag $C$DW$T$28
    2725              
    2726              $C$DW$T$59      .dwtag  DW_TAG_typedef
    2727                      .dwattr $C$DW$T$59, DW_AT_name("OS_MUTEX_DATA")
    2728                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$28)
    2729                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2730              
    2731              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2732                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2733                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2734              
    2735              
    2736              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2737                      .dwattr $C$DW$T$39, DW_AT_name("os_tcb")
    2738                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x30)
    2739              $C$DW$150       .dwtag  DW_TAG_member
    2740                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    2741                      .dwattr $C$DW$150, DW_AT_name("OSTCBStkPtr")
    2742                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    2743                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2744                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2745              
    2746              $C$DW$151       .dwtag  DW_TAG_member
    2747                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$3)
    2748                      .dwattr $C$DW$151, DW_AT_name("OSTCBExtPtr")
    2749                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    2750                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2751                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2752              
    2753              $C$DW$152       .dwtag  DW_TAG_member
    2754                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$30)
    2755                      .dwattr $C$DW$152, DW_AT_name("OSTCBStkBottom")
    2756                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    2757                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2758                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2759              
    2760              $C$DW$153       .dwtag  DW_TAG_member
    2761                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    2762                      .dwattr $C$DW$153, DW_AT_name("OSTCBStkSize")
    2763                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_OSTCBStkSize")
    2764                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2765                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2766              
    2767              $C$DW$154       .dwtag  DW_TAG_member
    2768                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2769                      .dwattr $C$DW$154, DW_AT_name("OSTCBOpt")
    2770                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_OSTCBOpt")
    2771                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2772                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2773              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   54

    2774              $C$DW$155       .dwtag  DW_TAG_member
    2775                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2776                      .dwattr $C$DW$155, DW_AT_name("OSTCBId")
    2777                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_OSTCBId")
    2778                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2779                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2780              
    2781              $C$DW$156       .dwtag  DW_TAG_member
    2782                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
    2783                      .dwattr $C$DW$156, DW_AT_name("OSTCBNext")
    2784                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_OSTCBNext")
    2785                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2786                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2787              
    2788              $C$DW$157       .dwtag  DW_TAG_member
    2789                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
    2790                      .dwattr $C$DW$157, DW_AT_name("OSTCBPrev")
    2791                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_OSTCBPrev")
    2792                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2793                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2794              
    2795              $C$DW$158       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$34)
    2797                      .dwattr $C$DW$158, DW_AT_name("OSTCBEventPtr")
    2798                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    2799                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2800                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2801              
    2802              $C$DW$159       .dwtag  DW_TAG_member
    2803                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$35)
    2804                      .dwattr $C$DW$159, DW_AT_name("OSTCBEventMultiPtr")
    2805                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    2806                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2807                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2808              
    2809              $C$DW$160       .dwtag  DW_TAG_member
    2810                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$3)
    2811                      .dwattr $C$DW$160, DW_AT_name("OSTCBMsg")
    2812                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_OSTCBMsg")
    2813                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2814                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2815              
    2816              $C$DW$161       .dwtag  DW_TAG_member
    2817                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$37)
    2818                      .dwattr $C$DW$161, DW_AT_name("OSTCBFlagNode")
    2819                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    2820                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2821                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2822              
    2823              $C$DW$162       .dwtag  DW_TAG_member
    2824                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$25)
    2825                      .dwattr $C$DW$162, DW_AT_name("OSTCBFlagsRdy")
    2826                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    2827                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2828                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   55

    2829              
    2830              $C$DW$163       .dwtag  DW_TAG_member
    2831                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    2832                      .dwattr $C$DW$163, DW_AT_name("OSTCBDly")
    2833                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_OSTCBDly")
    2834                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2835                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2836              
    2837              $C$DW$164       .dwtag  DW_TAG_member
    2838                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2839                      .dwattr $C$DW$164, DW_AT_name("OSTCBStat")
    2840                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_OSTCBStat")
    2841                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2842                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2843              
    2844              $C$DW$165       .dwtag  DW_TAG_member
    2845                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2846                      .dwattr $C$DW$165, DW_AT_name("OSTCBStatPend")
    2847                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_OSTCBStatPend")
    2848                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2849                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2850              
    2851              $C$DW$166       .dwtag  DW_TAG_member
    2852                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2853                      .dwattr $C$DW$166, DW_AT_name("OSTCBPrio")
    2854                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_OSTCBPrio")
    2855                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2856                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2857              
    2858              $C$DW$167       .dwtag  DW_TAG_member
    2859                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2860                      .dwattr $C$DW$167, DW_AT_name("OSTCBX")
    2861                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_OSTCBX")
    2862                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2863                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2864              
    2865              $C$DW$168       .dwtag  DW_TAG_member
    2866                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2867                      .dwattr $C$DW$168, DW_AT_name("OSTCBY")
    2868                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_OSTCBY")
    2869                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2870                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2871              
    2872              $C$DW$169       .dwtag  DW_TAG_member
    2873                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2874                      .dwattr $C$DW$169, DW_AT_name("OSTCBBitX")
    2875                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_OSTCBBitX")
    2876                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2877                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2878              
    2879              $C$DW$170       .dwtag  DW_TAG_member
    2880                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2881                      .dwattr $C$DW$170, DW_AT_name("OSTCBBitY")
    2882                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_OSTCBBitY")
    2883                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   56

    2884                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2885              
    2886              $C$DW$171       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2888                      .dwattr $C$DW$171, DW_AT_name("OSTCBDelReq")
    2889                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_OSTCBDelReq")
    2890                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2891                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2892              
    2893              $C$DW$172       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    2895                      .dwattr $C$DW$172, DW_AT_name("OSTCBCtxSwCtr")
    2896                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    2897                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2898                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2899              
    2900              $C$DW$173       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    2902                      .dwattr $C$DW$173, DW_AT_name("OSTCBCyclesTot")
    2903                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    2904                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2905                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2906              
    2907              $C$DW$174       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    2909                      .dwattr $C$DW$174, DW_AT_name("OSTCBCyclesStart")
    2910                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    2911                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2912                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2913              
    2914              $C$DW$175       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$30)
    2916                      .dwattr $C$DW$175, DW_AT_name("OSTCBStkBase")
    2917                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_OSTCBStkBase")
    2918                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2919                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2920              
    2921              $C$DW$176       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    2923                      .dwattr $C$DW$176, DW_AT_name("OSTCBStkUsed")
    2924                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    2925                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2926                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2927              
    2928              $C$DW$177       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2930                      .dwattr $C$DW$177, DW_AT_name("OSTCBTaskName")
    2931                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_OSTCBTaskName")
    2932                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2933                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2934              
    2935              $C$DW$178       .dwtag  DW_TAG_member
    2936                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$38)
    2937                      .dwattr $C$DW$178, DW_AT_name("OSTCBRegTbl")
    2938                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_OSTCBRegTbl")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   57

    2939                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2940                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2941              
    2942                      .dwendtag $C$DW$T$39
    2943              
    2944              $C$DW$T$45      .dwtag  DW_TAG_typedef
    2945                      .dwattr $C$DW$T$45, DW_AT_name("OS_TCB")
    2946                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$39)
    2947                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2948              
    2949              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    2950                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2951                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    2952              
    2953              
    2954              $C$DW$T$68      .dwtag  DW_TAG_array_type
    2955                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$46)
    2956                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2957                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x80)
    2958              $C$DW$179       .dwtag  DW_TAG_subrange_type
    2959                      .dwattr $C$DW$179, DW_AT_upper_bound(0x3f)
    2960              
    2961                      .dwendtag $C$DW$T$68
    2962              
    2963              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2964                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$39)
    2965                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    2966              
    2967                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2968              
    2969              ;***************************************************************
    2970              ;* DWARF CIE ENTRIES                                           *
    2971              ;***************************************************************
    2972              
    2973              $C$DW$CIE       .dwcie 26
    2974                      .dwcfi  cfa_register, 20
    2975                      .dwcfi  cfa_offset, 0
    2976                      .dwcfi  same_value, 28
    2977                      .dwcfi  same_value, 6
    2978                      .dwcfi  same_value, 7
    2979                      .dwcfi  same_value, 8
    2980                      .dwcfi  same_value, 9
    2981                      .dwcfi  same_value, 10
    2982                      .dwcfi  same_value, 11
    2983                      .dwcfi  same_value, 59
    2984                      .dwcfi  same_value, 63
    2985                      .dwcfi  same_value, 67
    2986                      .dwcfi  same_value, 71
    2987                      .dwendentry
    2988              
    2989              ;***************************************************************
    2990              ;* DWARF REGISTER MAP                                          *
    2991              ;***************************************************************
    2992              
    2993              $C$DW$180       .dwtag  DW_TAG_TI_assign_register
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   58

    2994                      .dwattr $C$DW$180, DW_AT_name("AL")
    2995                      .dwattr $C$DW$180, DW_AT_location[DW_OP_reg0]
    2996              
    2997              $C$DW$181       .dwtag  DW_TAG_TI_assign_register
    2998                      .dwattr $C$DW$181, DW_AT_name("AH")
    2999                      .dwattr $C$DW$181, DW_AT_location[DW_OP_reg1]
    3000              
    3001              $C$DW$182       .dwtag  DW_TAG_TI_assign_register
    3002                      .dwattr $C$DW$182, DW_AT_name("PL")
    3003                      .dwattr $C$DW$182, DW_AT_location[DW_OP_reg2]
    3004              
