TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:25 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mem.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Jan  6 17:53:25 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate_backup/Software/uCOS-II/Source/os_mem.c
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate_backup\Examples\TI\TMDSDOCK28335\OS
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    1357                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    1358                      .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    1359              
    1360              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    1361                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$21)
    1362                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    1363              
    1364              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1365                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1366                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1367                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1368              
    1369              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1370                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1371                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1372                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1373              
    1374              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1375                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1376                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1377                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1378              
    1379              $C$DW$T$31      .dwtag  DW_TAG_typedef
    1380                      .dwattr $C$DW$T$31, DW_AT_name("INT16U")
    1381                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$9)
    1382                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:25 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mem.asm                                                           PAGE   27

    1383              
    1384              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1385                      .dwattr $C$DW$T$28, DW_AT_name("OS_CPU_SR")
    1386                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$9)
    1387                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1388              
    1389              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1390                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1391                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1392                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1393              
    1394              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1395                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1396                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1397                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1398              
    1399              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1400                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1401                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1402                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1403              
    1404              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1405                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1406                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1407                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1408              
    1409              $C$DW$T$19      .dwtag  DW_TAG_typedef
    1410                      .dwattr $C$DW$T$19, DW_AT_name("INT32U")
    1411                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$13)
    1412                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1413              
    1414              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1415                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1416                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1417                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1418              
    1419              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1420                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1421                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1422                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1423              
    1424              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1425                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1426                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1427                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1428              
    1429              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1430                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1431                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1432                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1433              
    1434              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1435                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1436                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1437                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:25 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mem.asm                                                           PAGE   28

    1438              
    1439              
    1440              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    1441                      .dwattr $C$DW$T$22, DW_AT_name("os_mem")
    1442                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x0c)
    1443              $C$DW$86        .dwtag  DW_TAG_member
    1444                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$3)
    1445                      .dwattr $C$DW$86, DW_AT_name("OSMemAddr")
    1446                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_OSMemAddr")
    1447                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1449              
    1450              $C$DW$87        .dwtag  DW_TAG_member
    1451                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$3)
    1452                      .dwattr $C$DW$87, DW_AT_name("OSMemFreeList")
    1453                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_OSMemFreeList")
    1454                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1455                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1456              
    1457              $C$DW$88        .dwtag  DW_TAG_member
    1458                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1459                      .dwattr $C$DW$88, DW_AT_name("OSMemBlkSize")
    1460                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_OSMemBlkSize")
    1461                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1462                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1463              
    1464              $C$DW$89        .dwtag  DW_TAG_member
    1465                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1466                      .dwattr $C$DW$89, DW_AT_name("OSMemNBlks")
    1467                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_OSMemNBlks")
    1468                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1469                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1470              
    1471              $C$DW$90        .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1473                      .dwattr $C$DW$90, DW_AT_name("OSMemNFree")
    1474                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_OSMemNFree")
    1475                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1476                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1477              
    1478              $C$DW$91        .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
    1480                      .dwattr $C$DW$91, DW_AT_name("OSMemName")
    1481                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_OSMemName")
    1482                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1483                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1484              
    1485                      .dwendtag $C$DW$T$22
    1486              
    1487              $C$DW$T$24      .dwtag  DW_TAG_typedef
    1488                      .dwattr $C$DW$T$24, DW_AT_name("OS_MEM")
    1489                      .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$22)
    1490                      .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    1491              
    1492              $C$DW$T$25      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:25 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mem.asm                                                           PAGE   29

    1493                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1494                      .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    1495              
    1496              
    1497              $C$DW$T$49      .dwtag  DW_TAG_array_type
    1498                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$24)
    1499                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    1500                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x3c)
    1501              $C$DW$92        .dwtag  DW_TAG_subrange_type
    1502                      .dwattr $C$DW$92, DW_AT_upper_bound(0x04)
    1503              
    1504                      .dwendtag $C$DW$T$49
    1505              
    1506              
    1507              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1508                      .dwattr $C$DW$T$23, DW_AT_name("os_mem_data")
    1509                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x0c)
    1510              $C$DW$93        .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$3)
    1512                      .dwattr $C$DW$93, DW_AT_name("OSAddr")
    1513                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OSAddr")
    1514                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1515                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1516              
    1517              $C$DW$94        .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$3)
    1519                      .dwattr $C$DW$94, DW_AT_name("OSFreeList")
    1520                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_OSFreeList")
    1521                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1522                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1523              
    1524              $C$DW$95        .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$95, DW_AT_name("OSBlkSize")
    1527                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_OSBlkSize")
    1528                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1529                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1530              
    1531              $C$DW$96        .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$96, DW_AT_name("OSNBlks")
    1534                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_OSNBlks")
    1535                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1536                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1537              
    1538              $C$DW$97        .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$97, DW_AT_name("OSNFree")
    1541                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_OSNFree")
    1542                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1543                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1544              
    1545              $C$DW$98        .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$98, DW_AT_name("OSNUsed")
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:25 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mem.asm                                                           PAGE   30

    1548                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_OSNUsed")
    1549                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1550                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1551              
    1552                      .dwendtag $C$DW$T$23
    1553              
    1554              $C$DW$T$41      .dwtag  DW_TAG_typedef
    1555                      .dwattr $C$DW$T$41, DW_AT_name("OS_MEM_DATA")
    1556                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$23)
    1557                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    1558              
    1559              $C$DW$T$42      .dwtag  DW_TAG_pointer_type
    1560                      .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$41)
    1561                      .dwattr $C$DW$T$42, DW_AT_address_class(0x20)
    1562              
    1563                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1564              
    1565              ;***************************************************************
    1566              ;* DWARF CIE ENTRIES                                           *
    1567              ;***************************************************************
    1568              
    1569              $C$DW$CIE       .dwcie 26
    1570                      .dwcfi  cfa_register, 20
    1571                      .dwcfi  cfa_offset, 0
    1572                      .dwcfi  same_value, 28
    1573                      .dwcfi  same_value, 6
    1574                      .dwcfi  same_value, 7
    1575                      .dwcfi  same_value, 8
    1576                      .dwcfi  same_value, 9
    1577                      .dwcfi  same_value, 10
    1578                      .dwcfi  same_value, 11
    1579                      .dwcfi  same_value, 59
    1580                      .dwcfi  same_value, 63
    1581                      .dwcfi  same_value, 67
    1582                      .dwcfi  same_value, 71
    1583                      .dwendentry
    1584              
    1585              ;***************************************************************
    1586              ;* DWARF REGISTER MAP                                          *
    1587              ;***************************************************************
    1588              
    1589              $C$DW$99        .dwtag  DW_TAG_TI_assign_register
    1590                      .dwattr $C$DW$99, DW_AT_name("AL")
    1591                      .dwattr $C$DW$99, DW_AT_location[DW_OP_reg0]
    1592              
    1593              $C$DW$100       .dwtag  DW_TAG_TI_assign_register
    1594                      .dwattr $C$DW$100, DW_AT_name("AH")
    1595                      .dwattr $C$DW$100, DW_AT_location[DW_OP_reg1]
    1596              
    1597              $C$DW$101       .dwtag  DW_TAG_TI_assign_register
    1598                      .dwattr $C$DW$101, DW_AT_name("PL")
    1599                      .dwattr $C$DW$101, DW_AT_location[DW_OP_reg2]
    1600              
    1601              $C$DW$102       .dwtag  DW_TAG_TI_assign_register
    1602                      .dwattr $C$DW$102, DW_AT_name("PH")
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:25 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mem.asm                                                           PAGE   31

    1603                      .dwattr $C$DW$102, DW_AT_location[DW_OP_reg3]
    1604              
    1605              $C$DW$103       .dwtag  DW_TAG_TI_assign_register
    1606                      .dwattr $C$DW$103, DW_AT_name("SP")
    1607                      .dwattr $C$DW$103, DW_AT_location[DW_OP_reg20]
    1608              
    1609              $C$DW$104       .dwtag  DW_TAG_TI_assign_register
    1610                      .dwattr $C$DW$104, DW_AT_name("XT")
    1611                      .dwattr $C$DW$104, DW_AT_location[DW_OP_reg21]
    1612              
    1613              $C$DW$105       .dwtag  DW_TAG_TI_assign_register
    1614                      .dwattr $C$DW$105, DW_AT_name("T")
