TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue Feb 16 00:15:58 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_mbox.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    2023                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    2024                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    2025              
    2026              $C$DW$T$20      .dwtag  DW_TAG_typedef
    2027                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    2028                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2029                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2030              
    2031              $C$DW$T$25      .dwtag  DW_TAG_typedef
    2032                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    2033                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    2034                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2035              
    2036              $C$DW$T$41      .dwtag  DW_TAG_typedef
    2037                      .dwattr $C$DW$T$41, DW_AT_name("OS_CPU_SR")
    2038                      .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$9)
    2039                      .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    2040              
    2041              $C$DW$T$28      .dwtag  DW_TAG_typedef
    2042                      .dwattr $C$DW$T$28, DW_AT_name("OS_STK")
    2043                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$9)
    2044                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    2045              
    2046              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    2047                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    2048                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    2049              
    2050              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2051                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2052                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2053                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2054              
    2055              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2056                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2057                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2058                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2059              
    2060              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2061                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2062                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2063                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2064              
    2065              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2066                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2067                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2068                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2069              
    2070              $C$DW$T$30      .dwtag  DW_TAG_typedef
    2071                      .dwattr $C$DW$T$30, DW_AT_name("INT32U")
    2072                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$13)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   40

    2073                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    2074              
    2075              
    2076              $C$DW$T$37      .dwtag  DW_TAG_array_type
    2077                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$30)
    2078                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    2079                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2080              $C$DW$132       .dwtag  DW_TAG_subrange_type
    2081                      .dwattr $C$DW$132, DW_AT_upper_bound(0x00)
    2082              
    2083                      .dwendtag $C$DW$T$37
    2084              
    2085              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2086                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2087                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2088                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2089              
    2090              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2091                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2092                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2093                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2094              
    2095              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2096                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2097                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2098                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2099              
    2100              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2101                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2102                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2103                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2104              
    2105              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2106                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2107                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2108                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    2109              
    2110              
    2111              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2112                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    2113                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    2114              $C$DW$133       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$133, DW_AT_name("OSEventType")
    2117                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_OSEventType")
    2118                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2119                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2120              
    2121              $C$DW$134       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$3)
    2123                      .dwattr $C$DW$134, DW_AT_name("OSEventPtr")
    2124                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSEventPtr")
    2125                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2126                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2127              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   41

    2128              $C$DW$135       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2130                      .dwattr $C$DW$135, DW_AT_name("OSEventCnt")
    2131                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_OSEventCnt")
    2132                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2133                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2134              
    2135              $C$DW$136       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2137                      .dwattr $C$DW$136, DW_AT_name("OSEventGrp")
    2138                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_OSEventGrp")
    2139                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2140                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2141              
    2142              $C$DW$137       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    2144                      .dwattr $C$DW$137, DW_AT_name("OSEventTbl")
    2145                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OSEventTbl")
    2146                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2147                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2148              
    2149              $C$DW$138       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2151                      .dwattr $C$DW$138, DW_AT_name("OSEventName")
    2152                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OSEventName")
    2153                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2154                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2155              
    2156                      .dwendtag $C$DW$T$24
    2157              
    2158              $C$DW$T$32      .dwtag  DW_TAG_typedef
    2159                      .dwattr $C$DW$T$32, DW_AT_name("OS_EVENT")
    2160                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    2161                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2162              
    2163              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2164                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2165                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    2166              
    2167              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2168                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2169                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2170              
    2171              
    2172              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2173                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    2174                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    2175              $C$DW$139       .dwtag  DW_TAG_member
    2176                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$3)
    2177                      .dwattr $C$DW$139, DW_AT_name("OSFlagNodeNext")
    2178                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    2179                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2180                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2181              
    2182              $C$DW$140       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   42

    2183                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$3)
    2184                      .dwattr $C$DW$140, DW_AT_name("OSFlagNodePrev")
    2185                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    2186                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2187                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2188              
    2189              $C$DW$141       .dwtag  DW_TAG_member
    2190                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    2191                      .dwattr $C$DW$141, DW_AT_name("OSFlagNodeTCB")
    2192                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    2193                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2194                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2195              
    2196              $C$DW$142       .dwtag  DW_TAG_member
    2197                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$3)
    2198                      .dwattr $C$DW$142, DW_AT_name("OSFlagNodeFlagGrp")
    2199                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    2200                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2201                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2202              
    2203              $C$DW$143       .dwtag  DW_TAG_member
    2204                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    2205                      .dwattr $C$DW$143, DW_AT_name("OSFlagNodeFlags")
    2206                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    2207                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2208                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2209              
    2210              $C$DW$144       .dwtag  DW_TAG_member
    2211                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2212                      .dwattr $C$DW$144, DW_AT_name("OSFlagNodeWaitType")
    2213                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    2214                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2215                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2216              
    2217                      .dwendtag $C$DW$T$26
    2218              
    2219              $C$DW$T$35      .dwtag  DW_TAG_typedef
    2220                      .dwattr $C$DW$T$35, DW_AT_name("OS_FLAG_NODE")
    2221                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$26)
    2222                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2223              
    2224              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    2225                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    2226                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    2227              
    2228              
    2229              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2230                      .dwattr $C$DW$T$27, DW_AT_name("os_mbox_data")
    2231                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0c)
    2232              $C$DW$145       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$3)
    2234                      .dwattr $C$DW$145, DW_AT_name("OSMsg")
    2235                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_OSMsg")
    2236                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2237                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   43

    2238              
    2239              $C$DW$146       .dwtag  DW_TAG_member
    2240                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$22)
    2241                      .dwattr $C$DW$146, DW_AT_name("OSEventTbl")
    2242                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_OSEventTbl")
    2243                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2244                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2245              
    2246              $C$DW$147       .dwtag  DW_TAG_member
    2247                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    2248                      .dwattr $C$DW$147, DW_AT_name("OSEventGrp")
    2249                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_OSEventGrp")
    2250                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2251                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253                      .dwendtag $C$DW$T$27
    2254              
    2255              $C$DW$T$59      .dwtag  DW_TAG_typedef
    2256                      .dwattr $C$DW$T$59, DW_AT_name("OS_MBOX_DATA")
    2257                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$27)
    2258                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2259              
    2260              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2261                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2262                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2263              
    2264              
    2265              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2266                      .dwattr $C$DW$T$38, DW_AT_name("os_tcb")
    2267                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x30)
    2268              $C$DW$148       .dwtag  DW_TAG_member
    2269                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    2270                      .dwattr $C$DW$148, DW_AT_name("OSTCBStkPtr")
    2271                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    2272                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2273                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2274              
    2275              $C$DW$149       .dwtag  DW_TAG_member
    2276                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$3)
    2277                      .dwattr $C$DW$149, DW_AT_name("OSTCBExtPtr")
    2278                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    2279                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2280                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2281              
    2282              $C$DW$150       .dwtag  DW_TAG_member
    2283                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$29)
    2284                      .dwattr $C$DW$150, DW_AT_name("OSTCBStkBottom")
    2285                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    2286                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2287                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2288              
    2289              $C$DW$151       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$30)
    2291                      .dwattr $C$DW$151, DW_AT_name("OSTCBStkSize")
    2292                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_OSTCBStkSize")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   44

    2293                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2294                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2295              
    2296              $C$DW$152       .dwtag  DW_TAG_member
    2297                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$20)
    2298                      .dwattr $C$DW$152, DW_AT_name("OSTCBOpt")
    2299                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_OSTCBOpt")
    2300                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2301                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2302              
    2303              $C$DW$153       .dwtag  DW_TAG_member
    2304                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    2305                      .dwattr $C$DW$153, DW_AT_name("OSTCBId")
    2306                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_OSTCBId")
    2307                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2308                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2309              
    2310              $C$DW$154       .dwtag  DW_TAG_member
    2311                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$31)
    2312                      .dwattr $C$DW$154, DW_AT_name("OSTCBNext")
    2313                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_OSTCBNext")
    2314                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2315                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2316              
    2317              $C$DW$155       .dwtag  DW_TAG_member
    2318                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$31)
    2319                      .dwattr $C$DW$155, DW_AT_name("OSTCBPrev")
    2320                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_OSTCBPrev")
    2321                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2322                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2323              
    2324              $C$DW$156       .dwtag  DW_TAG_member
    2325                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$33)
    2326                      .dwattr $C$DW$156, DW_AT_name("OSTCBEventPtr")
    2327                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    2328                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2329                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2330              
    2331              $C$DW$157       .dwtag  DW_TAG_member
    2332                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$34)
    2333                      .dwattr $C$DW$157, DW_AT_name("OSTCBEventMultiPtr")
    2334                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    2335                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2336                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2337              
    2338              $C$DW$158       .dwtag  DW_TAG_member
    2339                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$3)
    2340                      .dwattr $C$DW$158, DW_AT_name("OSTCBMsg")
    2341                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_OSTCBMsg")
    2342                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2343                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2344              
    2345              $C$DW$159       .dwtag  DW_TAG_member
    2346                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$36)
    2347                      .dwattr $C$DW$159, DW_AT_name("OSTCBFlagNode")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   45

    2348                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    2349                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2350                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2351              
    2352              $C$DW$160       .dwtag  DW_TAG_member
    2353                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$25)
    2354                      .dwattr $C$DW$160, DW_AT_name("OSTCBFlagsRdy")
    2355                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    2356                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2357                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2358              
    2359              $C$DW$161       .dwtag  DW_TAG_member
    2360                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$30)
    2361                      .dwattr $C$DW$161, DW_AT_name("OSTCBDly")
    2362                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_OSTCBDly")
    2363                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2364                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2365              
    2366              $C$DW$162       .dwtag  DW_TAG_member
    2367                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2368                      .dwattr $C$DW$162, DW_AT_name("OSTCBStat")
    2369                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_OSTCBStat")
    2370                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2371                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2372              
    2373              $C$DW$163       .dwtag  DW_TAG_member
    2374                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2375                      .dwattr $C$DW$163, DW_AT_name("OSTCBStatPend")
    2376                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_OSTCBStatPend")
    2377                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2378                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2379              
    2380              $C$DW$164       .dwtag  DW_TAG_member
    2381                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2382                      .dwattr $C$DW$164, DW_AT_name("OSTCBPrio")
    2383                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_OSTCBPrio")
    2384                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2385                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2386              
    2387              $C$DW$165       .dwtag  DW_TAG_member
    2388                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2389                      .dwattr $C$DW$165, DW_AT_name("OSTCBX")
    2390                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_OSTCBX")
    2391                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2392                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2393              
    2394              $C$DW$166       .dwtag  DW_TAG_member
    2395                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2396                      .dwattr $C$DW$166, DW_AT_name("OSTCBY")
    2397                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_OSTCBY")
    2398                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2399                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2400              
    2401              $C$DW$167       .dwtag  DW_TAG_member
    2402                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   46

    2403                      .dwattr $C$DW$167, DW_AT_name("OSTCBBitX")
    2404                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_OSTCBBitX")
    2405                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2406                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2407              
    2408              $C$DW$168       .dwtag  DW_TAG_member
    2409                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    2410                      .dwattr $C$DW$168, DW_AT_name("OSTCBBitY")
    2411                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_OSTCBBitY")
    2412                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2413                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2414              
    2415              $C$DW$169       .dwtag  DW_TAG_member
    2416                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2417                      .dwattr $C$DW$169, DW_AT_name("OSTCBDelReq")
    2418                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_OSTCBDelReq")
    2419                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2420                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2421              
    2422              $C$DW$170       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$30)
    2424                      .dwattr $C$DW$170, DW_AT_name("OSTCBCtxSwCtr")
    2425                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    2426                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2427                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2428              
    2429              $C$DW$171       .dwtag  DW_TAG_member
    2430                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$30)
    2431                      .dwattr $C$DW$171, DW_AT_name("OSTCBCyclesTot")
    2432                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    2433                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2434                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2435              
    2436              $C$DW$172       .dwtag  DW_TAG_member
    2437                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$30)
    2438                      .dwattr $C$DW$172, DW_AT_name("OSTCBCyclesStart")
    2439                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    2440                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2441                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2442              
    2443              $C$DW$173       .dwtag  DW_TAG_member
    2444                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$29)
    2445                      .dwattr $C$DW$173, DW_AT_name("OSTCBStkBase")
    2446                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_OSTCBStkBase")
    2447                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2448                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2449              
    2450              $C$DW$174       .dwtag  DW_TAG_member
    2451                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$30)
    2452                      .dwattr $C$DW$174, DW_AT_name("OSTCBStkUsed")
    2453                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    2454                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2455                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2456              
    2457              $C$DW$175       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   47

    2458                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$23)
    2459                      .dwattr $C$DW$175, DW_AT_name("OSTCBTaskName")
    2460                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_OSTCBTaskName")
    2461                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2462                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2463              
    2464              $C$DW$176       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$37)
    2466                      .dwattr $C$DW$176, DW_AT_name("OSTCBRegTbl")
    2467                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    2468                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2469                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2470              
    2471                      .dwendtag $C$DW$T$38
    2472              
    2473              $C$DW$T$46      .dwtag  DW_TAG_typedef
    2474                      .dwattr $C$DW$T$46, DW_AT_name("OS_TCB")
    2475                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$38)
    2476                      .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2477              
    2478              $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    2479                      .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    2480                      .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    2481              
    2482              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2483                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$38)
    2484                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    2485              
    2486                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2487              
    2488              ;***************************************************************
    2489              ;* DWARF CIE ENTRIES                                           *
    2490              ;***************************************************************
    2491              
    2492              $C$DW$CIE       .dwcie 26
    2493                      .dwcfi  cfa_register, 20
    2494                      .dwcfi  cfa_offset, 0
    2495                      .dwcfi  same_value, 28
    2496                      .dwcfi  same_value, 6
    2497                      .dwcfi  same_value, 7
    2498                      .dwcfi  same_value, 8
    2499                      .dwcfi  same_value, 9
    2500                      .dwcfi  same_value, 10
    2501                      .dwcfi  same_value, 11
    2502                      .dwendentry
    2503              
    2504              ;***************************************************************
    2505              ;* DWARF REGISTER MAP                                          *
    2506              ;***************************************************************
    2507              
    2508              $C$DW$177       .dwtag  DW_TAG_TI_assign_register
    2509                      .dwattr $C$DW$177, DW_AT_name("AL")
    2510                      .dwattr $C$DW$177, DW_AT_location[DW_OP_reg0]
    2511              
    2512              $C$DW$178       .dwtag  DW_TAG_TI_assign_register
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:58 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mbox.asm                                                          PAGE   48

    2513                      .dwattr $C$DW$178, DW_AT_name("AH")
    2514                      .dwattr $C$DW$178, DW_AT_location[DW_OP_reg1]
    2515              
    2516              $C$DW$179       .dwtag  DW_TAG_TI_assign_register
    2517                      .dwattr $C$DW$179, DW_AT_name("PL")
    2518                      .dwattr $C$DW$179, DW_AT_location[DW_OP_reg2]
    2519              
    2520              $C$DW$180       .dwtag  DW_TAG_TI_assign_register
    2521                      .dwattr $C$DW$180, DW_AT_name("PH")
    2522                      .dwattr $C$DW$180, DW_AT_location[DW_OP_reg3]
    2523              
    2524              $C$DW$181       .dwtag  DW_TAG_TI_assign_register
    2525                      .dwattr $C$DW$181, DW_AT_name("SP")
    2526                      .dwattr $C$DW$181, DW_AT_location[DW_OP_reg20]
    2527              
    2528              $C$DW$182       .dwtag  DW_TAG_TI_assign_register
    2529                      .dwattr $C$DW$182, DW_AT_name("XT")
    2530                      .dwattr $C$DW$182, DW_AT_location[DW_OP_reg21]
    2531              
    2532              $C$DW$183       .dwtag  DW_TAG_TI_assign_register
