TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue Feb 16 00:15:59 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_mutex.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    2485                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    2486                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2487                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2488              
    2489              $C$DW$T$25      .dwtag  DW_TAG_typedef
    2490                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    2491                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    2492                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2493              
    2494              $C$DW$T$40      .dwtag  DW_TAG_typedef
    2495                      .dwattr $C$DW$T$40, DW_AT_name("OS_CPU_SR")
    2496                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$9)
    2497                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   49

    2498              
    2499              $C$DW$T$29      .dwtag  DW_TAG_typedef
    2500                      .dwattr $C$DW$T$29, DW_AT_name("OS_STK")
    2501                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    2502                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    2503              
    2504              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    2505                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    2506                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    2507              
    2508              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2509                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2510                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2511                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2512              
    2513              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2514                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2515                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2516                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2517              
    2518              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2519                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2520                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2521                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2522              
    2523              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2524                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2525                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2526                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2527              
    2528              $C$DW$T$31      .dwtag  DW_TAG_typedef
    2529                      .dwattr $C$DW$T$31, DW_AT_name("INT32U")
    2530                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$13)
    2531                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2532              
    2533              
    2534              $C$DW$T$38      .dwtag  DW_TAG_array_type
    2535                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    2536                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    2537                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    2538              $C$DW$132       .dwtag  DW_TAG_subrange_type
    2539                      .dwattr $C$DW$132, DW_AT_upper_bound(0x00)
    2540              
    2541                      .dwendtag $C$DW$T$38
    2542              
    2543              $C$DW$T$14      .dwtag  DW_TAG_base_type
    2544                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    2545                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    2546                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    2547              
    2548              $C$DW$T$15      .dwtag  DW_TAG_base_type
    2549                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    2550                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    2551                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    2552              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   50

    2553              $C$DW$T$16      .dwtag  DW_TAG_base_type
    2554                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    2555                      .dwattr $C$DW$T$16, DW_AT_name("float")
    2556                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    2557              
    2558              $C$DW$T$17      .dwtag  DW_TAG_base_type
    2559                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    2560                      .dwattr $C$DW$T$17, DW_AT_name("double")
    2561                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    2562              
    2563              $C$DW$T$18      .dwtag  DW_TAG_base_type
    2564                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    2565                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    2566                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    2567              
    2568              
    2569              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2570                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    2571                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    2572              $C$DW$133       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2574                      .dwattr $C$DW$133, DW_AT_name("OSEventType")
    2575                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_OSEventType")
    2576                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2578              
    2579              $C$DW$134       .dwtag  DW_TAG_member
    2580                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$3)
    2581                      .dwattr $C$DW$134, DW_AT_name("OSEventPtr")
    2582                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSEventPtr")
    2583                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2584                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2585              
    2586              $C$DW$135       .dwtag  DW_TAG_member
    2587                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    2588                      .dwattr $C$DW$135, DW_AT_name("OSEventCnt")
    2589                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_OSEventCnt")
    2590                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2591                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2592              
    2593              $C$DW$136       .dwtag  DW_TAG_member
    2594                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
    2595                      .dwattr $C$DW$136, DW_AT_name("OSEventGrp")
    2596                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_OSEventGrp")
    2597                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2598                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2599              
    2600              $C$DW$137       .dwtag  DW_TAG_member
    2601                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$22)
    2602                      .dwattr $C$DW$137, DW_AT_name("OSEventTbl")
    2603                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OSEventTbl")
    2604                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2605                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2606              
    2607              $C$DW$138       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   51

    2608                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2609                      .dwattr $C$DW$138, DW_AT_name("OSEventName")
    2610                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OSEventName")
    2611                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2612                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2613              
    2614                      .dwendtag $C$DW$T$24
    2615              
    2616              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2617                      .dwattr $C$DW$T$33, DW_AT_name("OS_EVENT")
    2618                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$24)
    2619                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2620              
    2621              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2622                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2623                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2624              
    2625              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    2626                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    2627                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    2628              
    2629              
    2630              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2631                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    2632                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    2633              $C$DW$139       .dwtag  DW_TAG_member
    2634                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$3)
    2635                      .dwattr $C$DW$139, DW_AT_name("OSFlagNodeNext")
    2636                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    2637                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2638                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2639              
    2640              $C$DW$140       .dwtag  DW_TAG_member
    2641                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$3)
    2642                      .dwattr $C$DW$140, DW_AT_name("OSFlagNodePrev")
    2643                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    2644                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2645                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2646              
    2647              $C$DW$141       .dwtag  DW_TAG_member
    2648                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    2649                      .dwattr $C$DW$141, DW_AT_name("OSFlagNodeTCB")
    2650                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    2651                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2652                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2653              
    2654              $C$DW$142       .dwtag  DW_TAG_member
    2655                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$3)
    2656                      .dwattr $C$DW$142, DW_AT_name("OSFlagNodeFlagGrp")
    2657                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    2658                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2659                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2660              
    2661              $C$DW$143       .dwtag  DW_TAG_member
    2662                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   52

    2663                      .dwattr $C$DW$143, DW_AT_name("OSFlagNodeFlags")
    2664                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    2665                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2666                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2667              
    2668              $C$DW$144       .dwtag  DW_TAG_member
    2669                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    2670                      .dwattr $C$DW$144, DW_AT_name("OSFlagNodeWaitType")
    2671                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    2672                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2673                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2674              
    2675                      .dwendtag $C$DW$T$26
    2676              
    2677              $C$DW$T$36      .dwtag  DW_TAG_typedef
    2678                      .dwattr $C$DW$T$36, DW_AT_name("OS_FLAG_NODE")
    2679                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$26)
    2680                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    2681              
    2682              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    2683                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    2684                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    2685              
    2686              
    2687              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2688                      .dwattr $C$DW$T$28, DW_AT_name("os_mutex_data")
    2689                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x0c)
    2690              $C$DW$145       .dwtag  DW_TAG_member
    2691                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$22)
    2692                      .dwattr $C$DW$145, DW_AT_name("OSEventTbl")
    2693                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_OSEventTbl")
    2694                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2695                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2696              
    2697              $C$DW$146       .dwtag  DW_TAG_member
    2698                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    2699                      .dwattr $C$DW$146, DW_AT_name("OSEventGrp")
    2700                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_OSEventGrp")
    2701                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2702                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2703              
    2704              $C$DW$147       .dwtag  DW_TAG_member
    2705                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    2706                      .dwattr $C$DW$147, DW_AT_name("OSValue")
    2707                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_OSValue")
    2708                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2709                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2710              
    2711              $C$DW$148       .dwtag  DW_TAG_member
    2712                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    2713                      .dwattr $C$DW$148, DW_AT_name("OSOwnerPrio")
    2714                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_OSOwnerPrio")
    2715                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2716                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2717              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   53

    2718              $C$DW$149       .dwtag  DW_TAG_member
    2719                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2720                      .dwattr $C$DW$149, DW_AT_name("OSMutexPCP")
    2721                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_OSMutexPCP")
    2722                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2723                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2724              
    2725                      .dwendtag $C$DW$T$28
    2726              
    2727              $C$DW$T$59      .dwtag  DW_TAG_typedef
    2728                      .dwattr $C$DW$T$59, DW_AT_name("OS_MUTEX_DATA")
    2729                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$28)
    2730                      .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    2731              
    2732              $C$DW$T$60      .dwtag  DW_TAG_pointer_type
    2733                      .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    2734                      .dwattr $C$DW$T$60, DW_AT_address_class(0x20)
    2735              
    2736              
    2737              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    2738                      .dwattr $C$DW$T$39, DW_AT_name("os_tcb")
    2739                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x30)
    2740              $C$DW$150       .dwtag  DW_TAG_member
    2741                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$30)
    2742                      .dwattr $C$DW$150, DW_AT_name("OSTCBStkPtr")
    2743                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    2744                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2745                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2746              
    2747              $C$DW$151       .dwtag  DW_TAG_member
    2748                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$3)
    2749                      .dwattr $C$DW$151, DW_AT_name("OSTCBExtPtr")
    2750                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    2751                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2752                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2753              
    2754              $C$DW$152       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$30)
    2756                      .dwattr $C$DW$152, DW_AT_name("OSTCBStkBottom")
    2757                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    2758                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2759                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2760              
    2761              $C$DW$153       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$31)
    2763                      .dwattr $C$DW$153, DW_AT_name("OSTCBStkSize")
    2764                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_OSTCBStkSize")
    2765                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2766                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2767              
    2768              $C$DW$154       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    2770                      .dwattr $C$DW$154, DW_AT_name("OSTCBOpt")
    2771                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_OSTCBOpt")
    2772                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   54

    2773                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2774              
    2775              $C$DW$155       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    2777                      .dwattr $C$DW$155, DW_AT_name("OSTCBId")
    2778                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_OSTCBId")
    2779                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2780                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2781              
    2782              $C$DW$156       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
    2784                      .dwattr $C$DW$156, DW_AT_name("OSTCBNext")
    2785                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_OSTCBNext")
    2786                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2787                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2788              
    2789              $C$DW$157       .dwtag  DW_TAG_member
    2790                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
    2791                      .dwattr $C$DW$157, DW_AT_name("OSTCBPrev")
    2792                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_OSTCBPrev")
    2793                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2794                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2795              
    2796              $C$DW$158       .dwtag  DW_TAG_member
    2797                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$34)
    2798                      .dwattr $C$DW$158, DW_AT_name("OSTCBEventPtr")
    2799                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    2800                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2801                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2802              
    2803              $C$DW$159       .dwtag  DW_TAG_member
    2804                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$35)
    2805                      .dwattr $C$DW$159, DW_AT_name("OSTCBEventMultiPtr")
    2806                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    2807                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2808                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2809              
    2810              $C$DW$160       .dwtag  DW_TAG_member
    2811                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$3)
    2812                      .dwattr $C$DW$160, DW_AT_name("OSTCBMsg")
    2813                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_OSTCBMsg")
    2814                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2815                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2816              
    2817              $C$DW$161       .dwtag  DW_TAG_member
    2818                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$37)
    2819                      .dwattr $C$DW$161, DW_AT_name("OSTCBFlagNode")
    2820                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    2821                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2822                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2823              
    2824              $C$DW$162       .dwtag  DW_TAG_member
    2825                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$25)
    2826                      .dwattr $C$DW$162, DW_AT_name("OSTCBFlagsRdy")
    2827                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   55

    2828                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2829                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2830              
    2831              $C$DW$163       .dwtag  DW_TAG_member
    2832                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$31)
    2833                      .dwattr $C$DW$163, DW_AT_name("OSTCBDly")
    2834                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_OSTCBDly")
    2835                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2836                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2837              
    2838              $C$DW$164       .dwtag  DW_TAG_member
    2839                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2840                      .dwattr $C$DW$164, DW_AT_name("OSTCBStat")
    2841                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_OSTCBStat")
    2842                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2843                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2844              
    2845              $C$DW$165       .dwtag  DW_TAG_member
    2846                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2847                      .dwattr $C$DW$165, DW_AT_name("OSTCBStatPend")
    2848                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_OSTCBStatPend")
    2849                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2850                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2851              
    2852              $C$DW$166       .dwtag  DW_TAG_member
    2853                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2854                      .dwattr $C$DW$166, DW_AT_name("OSTCBPrio")
    2855                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_OSTCBPrio")
    2856                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2857                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2858              
    2859              $C$DW$167       .dwtag  DW_TAG_member
    2860                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2861                      .dwattr $C$DW$167, DW_AT_name("OSTCBX")
    2862                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_OSTCBX")
    2863                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2864                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2865              
    2866              $C$DW$168       .dwtag  DW_TAG_member
    2867                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2868                      .dwattr $C$DW$168, DW_AT_name("OSTCBY")
    2869                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_OSTCBY")
    2870                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2871                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2872              
    2873              $C$DW$169       .dwtag  DW_TAG_member
    2874                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2875                      .dwattr $C$DW$169, DW_AT_name("OSTCBBitX")
    2876                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_OSTCBBitX")
    2877                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2878                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2879              
    2880              $C$DW$170       .dwtag  DW_TAG_member
    2881                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    2882                      .dwattr $C$DW$170, DW_AT_name("OSTCBBitY")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   56

    2883                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_OSTCBBitY")
    2884                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2885                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2886              
    2887              $C$DW$171       .dwtag  DW_TAG_member
    2888                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2889                      .dwattr $C$DW$171, DW_AT_name("OSTCBDelReq")
    2890                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_OSTCBDelReq")
    2891                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2892                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2893              
    2894              $C$DW$172       .dwtag  DW_TAG_member
    2895                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    2896                      .dwattr $C$DW$172, DW_AT_name("OSTCBCtxSwCtr")
    2897                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    2898                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2899                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2900              
    2901              $C$DW$173       .dwtag  DW_TAG_member
    2902                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$31)
    2903                      .dwattr $C$DW$173, DW_AT_name("OSTCBCyclesTot")
    2904                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    2905                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2906                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2907              
    2908              $C$DW$174       .dwtag  DW_TAG_member
    2909                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$31)
    2910                      .dwattr $C$DW$174, DW_AT_name("OSTCBCyclesStart")
    2911                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    2912                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2913                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2914              
    2915              $C$DW$175       .dwtag  DW_TAG_member
    2916                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$30)
    2917                      .dwattr $C$DW$175, DW_AT_name("OSTCBStkBase")
    2918                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_OSTCBStkBase")
    2919                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2920                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2921              
    2922              $C$DW$176       .dwtag  DW_TAG_member
    2923                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$31)
    2924                      .dwattr $C$DW$176, DW_AT_name("OSTCBStkUsed")
    2925                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    2926                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2927                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2928              
    2929              $C$DW$177       .dwtag  DW_TAG_member
    2930                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$23)
    2931                      .dwattr $C$DW$177, DW_AT_name("OSTCBTaskName")
    2932                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_OSTCBTaskName")
    2933                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2934                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2935              
    2936              $C$DW$178       .dwtag  DW_TAG_member
    2937                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$38)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   57

    2938                      .dwattr $C$DW$178, DW_AT_name("OSTCBRegTbl")
    2939                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    2940                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2941                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2942              
    2943                      .dwendtag $C$DW$T$39
    2944              
    2945              $C$DW$T$45      .dwtag  DW_TAG_typedef
    2946                      .dwattr $C$DW$T$45, DW_AT_name("OS_TCB")
    2947                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$39)
    2948                      .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2949              
    2950              $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    2951                      .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    2952                      .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    2953              
    2954              
    2955              $C$DW$T$68      .dwtag  DW_TAG_array_type
    2956                      .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$46)
    2957                      .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    2958                      .dwattr $C$DW$T$68, DW_AT_byte_size(0x80)
    2959              $C$DW$179       .dwtag  DW_TAG_subrange_type
    2960                      .dwattr $C$DW$179, DW_AT_upper_bound(0x3f)
    2961              
    2962                      .dwendtag $C$DW$T$68
    2963              
    2964              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2965                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$39)
    2966                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    2967              
    2968                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2969              
    2970              ;***************************************************************
    2971              ;* DWARF CIE ENTRIES                                           *
    2972              ;***************************************************************
    2973              
    2974              $C$DW$CIE       .dwcie 26
    2975                      .dwcfi  cfa_register, 20
    2976                      .dwcfi  cfa_offset, 0
    2977                      .dwcfi  same_value, 28
    2978                      .dwcfi  same_value, 6
    2979                      .dwcfi  same_value, 7
    2980                      .dwcfi  same_value, 8
    2981                      .dwcfi  same_value, 9
    2982                      .dwcfi  same_value, 10
    2983                      .dwcfi  same_value, 11
    2984                      .dwendentry
    2985              
    2986              ;***************************************************************
    2987              ;* DWARF REGISTER MAP                                          *
    2988              ;***************************************************************
    2989              
    2990              $C$DW$180       .dwtag  DW_TAG_TI_assign_register
    2991                      .dwattr $C$DW$180, DW_AT_name("AL")
    2992                      .dwattr $C$DW$180, DW_AT_location[DW_OP_reg0]
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:15:59 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_mutex.asm                                                         PAGE   58

    2993              
    2994              $C$DW$181       .dwtag  DW_TAG_TI_assign_register
    2995                      .dwattr $C$DW$181, DW_AT_name("AH")
    2996                      .dwattr $C$DW$181, DW_AT_location[DW_OP_reg1]
    2997              
    2998              $C$DW$182       .dwtag  DW_TAG_TI_assign_register
    2999                      .dwattr $C$DW$182, DW_AT_name("PL")
    3000                      .dwattr $C$DW$182, DW_AT_location[DW_OP_reg2]
    3001              
    3002              $C$DW$183       .dwtag  DW_TAG_TI_assign_register
    3003                      .dwattr $C$DW$183, DW_AT_name("PH")
    3004                      .dwattr $C$DW$183, DW_AT_location[DW_OP_reg3]
    3005              
