TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan  4 16:08:39 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/ImitatePLC/Software/uCOS-II/Source/os_q
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\ImitatePLC\Examples\TI\TMDSDOCK2833
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    2944                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    2945                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2946                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2947              
    2948              $C$DW$T$25      .dwtag  DW_TAG_typedef
    2949                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    2950                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    2951                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2952              
    2953              $C$DW$T$44      .dwtag  DW_TAG_typedef
    2954                      .dwattr $C$DW$T$44, DW_AT_name("OS_CPU_SR")
    2955                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$9)
    2956                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2957              
    2958              $C$DW$T$31      .dwtag  DW_TAG_typedef
    2959                      .dwattr $C$DW$T$31, DW_AT_name("OS_STK")
    2960                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$9)
    2961                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2962              
    2963              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2964                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2965                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    2966              
    2967              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2968                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2969                      .dwattr $C$DW$T$10, DW_AT_name("int")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   57

    2970                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2971              
    2972              $C$DW$T$11      .dwtag  DW_TAG_base_type
    2973                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2974                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2975                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2976              
    2977              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2978                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2979                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2980                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2981              
    2982              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2983                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2984                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2985                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2986              
    2987              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2988                      .dwattr $C$DW$T$33, DW_AT_name("INT32U")
    2989                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$13)
    2990                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2991              
    2992              
    2993              $C$DW$T$40      .dwtag  DW_TAG_array_type
    2994                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$33)
    2995                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2996                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2997              $C$DW$180       .dwtag  DW_TAG_subrange_type
    2998                      .dwattr $C$DW$180, DW_AT_upper_bound(0x00)
    2999              
    3000                      .dwendtag $C$DW$T$40
    3001              
    3002              $C$DW$T$14      .dwtag  DW_TAG_base_type
    3003                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3004                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    3005                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    3006              
    3007              $C$DW$T$15      .dwtag  DW_TAG_base_type
    3008                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3009                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3010                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    3011              
    3012              $C$DW$T$16      .dwtag  DW_TAG_base_type
    3013                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3014                      .dwattr $C$DW$T$16, DW_AT_name("float")
    3015                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    3016              
    3017              $C$DW$T$17      .dwtag  DW_TAG_base_type
    3018                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3019                      .dwattr $C$DW$T$17, DW_AT_name("double")
    3020                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    3021              
    3022              $C$DW$T$18      .dwtag  DW_TAG_base_type
    3023                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3024                      .dwattr $C$DW$T$18, DW_AT_name("long double")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   58

    3025                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    3026              
    3027              
    3028              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3029                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    3030                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    3031              $C$DW$181       .dwtag  DW_TAG_member
    3032                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3033                      .dwattr $C$DW$181, DW_AT_name("OSEventType")
    3034                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_OSEventType")
    3035                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3036                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3037              
    3038              $C$DW$182       .dwtag  DW_TAG_member
    3039                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$3)
    3040                      .dwattr $C$DW$182, DW_AT_name("OSEventPtr")
    3041                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_OSEventPtr")
    3042                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3043                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3044              
    3045              $C$DW$183       .dwtag  DW_TAG_member
    3046                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    3047                      .dwattr $C$DW$183, DW_AT_name("OSEventCnt")
    3048                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_OSEventCnt")
    3049                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3050                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3051              
    3052              $C$DW$184       .dwtag  DW_TAG_member
    3053                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    3054                      .dwattr $C$DW$184, DW_AT_name("OSEventGrp")
    3055                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_OSEventGrp")
    3056                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3057                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3058              
    3059              $C$DW$185       .dwtag  DW_TAG_member
    3060                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    3061                      .dwattr $C$DW$185, DW_AT_name("OSEventTbl")
    3062                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_OSEventTbl")
    3063                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3064                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3065              
    3066              $C$DW$186       .dwtag  DW_TAG_member
    3067                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$23)
    3068                      .dwattr $C$DW$186, DW_AT_name("OSEventName")
    3069                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_OSEventName")
    3070                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3071                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3072              
    3073                      .dwendtag $C$DW$T$24
    3074              
    3075              $C$DW$T$35      .dwtag  DW_TAG_typedef
    3076                      .dwattr $C$DW$T$35, DW_AT_name("OS_EVENT")
    3077                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
    3078                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3079              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   59

    3080              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    3081                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3082                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    3083              
    3084              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3085                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3086                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3087              
    3088              
    3089              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3090                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    3091                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    3092              $C$DW$187       .dwtag  DW_TAG_member
    3093                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$3)
    3094                      .dwattr $C$DW$187, DW_AT_name("OSFlagNodeNext")
    3095                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    3096                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3097                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3098              
    3099              $C$DW$188       .dwtag  DW_TAG_member
    3100                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$3)
    3101                      .dwattr $C$DW$188, DW_AT_name("OSFlagNodePrev")
    3102                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    3103                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3104                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3105              
    3106              $C$DW$189       .dwtag  DW_TAG_member
    3107                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$3)
    3108                      .dwattr $C$DW$189, DW_AT_name("OSFlagNodeTCB")
    3109                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    3110                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3111                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3112              
    3113              $C$DW$190       .dwtag  DW_TAG_member
    3114                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$3)
    3115                      .dwattr $C$DW$190, DW_AT_name("OSFlagNodeFlagGrp")
    3116                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    3117                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3118                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3119              
    3120              $C$DW$191       .dwtag  DW_TAG_member
    3121                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$25)
    3122                      .dwattr $C$DW$191, DW_AT_name("OSFlagNodeFlags")
    3123                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    3124                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3125                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3126              
    3127              $C$DW$192       .dwtag  DW_TAG_member
    3128                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3129                      .dwattr $C$DW$192, DW_AT_name("OSFlagNodeWaitType")
    3130                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    3131                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3132                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3133              
    3134                      .dwendtag $C$DW$T$26
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   60

    3135              
    3136              $C$DW$T$38      .dwtag  DW_TAG_typedef
    3137                      .dwattr $C$DW$T$38, DW_AT_name("OS_FLAG_NODE")
    3138                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$26)
    3139                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3140              
    3141              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3142                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3143                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    3144              
    3145              
    3146              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3147                      .dwattr $C$DW$T$29, DW_AT_name("os_q")
    3148                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    3149              $C$DW$193       .dwtag  DW_TAG_member
    3150                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3151                      .dwattr $C$DW$193, DW_AT_name("OSQPtr")
    3152                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_OSQPtr")
    3153                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3154                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3155              
    3156              $C$DW$194       .dwtag  DW_TAG_member
    3157                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
    3158                      .dwattr $C$DW$194, DW_AT_name("OSQStart")
    3159                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_OSQStart")
    3160                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3161                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3162              
    3163              $C$DW$195       .dwtag  DW_TAG_member
    3164                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$28)
    3165                      .dwattr $C$DW$195, DW_AT_name("OSQEnd")
    3166                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_OSQEnd")
    3167                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3168                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3169              
    3170              $C$DW$196       .dwtag  DW_TAG_member
    3171                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$28)
    3172                      .dwattr $C$DW$196, DW_AT_name("OSQIn")
    3173                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_OSQIn")
    3174                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3175                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3176              
    3177              $C$DW$197       .dwtag  DW_TAG_member
    3178                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$28)
    3179                      .dwattr $C$DW$197, DW_AT_name("OSQOut")
    3180                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_OSQOut")
    3181                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3182                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3183              
    3184              $C$DW$198       .dwtag  DW_TAG_member
    3185                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    3186                      .dwattr $C$DW$198, DW_AT_name("OSQSize")
    3187                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_OSQSize")
    3188                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3189                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   61

    3190              
    3191              $C$DW$199       .dwtag  DW_TAG_member
    3192                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
    3193                      .dwattr $C$DW$199, DW_AT_name("OSQEntries")
    3194                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_OSQEntries")
    3195                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3196                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3197              
    3198                      .dwendtag $C$DW$T$29
    3199              
    3200              $C$DW$T$74      .dwtag  DW_TAG_typedef
    3201                      .dwattr $C$DW$T$74, DW_AT_name("OS_Q")
    3202                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$29)
    3203                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3204              
    3205              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    3206                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3207                      .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    3208              
    3209              
    3210              $C$DW$T$76      .dwtag  DW_TAG_array_type
    3211                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$74)
    3212                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3213                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x30)
    3214              $C$DW$200       .dwtag  DW_TAG_subrange_type
    3215                      .dwattr $C$DW$200, DW_AT_upper_bound(0x03)
    3216              
    3217                      .dwendtag $C$DW$T$76
    3218              
    3219              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    3220                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$29)
    3221                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    3222              
    3223              
    3224              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3225                      .dwattr $C$DW$T$30, DW_AT_name("os_q_data")
    3226                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0e)
    3227              $C$DW$201       .dwtag  DW_TAG_member
    3228                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$3)
    3229                      .dwattr $C$DW$201, DW_AT_name("OSMsg")
    3230                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_OSMsg")
    3231                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3232                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3233              
    3234              $C$DW$202       .dwtag  DW_TAG_member
    3235                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    3236                      .dwattr $C$DW$202, DW_AT_name("OSNMsgs")
    3237                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_OSNMsgs")
    3238                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3239                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3240              
    3241              $C$DW$203       .dwtag  DW_TAG_member
    3242                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    3243                      .dwattr $C$DW$203, DW_AT_name("OSQSize")
    3244                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_OSQSize")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   62

    3245                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3246                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3247              
    3248              $C$DW$204       .dwtag  DW_TAG_member
    3249                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    3250                      .dwattr $C$DW$204, DW_AT_name("OSEventTbl")
    3251                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_OSEventTbl")
    3252                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3253                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3254              
    3255              $C$DW$205       .dwtag  DW_TAG_member
    3256                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    3257                      .dwattr $C$DW$205, DW_AT_name("OSEventGrp")
    3258                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_OSEventGrp")
    3259                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3260                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3261              
    3262                      .dwendtag $C$DW$T$30
    3263              
    3264              $C$DW$T$65      .dwtag  DW_TAG_typedef
    3265                      .dwattr $C$DW$T$65, DW_AT_name("OS_Q_DATA")
    3266                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$30)
    3267                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3268              
    3269              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    3270                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3271                      .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    3272              
    3273              
    3274              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3275                      .dwattr $C$DW$T$41, DW_AT_name("os_tcb")
    3276                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x30)
    3277              $C$DW$206       .dwtag  DW_TAG_member
    3278                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    3279                      .dwattr $C$DW$206, DW_AT_name("OSTCBStkPtr")
    3280                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    3281                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3283              
    3284              $C$DW$207       .dwtag  DW_TAG_member
    3285                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$3)
    3286                      .dwattr $C$DW$207, DW_AT_name("OSTCBExtPtr")
    3287                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    3288                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3289                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3290              
    3291              $C$DW$208       .dwtag  DW_TAG_member
    3292                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$32)
    3293                      .dwattr $C$DW$208, DW_AT_name("OSTCBStkBottom")
    3294                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    3295                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3296                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3297              
    3298              $C$DW$209       .dwtag  DW_TAG_member
    3299                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$33)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   63

    3300                      .dwattr $C$DW$209, DW_AT_name("OSTCBStkSize")
    3301                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_OSTCBStkSize")
    3302                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3303                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3304              
    3305              $C$DW$210       .dwtag  DW_TAG_member
    3306                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    3307                      .dwattr $C$DW$210, DW_AT_name("OSTCBOpt")
    3308                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_OSTCBOpt")
    3309                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3310                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3311              
    3312              $C$DW$211       .dwtag  DW_TAG_member
    3313                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    3314                      .dwattr $C$DW$211, DW_AT_name("OSTCBId")
    3315                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_OSTCBId")
    3316                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3317                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3318              
    3319              $C$DW$212       .dwtag  DW_TAG_member
    3320                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$34)
    3321                      .dwattr $C$DW$212, DW_AT_name("OSTCBNext")
    3322                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_OSTCBNext")
    3323                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3324                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3325              
    3326              $C$DW$213       .dwtag  DW_TAG_member
    3327                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$34)
    3328                      .dwattr $C$DW$213, DW_AT_name("OSTCBPrev")
    3329                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_OSTCBPrev")
    3330                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3331                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3332              
    3333              $C$DW$214       .dwtag  DW_TAG_member
    3334                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$36)
    3335                      .dwattr $C$DW$214, DW_AT_name("OSTCBEventPtr")
    3336                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    3337                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3338                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3339              
    3340              $C$DW$215       .dwtag  DW_TAG_member
    3341                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$37)
    3342                      .dwattr $C$DW$215, DW_AT_name("OSTCBEventMultiPtr")
    3343                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    3344                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3345                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3346              
    3347              $C$DW$216       .dwtag  DW_TAG_member
    3348                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$3)
    3349                      .dwattr $C$DW$216, DW_AT_name("OSTCBMsg")
    3350                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_OSTCBMsg")
    3351                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3352                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3353              
    3354              $C$DW$217       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   64

    3355                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$39)
    3356                      .dwattr $C$DW$217, DW_AT_name("OSTCBFlagNode")
    3357                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    3358                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3359                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3360              
    3361              $C$DW$218       .dwtag  DW_TAG_member
    3362                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    3363                      .dwattr $C$DW$218, DW_AT_name("OSTCBFlagsRdy")
    3364                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    3365                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3366                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3367              
    3368              $C$DW$219       .dwtag  DW_TAG_member
    3369                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$33)
    3370                      .dwattr $C$DW$219, DW_AT_name("OSTCBDly")
    3371                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_OSTCBDly")
    3372                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3373                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3374              
    3375              $C$DW$220       .dwtag  DW_TAG_member
    3376                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3377                      .dwattr $C$DW$220, DW_AT_name("OSTCBStat")
    3378                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_OSTCBStat")
    3379                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3380                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3381              
    3382              $C$DW$221       .dwtag  DW_TAG_member
    3383                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3384                      .dwattr $C$DW$221, DW_AT_name("OSTCBStatPend")
    3385                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_OSTCBStatPend")
    3386                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3387                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3388              
    3389              $C$DW$222       .dwtag  DW_TAG_member
    3390                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3391                      .dwattr $C$DW$222, DW_AT_name("OSTCBPrio")
    3392                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_OSTCBPrio")
    3393                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3394                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3395              
    3396              $C$DW$223       .dwtag  DW_TAG_member
    3397                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3398                      .dwattr $C$DW$223, DW_AT_name("OSTCBX")
    3399                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_OSTCBX")
    3400                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3401                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3402              
    3403              $C$DW$224       .dwtag  DW_TAG_member
    3404                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3405                      .dwattr $C$DW$224, DW_AT_name("OSTCBY")
    3406                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_OSTCBY")
    3407                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3408                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3409              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   65

    3410              $C$DW$225       .dwtag  DW_TAG_member
    3411                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$21)
    3412                      .dwattr $C$DW$225, DW_AT_name("OSTCBBitX")
    3413                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_OSTCBBitX")
    3414                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3415                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3416              
    3417              $C$DW$226       .dwtag  DW_TAG_member
    3418                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    3419                      .dwattr $C$DW$226, DW_AT_name("OSTCBBitY")
    3420                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_OSTCBBitY")
    3421                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3422                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3423              
    3424              $C$DW$227       .dwtag  DW_TAG_member
    3425                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3426                      .dwattr $C$DW$227, DW_AT_name("OSTCBDelReq")
    3427                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_OSTCBDelReq")
    3428                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3429                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3430              
    3431              $C$DW$228       .dwtag  DW_TAG_member
    3432                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$33)
    3433                      .dwattr $C$DW$228, DW_AT_name("OSTCBCtxSwCtr")
    3434                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    3435                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3436                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3437              
    3438              $C$DW$229       .dwtag  DW_TAG_member
    3439                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$33)
    3440                      .dwattr $C$DW$229, DW_AT_name("OSTCBCyclesTot")
    3441                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    3442                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3443                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3444              
    3445              $C$DW$230       .dwtag  DW_TAG_member
    3446                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$33)
    3447                      .dwattr $C$DW$230, DW_AT_name("OSTCBCyclesStart")
    3448                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    3449                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3450                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3451              
    3452              $C$DW$231       .dwtag  DW_TAG_member
    3453                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$32)
    3454                      .dwattr $C$DW$231, DW_AT_name("OSTCBStkBase")
    3455                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_OSTCBStkBase")
    3456                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3457                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3458              
    3459              $C$DW$232       .dwtag  DW_TAG_member
    3460                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$33)
    3461                      .dwattr $C$DW$232, DW_AT_name("OSTCBStkUsed")
    3462                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    3463                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3464                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   66

    3465              
    3466              $C$DW$233       .dwtag  DW_TAG_member
    3467                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
    3468                      .dwattr $C$DW$233, DW_AT_name("OSTCBTaskName")
    3469                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_OSTCBTaskName")
    3470                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3471                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3472              
    3473              $C$DW$234       .dwtag  DW_TAG_member
    3474                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$40)
    3475                      .dwattr $C$DW$234, DW_AT_name("OSTCBRegTbl")
    3476                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    3477                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3478                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3479              
    3480                      .dwendtag $C$DW$T$41
    3481              
    3482              $C$DW$T$49      .dwtag  DW_TAG_typedef
    3483                      .dwattr $C$DW$T$49, DW_AT_name("OS_TCB")
    3484                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$41)
    3485                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3486              
    3487              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3488                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3489                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3490              
    3491              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3492                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$41)
    3493                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3494              
    3495                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3496              
    3497              ;***************************************************************
    3498              ;* DWARF CIE ENTRIES                                           *
    3499              ;***************************************************************
    3500              
    3501              $C$DW$CIE       .dwcie 26
    3502                      .dwcfi  cfa_register, 20
    3503                      .dwcfi  cfa_offset, 0
    3504                      .dwcfi  same_value, 28
    3505                      .dwcfi  same_value, 6
    3506                      .dwcfi  same_value, 7
    3507                      .dwcfi  same_value, 8
    3508                      .dwcfi  same_value, 9
    3509                      .dwcfi  same_value, 10
    3510                      .dwcfi  same_value, 11
    3511                      .dwcfi  same_value, 59
    3512                      .dwcfi  same_value, 63
    3513                      .dwcfi  same_value, 67
    3514                      .dwcfi  same_value, 71
    3515                      .dwendentry
    3516              
    3517              ;***************************************************************
    3518              ;* DWARF REGISTER MAP                                          *
    3519              ;***************************************************************
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   67

    3520              
    3521              $C$DW$235       .dwtag  DW_TAG_TI_assign_register
    3522                      .dwattr $C$DW$235, DW_AT_name("AL")
    3523                      .dwattr $C$DW$235, DW_AT_location[DW_OP_reg0]
    3524              
    3525              $C$DW$236       .dwtag  DW_TAG_TI_assign_register
    3526                      .dwattr $C$DW$236, DW_AT_name("AH")
    3527                      .dwattr $C$DW$236, DW_AT_location[DW_OP_reg1]
    3528              
    3529              $C$DW$237       .dwtag  DW_TAG_TI_assign_register
    3530                      .dwattr $C$DW$237, DW_AT_name("PL")
    3531                      .dwattr $C$DW$237, DW_AT_location[DW_OP_reg2]
    3532              
    3533              $C$DW$238       .dwtag  DW_TAG_TI_assign_register
    3534                      .dwattr $C$DW$238, DW_AT_name("PH")
    3535                      .dwattr $C$DW$238, DW_AT_location[DW_OP_reg3]
    3536              
    3537              $C$DW$239       .dwtag  DW_TAG_TI_assign_register
    3538                      .dwattr $C$DW$239, DW_AT_name("SP")
    3539                      .dwattr $C$DW$239, DW_AT_location[DW_OP_reg20]
    3540              
    3541              $C$DW$240       .dwtag  DW_TAG_TI_assign_register
