TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan 11 16:45:38 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_q.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    2941                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    2942                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    2943                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    2944              
    2945              $C$DW$T$25      .dwtag  DW_TAG_typedef
    2946                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    2947                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    2948                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    2949              
    2950              $C$DW$T$44      .dwtag  DW_TAG_typedef
    2951                      .dwattr $C$DW$T$44, DW_AT_name("OS_CPU_SR")
    2952                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$9)
    2953                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    2954              
    2955              $C$DW$T$31      .dwtag  DW_TAG_typedef
    2956                      .dwattr $C$DW$T$31, DW_AT_name("OS_STK")
    2957                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$9)
    2958                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    2959              
    2960              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    2961                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    2962                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    2963              
    2964              $C$DW$T$10      .dwtag  DW_TAG_base_type
    2965                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2966                      .dwattr $C$DW$T$10, DW_AT_name("int")
    2967                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    2968              
    2969              $C$DW$T$11      .dwtag  DW_TAG_base_type
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   57

    2970                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2971                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    2972                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    2973              
    2974              $C$DW$T$12      .dwtag  DW_TAG_base_type
    2975                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    2976                      .dwattr $C$DW$T$12, DW_AT_name("long")
    2977                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    2978              
    2979              $C$DW$T$13      .dwtag  DW_TAG_base_type
    2980                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    2981                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    2982                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    2983              
    2984              $C$DW$T$33      .dwtag  DW_TAG_typedef
    2985                      .dwattr $C$DW$T$33, DW_AT_name("INT32U")
    2986                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$13)
    2987                      .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    2988              
    2989              
    2990              $C$DW$T$40      .dwtag  DW_TAG_array_type
    2991                      .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$33)
    2992                      .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    2993                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    2994              $C$DW$180       .dwtag  DW_TAG_subrange_type
    2995                      .dwattr $C$DW$180, DW_AT_upper_bound(0x00)
    2996              
    2997                      .dwendtag $C$DW$T$40
    2998              
    2999              $C$DW$T$14      .dwtag  DW_TAG_base_type
    3000                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    3001                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    3002                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    3003              
    3004              $C$DW$T$15      .dwtag  DW_TAG_base_type
    3005                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    3006                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    3007                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    3008              
    3009              $C$DW$T$16      .dwtag  DW_TAG_base_type
    3010                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    3011                      .dwattr $C$DW$T$16, DW_AT_name("float")
    3012                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    3013              
    3014              $C$DW$T$17      .dwtag  DW_TAG_base_type
    3015                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    3016                      .dwattr $C$DW$T$17, DW_AT_name("double")
    3017                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    3018              
    3019              $C$DW$T$18      .dwtag  DW_TAG_base_type
    3020                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    3021                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    3022                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    3023              
    3024              
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   58

    3025              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    3026                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    3027                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    3028              $C$DW$181       .dwtag  DW_TAG_member
    3029                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    3030                      .dwattr $C$DW$181, DW_AT_name("OSEventType")
    3031                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_OSEventType")
    3032                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3033                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3034              
    3035              $C$DW$182       .dwtag  DW_TAG_member
    3036                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$3)
    3037                      .dwattr $C$DW$182, DW_AT_name("OSEventPtr")
    3038                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_OSEventPtr")
    3039                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3040                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3041              
    3042              $C$DW$183       .dwtag  DW_TAG_member
    3043                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$20)
    3044                      .dwattr $C$DW$183, DW_AT_name("OSEventCnt")
    3045                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_OSEventCnt")
    3046                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3047                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3048              
    3049              $C$DW$184       .dwtag  DW_TAG_member
    3050                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    3051                      .dwattr $C$DW$184, DW_AT_name("OSEventGrp")
    3052                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_OSEventGrp")
    3053                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    3054                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3055              
    3056              $C$DW$185       .dwtag  DW_TAG_member
    3057                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$22)
    3058                      .dwattr $C$DW$185, DW_AT_name("OSEventTbl")
    3059                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_OSEventTbl")
    3060                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3061                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3062              
    3063              $C$DW$186       .dwtag  DW_TAG_member
    3064                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$23)
    3065                      .dwattr $C$DW$186, DW_AT_name("OSEventName")
    3066                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_OSEventName")
    3067                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3068                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3069              
    3070                      .dwendtag $C$DW$T$24
    3071              
    3072              $C$DW$T$35      .dwtag  DW_TAG_typedef
    3073                      .dwattr $C$DW$T$35, DW_AT_name("OS_EVENT")
    3074                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$24)
    3075                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3076              
    3077              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    3078                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    3079                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   59

    3080              
    3081              $C$DW$T$37      .dwtag  DW_TAG_pointer_type
    3082                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$36)
    3083                      .dwattr $C$DW$T$37, DW_AT_address_class(0x20)
    3084              
    3085              
    3086              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3087                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    3088                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    3089              $C$DW$187       .dwtag  DW_TAG_member
    3090                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$3)
    3091                      .dwattr $C$DW$187, DW_AT_name("OSFlagNodeNext")
    3092                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    3093                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3094                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3095              
    3096              $C$DW$188       .dwtag  DW_TAG_member
    3097                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$3)
    3098                      .dwattr $C$DW$188, DW_AT_name("OSFlagNodePrev")
    3099                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    3100                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3101                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3102              
    3103              $C$DW$189       .dwtag  DW_TAG_member
    3104                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$3)
    3105                      .dwattr $C$DW$189, DW_AT_name("OSFlagNodeTCB")
    3106                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    3107                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3108                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3109              
    3110              $C$DW$190       .dwtag  DW_TAG_member
    3111                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$3)
    3112                      .dwattr $C$DW$190, DW_AT_name("OSFlagNodeFlagGrp")
    3113                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    3114                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3115                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3116              
    3117              $C$DW$191       .dwtag  DW_TAG_member
    3118                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$25)
    3119                      .dwattr $C$DW$191, DW_AT_name("OSFlagNodeFlags")
    3120                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    3121                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3122                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3123              
    3124              $C$DW$192       .dwtag  DW_TAG_member
    3125                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    3126                      .dwattr $C$DW$192, DW_AT_name("OSFlagNodeWaitType")
    3127                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    3128                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3129                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3130              
    3131                      .dwendtag $C$DW$T$26
    3132              
    3133              $C$DW$T$38      .dwtag  DW_TAG_typedef
    3134                      .dwattr $C$DW$T$38, DW_AT_name("OS_FLAG_NODE")
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   60

    3135                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$26)
    3136                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3137              
    3138              $C$DW$T$39      .dwtag  DW_TAG_pointer_type
    3139                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$38)
    3140                      .dwattr $C$DW$T$39, DW_AT_address_class(0x20)
    3141              
    3142              
    3143              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3144                      .dwattr $C$DW$T$29, DW_AT_name("os_q")
    3145                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x0c)
    3146              $C$DW$193       .dwtag  DW_TAG_member
    3147                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$27)
    3148                      .dwattr $C$DW$193, DW_AT_name("OSQPtr")
    3149                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_OSQPtr")
    3150                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3151                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3152              
    3153              $C$DW$194       .dwtag  DW_TAG_member
    3154                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$28)
    3155                      .dwattr $C$DW$194, DW_AT_name("OSQStart")
    3156                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_OSQStart")
    3157                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3158                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3159              
    3160              $C$DW$195       .dwtag  DW_TAG_member
    3161                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$28)
    3162                      .dwattr $C$DW$195, DW_AT_name("OSQEnd")
    3163                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_OSQEnd")
    3164                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3165                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3166              
    3167              $C$DW$196       .dwtag  DW_TAG_member
    3168                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$28)
    3169                      .dwattr $C$DW$196, DW_AT_name("OSQIn")
    3170                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_OSQIn")
    3171                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3172                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3173              
    3174              $C$DW$197       .dwtag  DW_TAG_member
    3175                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$28)
    3176                      .dwattr $C$DW$197, DW_AT_name("OSQOut")
    3177                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_OSQOut")
    3178                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3179                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3180              
    3181              $C$DW$198       .dwtag  DW_TAG_member
    3182                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$20)
    3183                      .dwattr $C$DW$198, DW_AT_name("OSQSize")
    3184                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_OSQSize")
    3185                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3186                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3187              
    3188              $C$DW$199       .dwtag  DW_TAG_member
    3189                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   61

    3190                      .dwattr $C$DW$199, DW_AT_name("OSQEntries")
    3191                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_OSQEntries")
    3192                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    3193                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3194              
    3195                      .dwendtag $C$DW$T$29
    3196              
    3197              $C$DW$T$74      .dwtag  DW_TAG_typedef
    3198                      .dwattr $C$DW$T$74, DW_AT_name("OS_Q")
    3199                      .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$29)
    3200                      .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3201              
    3202              $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    3203                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3204                      .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    3205              
    3206              
    3207              $C$DW$T$76      .dwtag  DW_TAG_array_type
    3208                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$74)
    3209                      .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3210                      .dwattr $C$DW$T$76, DW_AT_byte_size(0x30)
    3211              $C$DW$200       .dwtag  DW_TAG_subrange_type
    3212                      .dwattr $C$DW$200, DW_AT_upper_bound(0x03)
    3213              
    3214                      .dwendtag $C$DW$T$76
    3215              
    3216              $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    3217                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$29)
    3218                      .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    3219              
    3220              
    3221              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3222                      .dwattr $C$DW$T$30, DW_AT_name("os_q_data")
    3223                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x0e)
    3224              $C$DW$201       .dwtag  DW_TAG_member
    3225                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$3)
    3226                      .dwattr $C$DW$201, DW_AT_name("OSMsg")
    3227                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_OSMsg")
    3228                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3229                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3230              
    3231              $C$DW$202       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$20)
    3233                      .dwattr $C$DW$202, DW_AT_name("OSNMsgs")
    3234                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_OSNMsgs")
    3235                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3236                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3237              
    3238              $C$DW$203       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$20)
    3240                      .dwattr $C$DW$203, DW_AT_name("OSQSize")
    3241                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_OSQSize")
    3242                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    3243                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3244              
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   62

    3245              $C$DW$204       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$22)
    3247                      .dwattr $C$DW$204, DW_AT_name("OSEventTbl")
    3248                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_OSEventTbl")
    3249                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3250                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3251              
    3252              $C$DW$205       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    3254                      .dwattr $C$DW$205, DW_AT_name("OSEventGrp")
    3255                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_OSEventGrp")
    3256                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3257                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3258              
    3259                      .dwendtag $C$DW$T$30
    3260              
    3261              $C$DW$T$65      .dwtag  DW_TAG_typedef
    3262                      .dwattr $C$DW$T$65, DW_AT_name("OS_Q_DATA")
    3263                      .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$30)
    3264                      .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    3265              
    3266              $C$DW$T$66      .dwtag  DW_TAG_pointer_type
    3267                      .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$65)
    3268                      .dwattr $C$DW$T$66, DW_AT_address_class(0x20)
    3269              
    3270              
    3271              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3272                      .dwattr $C$DW$T$41, DW_AT_name("os_tcb")
    3273                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x30)
    3274              $C$DW$206       .dwtag  DW_TAG_member
    3275                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    3276                      .dwattr $C$DW$206, DW_AT_name("OSTCBStkPtr")
    3277                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    3278                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3279                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3280              
    3281              $C$DW$207       .dwtag  DW_TAG_member
    3282                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$3)
    3283                      .dwattr $C$DW$207, DW_AT_name("OSTCBExtPtr")
    3284                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    3285                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3286                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3287              
    3288              $C$DW$208       .dwtag  DW_TAG_member
    3289                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$32)
    3290                      .dwattr $C$DW$208, DW_AT_name("OSTCBStkBottom")
    3291                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    3292                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3293                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3294              
    3295              $C$DW$209       .dwtag  DW_TAG_member
    3296                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$33)
    3297                      .dwattr $C$DW$209, DW_AT_name("OSTCBStkSize")
    3298                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_OSTCBStkSize")
    3299                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   63

    3300                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3301              
    3302              $C$DW$210       .dwtag  DW_TAG_member
    3303                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$20)
    3304                      .dwattr $C$DW$210, DW_AT_name("OSTCBOpt")
    3305                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_OSTCBOpt")
    3306                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3307                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3308              
    3309              $C$DW$211       .dwtag  DW_TAG_member
    3310                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$20)
    3311                      .dwattr $C$DW$211, DW_AT_name("OSTCBId")
    3312                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_OSTCBId")
    3313                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    3314                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3315              
    3316              $C$DW$212       .dwtag  DW_TAG_member
    3317                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$34)
    3318                      .dwattr $C$DW$212, DW_AT_name("OSTCBNext")
    3319                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_OSTCBNext")
    3320                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3321                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3322              
    3323              $C$DW$213       .dwtag  DW_TAG_member
    3324                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$34)
    3325                      .dwattr $C$DW$213, DW_AT_name("OSTCBPrev")
    3326                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_OSTCBPrev")
    3327                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3328                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3329              
    3330              $C$DW$214       .dwtag  DW_TAG_member
    3331                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$36)
    3332                      .dwattr $C$DW$214, DW_AT_name("OSTCBEventPtr")
    3333                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    3334                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3335                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3336              
    3337              $C$DW$215       .dwtag  DW_TAG_member
    3338                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$37)
    3339                      .dwattr $C$DW$215, DW_AT_name("OSTCBEventMultiPtr")
    3340                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    3341                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3342                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3343              
    3344              $C$DW$216       .dwtag  DW_TAG_member
    3345                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$3)
    3346                      .dwattr $C$DW$216, DW_AT_name("OSTCBMsg")
    3347                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_OSTCBMsg")
    3348                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3349                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3350              
    3351              $C$DW$217       .dwtag  DW_TAG_member
    3352                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$39)
    3353                      .dwattr $C$DW$217, DW_AT_name("OSTCBFlagNode")
    3354                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_OSTCBFlagNode")
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   64

    3355                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3356                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3357              
    3358              $C$DW$218       .dwtag  DW_TAG_member
    3359                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$25)
    3360                      .dwattr $C$DW$218, DW_AT_name("OSTCBFlagsRdy")
    3361                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    3362                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3363                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3364              
    3365              $C$DW$219       .dwtag  DW_TAG_member
    3366                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$33)
    3367                      .dwattr $C$DW$219, DW_AT_name("OSTCBDly")
    3368                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_OSTCBDly")
    3369                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3370                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3371              
    3372              $C$DW$220       .dwtag  DW_TAG_member
    3373                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
    3374                      .dwattr $C$DW$220, DW_AT_name("OSTCBStat")
    3375                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_OSTCBStat")
    3376                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3377                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3378              
    3379              $C$DW$221       .dwtag  DW_TAG_member
    3380                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3381                      .dwattr $C$DW$221, DW_AT_name("OSTCBStatPend")
    3382                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_OSTCBStatPend")
    3383                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    3384                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3385              
    3386              $C$DW$222       .dwtag  DW_TAG_member
    3387                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3388                      .dwattr $C$DW$222, DW_AT_name("OSTCBPrio")
    3389                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_OSTCBPrio")
    3390                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3391                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3392              
    3393              $C$DW$223       .dwtag  DW_TAG_member
    3394                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3395                      .dwattr $C$DW$223, DW_AT_name("OSTCBX")
    3396                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_OSTCBX")
    3397                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    3398                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3399              
    3400              $C$DW$224       .dwtag  DW_TAG_member
    3401                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3402                      .dwattr $C$DW$224, DW_AT_name("OSTCBY")
    3403                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_OSTCBY")
    3404                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    3405                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3406              
    3407              $C$DW$225       .dwtag  DW_TAG_member
    3408                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$21)
    3409                      .dwattr $C$DW$225, DW_AT_name("OSTCBBitX")
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   65

    3410                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_OSTCBBitX")
    3411                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    3412                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3413              
    3414              $C$DW$226       .dwtag  DW_TAG_member
    3415                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$21)
    3416                      .dwattr $C$DW$226, DW_AT_name("OSTCBBitY")
    3417                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_OSTCBBitY")
    3418                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3419                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3420              
    3421              $C$DW$227       .dwtag  DW_TAG_member
    3422                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3423                      .dwattr $C$DW$227, DW_AT_name("OSTCBDelReq")
    3424                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_OSTCBDelReq")
    3425                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    3426                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3427              
    3428              $C$DW$228       .dwtag  DW_TAG_member
    3429                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$33)
    3430                      .dwattr $C$DW$228, DW_AT_name("OSTCBCtxSwCtr")
    3431                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    3432                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    3433                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3434              
    3435              $C$DW$229       .dwtag  DW_TAG_member
    3436                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$33)
    3437                      .dwattr $C$DW$229, DW_AT_name("OSTCBCyclesTot")
    3438                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    3439                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3440                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3441              
    3442              $C$DW$230       .dwtag  DW_TAG_member
    3443                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$33)
    3444                      .dwattr $C$DW$230, DW_AT_name("OSTCBCyclesStart")
    3445                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    3446                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    3447                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3448              
    3449              $C$DW$231       .dwtag  DW_TAG_member
    3450                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$32)
    3451                      .dwattr $C$DW$231, DW_AT_name("OSTCBStkBase")
    3452                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_OSTCBStkBase")
    3453                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3454                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3455              
    3456              $C$DW$232       .dwtag  DW_TAG_member
    3457                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$33)
    3458                      .dwattr $C$DW$232, DW_AT_name("OSTCBStkUsed")
    3459                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    3460                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    3461                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3462              
    3463              $C$DW$233       .dwtag  DW_TAG_member
    3464                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$23)
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   66

    3465                      .dwattr $C$DW$233, DW_AT_name("OSTCBTaskName")
    3466                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_OSTCBTaskName")
    3467                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3468                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3469              
    3470              $C$DW$234       .dwtag  DW_TAG_member
    3471                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$40)
    3472                      .dwattr $C$DW$234, DW_AT_name("OSTCBRegTbl")
    3473                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    3474                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    3475                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3476              
    3477                      .dwendtag $C$DW$T$41
    3478              
    3479              $C$DW$T$49      .dwtag  DW_TAG_typedef
    3480                      .dwattr $C$DW$T$49, DW_AT_name("OS_TCB")
    3481                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$41)
    3482                      .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    3483              
    3484              $C$DW$T$50      .dwtag  DW_TAG_pointer_type
    3485                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
    3486                      .dwattr $C$DW$T$50, DW_AT_address_class(0x20)
    3487              
    3488              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3489                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$41)
    3490                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3491              
    3492                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    3493              
    3494              ;***************************************************************
    3495              ;* DWARF CIE ENTRIES                                           *
    3496              ;***************************************************************
    3497              
    3498              $C$DW$CIE       .dwcie 26
    3499                      .dwcfi  cfa_register, 20
    3500                      .dwcfi  cfa_offset, 0
    3501                      .dwcfi  same_value, 28
    3502                      .dwcfi  same_value, 6
    3503                      .dwcfi  same_value, 7
    3504                      .dwcfi  same_value, 8
    3505                      .dwcfi  same_value, 9
    3506                      .dwcfi  same_value, 10
    3507                      .dwcfi  same_value, 11
    3508                      .dwendentry
    3509              
    3510              ;***************************************************************
    3511              ;* DWARF REGISTER MAP                                          *
    3512              ;***************************************************************
    3513              
    3514              $C$DW$235       .dwtag  DW_TAG_TI_assign_register
    3515                      .dwattr $C$DW$235, DW_AT_name("AL")
    3516                      .dwattr $C$DW$235, DW_AT_location[DW_OP_reg0]
    3517              
    3518              $C$DW$236       .dwtag  DW_TAG_TI_assign_register
    3519                      .dwattr $C$DW$236, DW_AT_name("AH")
TMS320C2000 Assembler PC v20.2.1 Mon Jan 11 16:45:38 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_q.asm                                                             PAGE   67

    3520                      .dwattr $C$DW$236, DW_AT_location[DW_OP_reg1]
    3521              
    3522              $C$DW$237       .dwtag  DW_TAG_TI_assign_register
    3523                      .dwattr $C$DW$237, DW_AT_name("PL")
    3524                      .dwattr $C$DW$237, DW_AT_location[DW_OP_reg2]
    3525              
    3526              $C$DW$238       .dwtag  DW_TAG_TI_assign_register
    3527                      .dwattr $C$DW$238, DW_AT_name("PH")
    3528                      .dwattr $C$DW$238, DW_AT_location[DW_OP_reg3]
    3529              
    3530              $C$DW$239       .dwtag  DW_TAG_TI_assign_register
    3531                      .dwattr $C$DW$239, DW_AT_name("SP")
    3532                      .dwattr $C$DW$239, DW_AT_location[DW_OP_reg20]
    3533              
    3534              $C$DW$240       .dwtag  DW_TAG_TI_assign_register
    3535                      .dwattr $C$DW$240, DW_AT_name("XT")
    3536                      .dwattr $C$DW$240, DW_AT_location[DW_OP_reg21]
    3537              
    3538              $C$DW$241       .dwtag  DW_TAG_TI_assign_register
