TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Jan  4 16:08:39 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/ImitatePLC/Software/uCOS-II/Source/os_s
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\ImitatePLC\Examples\TI\TMDSDOCK2833
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    1900                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    1901                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    1902                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    1903              
    1904              $C$DW$T$25      .dwtag  DW_TAG_typedef
    1905                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    1906                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    1907                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    1908              
    1909              $C$DW$T$39      .dwtag  DW_TAG_typedef
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   37

    1910                      .dwattr $C$DW$T$39, DW_AT_name("OS_CPU_SR")
    1911                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$9)
    1912                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    1913              
    1914              $C$DW$T$28      .dwtag  DW_TAG_typedef
    1915                      .dwattr $C$DW$T$28, DW_AT_name("OS_STK")
    1916                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$9)
    1917                      .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    1918              
    1919              $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    1920                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$28)
    1921                      .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    1922              
    1923              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1924                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1925                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1926                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1927              
    1928              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1929                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1930                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1931                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1932              
    1933              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1934                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1935                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1936                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1937              
    1938              $C$DW$T$13      .dwtag  DW_TAG_base_type
    1939                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1940                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1941                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1942              
    1943              $C$DW$T$30      .dwtag  DW_TAG_typedef
    1944                      .dwattr $C$DW$T$30, DW_AT_name("INT32U")
    1945                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$13)
    1946                      .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    1947              
    1948              
    1949              $C$DW$T$37      .dwtag  DW_TAG_array_type
    1950                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$30)
    1951                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    1952                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1953              $C$DW$124       .dwtag  DW_TAG_subrange_type
    1954                      .dwattr $C$DW$124, DW_AT_upper_bound(0x00)
    1955              
    1956                      .dwendtag $C$DW$T$37
    1957              
    1958              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1959                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1960                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1961                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1962              
    1963              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1964                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   38

    1965                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1966                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1967              
    1968              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1969                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1970                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1971                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1972              
    1973              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1974                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1975                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1976                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1977              
    1978              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1979                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1980                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1981                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    1982              
    1983              
    1984              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1985                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    1986                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1987              $C$DW$125       .dwtag  DW_TAG_member
    1988                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1989                      .dwattr $C$DW$125, DW_AT_name("OSEventType")
    1990                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_OSEventType")
    1991                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1992                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1993              
    1994              $C$DW$126       .dwtag  DW_TAG_member
    1995                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$3)
    1996                      .dwattr $C$DW$126, DW_AT_name("OSEventPtr")
    1997                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_OSEventPtr")
    1998                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1999                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2000              
    2001              $C$DW$127       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    2003                      .dwattr $C$DW$127, DW_AT_name("OSEventCnt")
    2004                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_OSEventCnt")
    2005                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2006                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2007              
    2008              $C$DW$128       .dwtag  DW_TAG_member
    2009                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
    2010                      .dwattr $C$DW$128, DW_AT_name("OSEventGrp")
    2011                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_OSEventGrp")
    2012                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2013                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2014              
    2015              $C$DW$129       .dwtag  DW_TAG_member
    2016                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$22)
    2017                      .dwattr $C$DW$129, DW_AT_name("OSEventTbl")
    2018                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_OSEventTbl")
    2019                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   39

    2020                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2021              
    2022              $C$DW$130       .dwtag  DW_TAG_member
    2023                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$23)
    2024                      .dwattr $C$DW$130, DW_AT_name("OSEventName")
    2025                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_OSEventName")
    2026                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2027                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2028              
    2029                      .dwendtag $C$DW$T$24
    2030              
    2031              $C$DW$T$32      .dwtag  DW_TAG_typedef
    2032                      .dwattr $C$DW$T$32, DW_AT_name("OS_EVENT")
    2033                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    2034                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    2035              
    2036              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    2037                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    2038                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    2039              
    2040              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    2041                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    2042                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    2043              
    2044              
    2045              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2046                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    2047                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    2048              $C$DW$131       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$3)
    2050                      .dwattr $C$DW$131, DW_AT_name("OSFlagNodeNext")
    2051                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    2052                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2054              
    2055              $C$DW$132       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$3)
    2057                      .dwattr $C$DW$132, DW_AT_name("OSFlagNodePrev")
    2058                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    2059                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2060                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2061              
    2062              $C$DW$133       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$3)
    2064                      .dwattr $C$DW$133, DW_AT_name("OSFlagNodeTCB")
    2065                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    2066                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2067                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2068              
    2069              $C$DW$134       .dwtag  DW_TAG_member
    2070                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$3)
    2071                      .dwattr $C$DW$134, DW_AT_name("OSFlagNodeFlagGrp")
    2072                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    2073                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2074                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   40

    2075              
    2076              $C$DW$135       .dwtag  DW_TAG_member
    2077                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$25)
    2078                      .dwattr $C$DW$135, DW_AT_name("OSFlagNodeFlags")
    2079                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    2080                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2081                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2082              
    2083              $C$DW$136       .dwtag  DW_TAG_member
    2084                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2085                      .dwattr $C$DW$136, DW_AT_name("OSFlagNodeWaitType")
    2086                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    2087                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2088                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2089              
    2090                      .dwendtag $C$DW$T$26
    2091              
    2092              $C$DW$T$35      .dwtag  DW_TAG_typedef
    2093                      .dwattr $C$DW$T$35, DW_AT_name("OS_FLAG_NODE")
    2094                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$26)
    2095                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    2096              
    2097              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    2098                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    2099                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    2100              
    2101              
    2102              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2103                      .dwattr $C$DW$T$27, DW_AT_name("os_sem_data")
    2104                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x0a)
    2105              $C$DW$137       .dwtag  DW_TAG_member
    2106                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    2107                      .dwattr $C$DW$137, DW_AT_name("OSCnt")
    2108                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_OSCnt")
    2109                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2110                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2111              
    2112              $C$DW$138       .dwtag  DW_TAG_member
    2113                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$22)
    2114                      .dwattr $C$DW$138, DW_AT_name("OSEventTbl")
    2115                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_OSEventTbl")
    2116                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2117                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2118              
    2119              $C$DW$139       .dwtag  DW_TAG_member
    2120                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    2121                      .dwattr $C$DW$139, DW_AT_name("OSEventGrp")
    2122                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_OSEventGrp")
    2123                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2124                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2125              
    2126                      .dwendtag $C$DW$T$27
    2127              
    2128              $C$DW$T$58      .dwtag  DW_TAG_typedef
    2129                      .dwattr $C$DW$T$58, DW_AT_name("OS_SEM_DATA")
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   41

    2130                      .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$27)
    2131                      .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    2132              
    2133              $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    2134                      .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$58)
    2135                      .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    2136              
    2137              
    2138              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2139                      .dwattr $C$DW$T$38, DW_AT_name("os_tcb")
    2140                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x30)
    2141              $C$DW$140       .dwtag  DW_TAG_member
    2142                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$29)
    2143                      .dwattr $C$DW$140, DW_AT_name("OSTCBStkPtr")
    2144                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    2145                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2146                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2147              
    2148              $C$DW$141       .dwtag  DW_TAG_member
    2149                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$3)
    2150                      .dwattr $C$DW$141, DW_AT_name("OSTCBExtPtr")
    2151                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    2152                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2153                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2154              
    2155              $C$DW$142       .dwtag  DW_TAG_member
    2156                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$29)
    2157                      .dwattr $C$DW$142, DW_AT_name("OSTCBStkBottom")
    2158                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    2159                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2160                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2161              
    2162              $C$DW$143       .dwtag  DW_TAG_member
    2163                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$30)
    2164                      .dwattr $C$DW$143, DW_AT_name("OSTCBStkSize")
    2165                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_OSTCBStkSize")
    2166                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2167                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2168              
    2169              $C$DW$144       .dwtag  DW_TAG_member
    2170                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    2171                      .dwattr $C$DW$144, DW_AT_name("OSTCBOpt")
    2172                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_OSTCBOpt")
    2173                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2174                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2175              
    2176              $C$DW$145       .dwtag  DW_TAG_member
    2177                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    2178                      .dwattr $C$DW$145, DW_AT_name("OSTCBId")
    2179                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_OSTCBId")
    2180                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    2181                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2182              
    2183              $C$DW$146       .dwtag  DW_TAG_member
    2184                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$31)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   42

    2185                      .dwattr $C$DW$146, DW_AT_name("OSTCBNext")
    2186                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_OSTCBNext")
    2187                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2188                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2189              
    2190              $C$DW$147       .dwtag  DW_TAG_member
    2191                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$31)
    2192                      .dwattr $C$DW$147, DW_AT_name("OSTCBPrev")
    2193                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_OSTCBPrev")
    2194                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2195                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2196              
    2197              $C$DW$148       .dwtag  DW_TAG_member
    2198                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$33)
    2199                      .dwattr $C$DW$148, DW_AT_name("OSTCBEventPtr")
    2200                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    2201                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2202                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2203              
    2204              $C$DW$149       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$34)
    2206                      .dwattr $C$DW$149, DW_AT_name("OSTCBEventMultiPtr")
    2207                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    2208                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2209                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2210              
    2211              $C$DW$150       .dwtag  DW_TAG_member
    2212                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$3)
    2213                      .dwattr $C$DW$150, DW_AT_name("OSTCBMsg")
    2214                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_OSTCBMsg")
    2215                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2216                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2217              
    2218              $C$DW$151       .dwtag  DW_TAG_member
    2219                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$36)
    2220                      .dwattr $C$DW$151, DW_AT_name("OSTCBFlagNode")
    2221                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    2222                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2223                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2224              
    2225              $C$DW$152       .dwtag  DW_TAG_member
    2226                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$25)
    2227                      .dwattr $C$DW$152, DW_AT_name("OSTCBFlagsRdy")
    2228                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    2229                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2230                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2231              
    2232              $C$DW$153       .dwtag  DW_TAG_member
    2233                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$30)
    2234                      .dwattr $C$DW$153, DW_AT_name("OSTCBDly")
    2235                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_OSTCBDly")
    2236                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2237                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2238              
    2239              $C$DW$154       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   43

    2240                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2241                      .dwattr $C$DW$154, DW_AT_name("OSTCBStat")
    2242                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_OSTCBStat")
    2243                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2244                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2245              
    2246              $C$DW$155       .dwtag  DW_TAG_member
    2247                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2248                      .dwattr $C$DW$155, DW_AT_name("OSTCBStatPend")
    2249                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_OSTCBStatPend")
    2250                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2251                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2252              
    2253              $C$DW$156       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2255                      .dwattr $C$DW$156, DW_AT_name("OSTCBPrio")
    2256                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_OSTCBPrio")
    2257                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2258                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2259              
    2260              $C$DW$157       .dwtag  DW_TAG_member
    2261                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2262                      .dwattr $C$DW$157, DW_AT_name("OSTCBX")
    2263                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_OSTCBX")
    2264                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2265                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2266              
    2267              $C$DW$158       .dwtag  DW_TAG_member
    2268                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    2269                      .dwattr $C$DW$158, DW_AT_name("OSTCBY")
    2270                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_OSTCBY")
    2271                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2272                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2273              
    2274              $C$DW$159       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    2276                      .dwattr $C$DW$159, DW_AT_name("OSTCBBitX")
    2277                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_OSTCBBitX")
    2278                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2279                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2280              
    2281              $C$DW$160       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    2283                      .dwattr $C$DW$160, DW_AT_name("OSTCBBitY")
    2284                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_OSTCBBitY")
    2285                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2286                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2287              
    2288              $C$DW$161       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2290                      .dwattr $C$DW$161, DW_AT_name("OSTCBDelReq")
    2291                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_OSTCBDelReq")
    2292                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    2293                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2294              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   44

    2295              $C$DW$162       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$30)
    2297                      .dwattr $C$DW$162, DW_AT_name("OSTCBCtxSwCtr")
    2298                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    2299                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    2300                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2301              
    2302              $C$DW$163       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$30)
    2304                      .dwattr $C$DW$163, DW_AT_name("OSTCBCyclesTot")
    2305                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    2306                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2307                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2308              
    2309              $C$DW$164       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$30)
    2311                      .dwattr $C$DW$164, DW_AT_name("OSTCBCyclesStart")
    2312                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    2313                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    2314                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2315              
    2316              $C$DW$165       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$29)
    2318                      .dwattr $C$DW$165, DW_AT_name("OSTCBStkBase")
    2319                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_OSTCBStkBase")
    2320                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2321                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2322              
    2323              $C$DW$166       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$30)
    2325                      .dwattr $C$DW$166, DW_AT_name("OSTCBStkUsed")
    2326                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    2327                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    2328                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2329              
    2330              $C$DW$167       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$23)
    2332                      .dwattr $C$DW$167, DW_AT_name("OSTCBTaskName")
    2333                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_OSTCBTaskName")
    2334                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2335                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2336              
    2337              $C$DW$168       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$37)
    2339                      .dwattr $C$DW$168, DW_AT_name("OSTCBRegTbl")
    2340                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    2341                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    2342                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2343              
    2344                      .dwendtag $C$DW$T$38
    2345              
    2346              $C$DW$T$44      .dwtag  DW_TAG_typedef
    2347                      .dwattr $C$DW$T$44, DW_AT_name("OS_TCB")
    2348                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$38)
    2349                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_sem.asm                                                           PAGE   45

    2350              
    2351              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    2352                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    2353                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    2354              
    2355              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    2356                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$38)
    2357                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    2358              
    2359                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    2360              
    2361              ;***************************************************************
    2362              ;* DWARF CIE ENTRIES                                           *
    2363              ;***************************************************************
    2364              
    2365              $C$DW$CIE       .dwcie 26
    2366                      .dwcfi  cfa_register, 20
    2367                      .dwcfi  cfa_offset, 0
    2368                      .dwcfi  same_value, 28
    2369                      .dwcfi  same_value, 6
    2370                      .dwcfi  same_value, 7
    2371                      .dwcfi  same_value, 8
    2372                      .dwcfi  same_value, 9
    2373                      .dwcfi  same_value, 10
    2374                      .dwcfi  same_value, 11
    2375                      .dwcfi  same_value, 59
    2376                      .dwcfi  same_value, 63
    2377                      .dwcfi  same_value, 67
    2378                      .dwcfi  same_value, 71
    2379                      .dwendentry
    2380              
    2381              ;***************************************************************
    2382              ;* DWARF REGISTER MAP                                          *
    2383              ;***************************************************************
    2384              
    2385              $C$DW$169       .dwtag  DW_TAG_TI_assign_register
    2386                      .dwattr $C$DW$169, DW_AT_name("AL")
    2387                      .dwattr $C$DW$169, DW_AT_location[DW_OP_reg0]
    2388              
    2389              $C$DW$170       .dwtag  DW_TAG_TI_assign_register
    2390                      .dwattr $C$DW$170, DW_AT_name("AH")
    2391                      .dwattr $C$DW$170, DW_AT_location[DW_OP_reg1]
    2392              
    2393              $C$DW$171       .dwtag  DW_TAG_TI_assign_register
    2394                      .dwattr $C$DW$171, DW_AT_name("PL")
    2395                      .dwattr $C$DW$171, DW_AT_location[DW_OP_reg2]
    2396              
    2397              $C$DW$172       .dwtag  DW_TAG_TI_assign_register
    2398                      .dwattr $C$DW$172, DW_AT_name("PH")
    2399                      .dwattr $C$DW$172, DW_AT_location[DW_OP_reg3]
    2400              
    2401              $C$DW$173       .dwtag  DW_TAG_TI_assign_register
    2402                      .dwattr $C$DW$173, DW_AT_name("SP")
    2403                      .dwattr $C$DW$173, DW_AT_location[DW_OP_reg20]
    2404              
TMS320C2000 Assembler PC v20.2.1 Mon Jan  4 16:08:39 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
