TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Wed Jan  6 17:53:26 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=f
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate_backup/Software/uCOS-II/Source/os_task.
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate_backup\Examples\TI\TMDSDOCK28335\OS
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    4258                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    4259                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    4260                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4261              
    4262              $C$DW$T$25      .dwtag  DW_TAG_typedef
    4263                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    4264                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    4265                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4266              
    4267              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4268                      .dwattr $C$DW$T$39, DW_AT_name("OS_CPU_SR")
    4269                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$9)
    4270                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4271              
    4272              $C$DW$T$29      .dwtag  DW_TAG_typedef
    4273                      .dwattr $C$DW$T$29, DW_AT_name("OS_STK")
    4274                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    4275                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4276              
    4277              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    4278                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4279                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    4280              
    4281              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4282                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4283                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4284                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4285              
    4286              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4287                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4288                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   83

    4289                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4290              
    4291              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4292                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4293                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4294                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    4295              
    4296              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4297                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4298                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4299                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4300              
    4301              $C$DW$T$27      .dwtag  DW_TAG_typedef
    4302                      .dwattr $C$DW$T$27, DW_AT_name("INT32U")
    4303                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$13)
    4304                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4305              
    4306              
    4307              $C$DW$T$37      .dwtag  DW_TAG_array_type
    4308                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$27)
    4309                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4310                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    4311              $C$DW$286       .dwtag  DW_TAG_subrange_type
    4312                      .dwattr $C$DW$286, DW_AT_upper_bound(0x00)
    4313              
    4314                      .dwendtag $C$DW$T$37
    4315              
    4316              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4317                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4318                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4319                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4320              
    4321              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4322                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4323                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4324                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4325              
    4326              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4327                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4328                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4329                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4330              
    4331              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4332                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4333                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4334                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4335              
    4336              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4337                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4338                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4339                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4340              
    4341              
    4342              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4343                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   84

    4344                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    4345              $C$DW$287       .dwtag  DW_TAG_member
    4346                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    4347                      .dwattr $C$DW$287, DW_AT_name("OSEventType")
    4348                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_OSEventType")
    4349                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4350                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4351              
    4352              $C$DW$288       .dwtag  DW_TAG_member
    4353                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$3)
    4354                      .dwattr $C$DW$288, DW_AT_name("OSEventPtr")
    4355                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_OSEventPtr")
    4356                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4357                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4358              
    4359              $C$DW$289       .dwtag  DW_TAG_member
    4360                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    4361                      .dwattr $C$DW$289, DW_AT_name("OSEventCnt")
    4362                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_OSEventCnt")
    4363                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4364                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4365              
    4366              $C$DW$290       .dwtag  DW_TAG_member
    4367                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    4368                      .dwattr $C$DW$290, DW_AT_name("OSEventGrp")
    4369                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_OSEventGrp")
    4370                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4371                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4372              
    4373              $C$DW$291       .dwtag  DW_TAG_member
    4374                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
    4375                      .dwattr $C$DW$291, DW_AT_name("OSEventTbl")
    4376                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_OSEventTbl")
    4377                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4378                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4379              
    4380              $C$DW$292       .dwtag  DW_TAG_member
    4381                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$23)
    4382                      .dwattr $C$DW$292, DW_AT_name("OSEventName")
    4383                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_OSEventName")
    4384                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4385                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4386              
    4387                      .dwendtag $C$DW$T$24
    4388              
    4389              $C$DW$T$32      .dwtag  DW_TAG_typedef
    4390                      .dwattr $C$DW$T$32, DW_AT_name("OS_EVENT")
    4391                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    4392                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4393              
    4394              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4395                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4396                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    4397              
    4398              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   85

    4399                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4400                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4401              
    4402              
    4403              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4404                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    4405                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    4406              $C$DW$293       .dwtag  DW_TAG_member
    4407                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$3)
    4408                      .dwattr $C$DW$293, DW_AT_name("OSFlagNodeNext")
    4409                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    4410                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4411                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4412              
    4413              $C$DW$294       .dwtag  DW_TAG_member
    4414                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$3)
    4415                      .dwattr $C$DW$294, DW_AT_name("OSFlagNodePrev")
    4416                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    4417                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4418                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4419              
    4420              $C$DW$295       .dwtag  DW_TAG_member
    4421                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$3)
    4422                      .dwattr $C$DW$295, DW_AT_name("OSFlagNodeTCB")
    4423                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    4424                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4425                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4426              
    4427              $C$DW$296       .dwtag  DW_TAG_member
    4428                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$3)
    4429                      .dwattr $C$DW$296, DW_AT_name("OSFlagNodeFlagGrp")
    4430                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    4431                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4432                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4433              
    4434              $C$DW$297       .dwtag  DW_TAG_member
    4435                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$25)
    4436                      .dwattr $C$DW$297, DW_AT_name("OSFlagNodeFlags")
    4437                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    4438                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4439                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4440              
    4441              $C$DW$298       .dwtag  DW_TAG_member
    4442                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    4443                      .dwattr $C$DW$298, DW_AT_name("OSFlagNodeWaitType")
    4444                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    4445                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4446                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4447              
    4448                      .dwendtag $C$DW$T$26
    4449              
    4450              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4451                      .dwattr $C$DW$T$35, DW_AT_name("OS_FLAG_NODE")
    4452                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$26)
    4453                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   86

    4454              
    4455              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4456                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4457                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4458              
    4459              
    4460              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4461                      .dwattr $C$DW$T$28, DW_AT_name("os_stk_data")
    4462                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4463              $C$DW$299       .dwtag  DW_TAG_member
    4464                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$27)
    4465                      .dwattr $C$DW$299, DW_AT_name("OSFree")
    4466                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_OSFree")
    4467                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4468                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4469              
    4470              $C$DW$300       .dwtag  DW_TAG_member
    4471                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$27)
    4472                      .dwattr $C$DW$300, DW_AT_name("OSUsed")
    4473                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_OSUsed")
    4474                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4475                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4476              
    4477                      .dwendtag $C$DW$T$28
    4478              
    4479              $C$DW$T$75      .dwtag  DW_TAG_typedef
    4480                      .dwattr $C$DW$T$75, DW_AT_name("OS_STK_DATA")
    4481                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    4482                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4483              
    4484              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    4485                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    4486                      .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    4487              
    4488              
    4489              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4490                      .dwattr $C$DW$T$38, DW_AT_name("os_tcb")
    4491                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x30)
    4492              $C$DW$301       .dwtag  DW_TAG_member
    4493                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$30)
    4494                      .dwattr $C$DW$301, DW_AT_name("OSTCBStkPtr")
    4495                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    4496                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4497                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4498              
    4499              $C$DW$302       .dwtag  DW_TAG_member
    4500                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$3)
    4501                      .dwattr $C$DW$302, DW_AT_name("OSTCBExtPtr")
    4502                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    4503                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4504                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4505              
    4506              $C$DW$303       .dwtag  DW_TAG_member
    4507                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$30)
    4508                      .dwattr $C$DW$303, DW_AT_name("OSTCBStkBottom")
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   87

    4509                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    4510                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4511                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4512              
    4513              $C$DW$304       .dwtag  DW_TAG_member
    4514                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$27)
    4515                      .dwattr $C$DW$304, DW_AT_name("OSTCBStkSize")
    4516                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_OSTCBStkSize")
    4517                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4518                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4519              
    4520              $C$DW$305       .dwtag  DW_TAG_member
    4521                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    4522                      .dwattr $C$DW$305, DW_AT_name("OSTCBOpt")
    4523                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_OSTCBOpt")
    4524                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4525                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4526              
    4527              $C$DW$306       .dwtag  DW_TAG_member
    4528                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    4529                      .dwattr $C$DW$306, DW_AT_name("OSTCBId")
    4530                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_OSTCBId")
    4531                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4532                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4533              
    4534              $C$DW$307       .dwtag  DW_TAG_member
    4535                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$31)
    4536                      .dwattr $C$DW$307, DW_AT_name("OSTCBNext")
    4537                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_OSTCBNext")
    4538                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4539                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4540              
    4541              $C$DW$308       .dwtag  DW_TAG_member
    4542                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$31)
    4543                      .dwattr $C$DW$308, DW_AT_name("OSTCBPrev")
    4544                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_OSTCBPrev")
    4545                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4546                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4547              
    4548              $C$DW$309       .dwtag  DW_TAG_member
    4549                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$33)
    4550                      .dwattr $C$DW$309, DW_AT_name("OSTCBEventPtr")
    4551                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    4552                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4553                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4554              
    4555              $C$DW$310       .dwtag  DW_TAG_member
    4556                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$34)
    4557                      .dwattr $C$DW$310, DW_AT_name("OSTCBEventMultiPtr")
    4558                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    4559                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4560                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4561              
    4562              $C$DW$311       .dwtag  DW_TAG_member
    4563                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$3)
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   88

    4564                      .dwattr $C$DW$311, DW_AT_name("OSTCBMsg")
    4565                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_OSTCBMsg")
    4566                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4567                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4568              
    4569              $C$DW$312       .dwtag  DW_TAG_member
    4570                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$36)
    4571                      .dwattr $C$DW$312, DW_AT_name("OSTCBFlagNode")
    4572                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    4573                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4574                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4575              
    4576              $C$DW$313       .dwtag  DW_TAG_member
    4577                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$25)
    4578                      .dwattr $C$DW$313, DW_AT_name("OSTCBFlagsRdy")
    4579                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    4580                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4581                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4582              
    4583              $C$DW$314       .dwtag  DW_TAG_member
    4584                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    4585                      .dwattr $C$DW$314, DW_AT_name("OSTCBDly")
    4586                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_OSTCBDly")
    4587                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4588                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4589              
    4590              $C$DW$315       .dwtag  DW_TAG_member
    4591                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    4592                      .dwattr $C$DW$315, DW_AT_name("OSTCBStat")
    4593                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_OSTCBStat")
    4594                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4595                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4596              
    4597              $C$DW$316       .dwtag  DW_TAG_member
    4598                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    4599                      .dwattr $C$DW$316, DW_AT_name("OSTCBStatPend")
    4600                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_OSTCBStatPend")
    4601                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4602                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4603              
    4604              $C$DW$317       .dwtag  DW_TAG_member
    4605                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    4606                      .dwattr $C$DW$317, DW_AT_name("OSTCBPrio")
    4607                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_OSTCBPrio")
    4608                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4609                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4610              
    4611              $C$DW$318       .dwtag  DW_TAG_member
    4612                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    4613                      .dwattr $C$DW$318, DW_AT_name("OSTCBX")
    4614                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_OSTCBX")
    4615                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4616                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4617              
    4618              $C$DW$319       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   89

    4619                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    4620                      .dwattr $C$DW$319, DW_AT_name("OSTCBY")
    4621                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_OSTCBY")
    4622                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4623                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4624              
    4625              $C$DW$320       .dwtag  DW_TAG_member
    4626                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    4627                      .dwattr $C$DW$320, DW_AT_name("OSTCBBitX")
    4628                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_OSTCBBitX")
    4629                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4630                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4631              
    4632              $C$DW$321       .dwtag  DW_TAG_member
    4633                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    4634                      .dwattr $C$DW$321, DW_AT_name("OSTCBBitY")
    4635                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_OSTCBBitY")
    4636                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4637                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4638              
    4639              $C$DW$322       .dwtag  DW_TAG_member
    4640                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    4641                      .dwattr $C$DW$322, DW_AT_name("OSTCBDelReq")
    4642                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_OSTCBDelReq")
    4643                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4644                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4645              
    4646              $C$DW$323       .dwtag  DW_TAG_member
    4647                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    4648                      .dwattr $C$DW$323, DW_AT_name("OSTCBCtxSwCtr")
    4649                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    4650                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4651                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4652              
    4653              $C$DW$324       .dwtag  DW_TAG_member
    4654                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$27)
    4655                      .dwattr $C$DW$324, DW_AT_name("OSTCBCyclesTot")
    4656                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    4657                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4658                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4659              
    4660              $C$DW$325       .dwtag  DW_TAG_member
    4661                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$27)
    4662                      .dwattr $C$DW$325, DW_AT_name("OSTCBCyclesStart")
    4663                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    4664                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4665                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4666              
    4667              $C$DW$326       .dwtag  DW_TAG_member
    4668                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$30)
    4669                      .dwattr $C$DW$326, DW_AT_name("OSTCBStkBase")
    4670                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_OSTCBStkBase")
    4671                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4672                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4673              
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   90

    4674              $C$DW$327       .dwtag  DW_TAG_member
    4675                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$27)
    4676                      .dwattr $C$DW$327, DW_AT_name("OSTCBStkUsed")
    4677                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    4678                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4679                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4680              
    4681              $C$DW$328       .dwtag  DW_TAG_member
    4682                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$23)
    4683                      .dwattr $C$DW$328, DW_AT_name("OSTCBTaskName")
    4684                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_OSTCBTaskName")
    4685                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4686                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4687              
    4688              $C$DW$329       .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$37)
    4690                      .dwattr $C$DW$329, DW_AT_name("OSTCBRegTbl")
    4691                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    4692                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4693                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4694              
    4695                      .dwendtag $C$DW$T$38
    4696              
    4697              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4698                      .dwattr $C$DW$T$44, DW_AT_name("OS_TCB")
    4699                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$38)
    4700                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4701              
    4702              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4703                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4704                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    4705              
    4706              
    4707              $C$DW$T$87      .dwtag  DW_TAG_array_type
    4708                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$45)
    4709                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4710                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x80)
    4711              $C$DW$330       .dwtag  DW_TAG_subrange_type
    4712                      .dwattr $C$DW$330, DW_AT_upper_bound(0x3f)
    4713              
    4714                      .dwendtag $C$DW$T$87
    4715              
    4716              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4717                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$38)
    4718                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4719              
    4720                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4721              
    4722              ;***************************************************************
    4723              ;* DWARF CIE ENTRIES                                           *
    4724              ;***************************************************************
    4725              
    4726              $C$DW$CIE       .dwcie 26
    4727                      .dwcfi  cfa_register, 20
    4728                      .dwcfi  cfa_offset, 0
TMS320C2000 Assembler PC v20.2.1 Wed Jan  6 17:53:26 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   91

    4729                      .dwcfi  same_value, 28
    4730                      .dwcfi  same_value, 6
    4731                      .dwcfi  same_value, 7
    4732                      .dwcfi  same_value, 8
    4733                      .dwcfi  same_value, 9
    4734                      .dwcfi  same_value, 10
    4735                      .dwcfi  same_value, 11
    4736                      .dwcfi  same_value, 59
    4737                      .dwcfi  same_value, 63
    4738                      .dwcfi  same_value, 67
    4739                      .dwcfi  same_value, 71
    4740                      .dwendentry
    4741              
    4742              ;***************************************************************
    4743              ;* DWARF REGISTER MAP                                          *
    4744              ;***************************************************************
    4745              
    4746              $C$DW$331       .dwtag  DW_TAG_TI_assign_register
    4747                      .dwattr $C$DW$331, DW_AT_name("AL")
    4748                      .dwattr $C$DW$331, DW_AT_location[DW_OP_reg0]
    4749              
    4750              $C$DW$332       .dwtag  DW_TAG_TI_assign_register
    4751                      .dwattr $C$DW$332, DW_AT_name("AH")
    4752                      .dwattr $C$DW$332, DW_AT_location[DW_OP_reg1]
    4753              
    4754              $C$DW$333       .dwtag  DW_TAG_TI_assign_register
    4755                      .dwattr $C$DW$333, DW_AT_name("PL")
    4756                      .dwattr $C$DW$333, DW_AT_location[DW_OP_reg2]
    4757              
