TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Mon Feb  8 19:02:48 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_task.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

    4248                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4249                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    4250              
    4251              $C$DW$T$20      .dwtag  DW_TAG_typedef
    4252                      .dwattr $C$DW$T$20, DW_AT_name("INT16U")
    4253                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    4254                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4255              
    4256              $C$DW$T$25      .dwtag  DW_TAG_typedef
    4257                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
    4258                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
    4259                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    4260              
    4261              $C$DW$T$39      .dwtag  DW_TAG_typedef
    4262                      .dwattr $C$DW$T$39, DW_AT_name("OS_CPU_SR")
    4263                      .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$9)
    4264                      .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4265              
    4266              $C$DW$T$29      .dwtag  DW_TAG_typedef
    4267                      .dwattr $C$DW$T$29, DW_AT_name("OS_STK")
    4268                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$9)
    4269                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4270              
    4271              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    4272                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
    4273                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    4274              
    4275              $C$DW$T$10      .dwtag  DW_TAG_base_type
    4276                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4277                      .dwattr $C$DW$T$10, DW_AT_name("int")
    4278                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    4279              
    4280              $C$DW$T$11      .dwtag  DW_TAG_base_type
    4281                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4282                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    4283                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    4284              
    4285              $C$DW$T$12      .dwtag  DW_TAG_base_type
    4286                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    4287                      .dwattr $C$DW$T$12, DW_AT_name("long")
    4288                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   83

    4289              
    4290              $C$DW$T$13      .dwtag  DW_TAG_base_type
    4291                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    4292                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    4293                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    4294              
    4295              $C$DW$T$27      .dwtag  DW_TAG_typedef
    4296                      .dwattr $C$DW$T$27, DW_AT_name("INT32U")
    4297                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$13)
    4298                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4299              
    4300              
    4301              $C$DW$T$37      .dwtag  DW_TAG_array_type
    4302                      .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$27)
    4303                      .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4304                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    4305              $C$DW$286       .dwtag  DW_TAG_subrange_type
    4306                      .dwattr $C$DW$286, DW_AT_upper_bound(0x00)
    4307              
    4308                      .dwendtag $C$DW$T$37
    4309              
    4310              $C$DW$T$14      .dwtag  DW_TAG_base_type
    4311                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    4312                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    4313                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    4314              
    4315              $C$DW$T$15      .dwtag  DW_TAG_base_type
    4316                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    4317                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    4318                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    4319              
    4320              $C$DW$T$16      .dwtag  DW_TAG_base_type
    4321                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    4322                      .dwattr $C$DW$T$16, DW_AT_name("float")
    4323                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    4324              
    4325              $C$DW$T$17      .dwtag  DW_TAG_base_type
    4326                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    4327                      .dwattr $C$DW$T$17, DW_AT_name("double")
    4328                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    4329              
    4330              $C$DW$T$18      .dwtag  DW_TAG_base_type
    4331                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    4332                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    4333                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    4334              
    4335              
    4336              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4337                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    4338                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    4339              $C$DW$287       .dwtag  DW_TAG_member
    4340                      .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    4341                      .dwattr $C$DW$287, DW_AT_name("OSEventType")
    4342                      .dwattr $C$DW$287, DW_AT_TI_symbol_name("_OSEventType")
    4343                      .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   84

    4344                      .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    4345              
    4346              $C$DW$288       .dwtag  DW_TAG_member
    4347                      .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$3)
    4348                      .dwattr $C$DW$288, DW_AT_name("OSEventPtr")
    4349                      .dwattr $C$DW$288, DW_AT_TI_symbol_name("_OSEventPtr")
    4350                      .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4351                      .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    4352              
    4353              $C$DW$289       .dwtag  DW_TAG_member
    4354                      .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$20)
    4355                      .dwattr $C$DW$289, DW_AT_name("OSEventCnt")
    4356                      .dwattr $C$DW$289, DW_AT_TI_symbol_name("_OSEventCnt")
    4357                      .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4358                      .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    4359              
    4360              $C$DW$290       .dwtag  DW_TAG_member
    4361                      .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$21)
    4362                      .dwattr $C$DW$290, DW_AT_name("OSEventGrp")
    4363                      .dwattr $C$DW$290, DW_AT_TI_symbol_name("_OSEventGrp")
    4364                      .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4365                      .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    4366              
    4367              $C$DW$291       .dwtag  DW_TAG_member
    4368                      .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$22)
    4369                      .dwattr $C$DW$291, DW_AT_name("OSEventTbl")
    4370                      .dwattr $C$DW$291, DW_AT_TI_symbol_name("_OSEventTbl")
    4371                      .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4372                      .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    4373              
    4374              $C$DW$292       .dwtag  DW_TAG_member
    4375                      .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$23)
    4376                      .dwattr $C$DW$292, DW_AT_name("OSEventName")
    4377                      .dwattr $C$DW$292, DW_AT_TI_symbol_name("_OSEventName")
    4378                      .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4379                      .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    4380              
    4381                      .dwendtag $C$DW$T$24
    4382              
    4383              $C$DW$T$32      .dwtag  DW_TAG_typedef
    4384                      .dwattr $C$DW$T$32, DW_AT_name("OS_EVENT")
    4385                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$24)
    4386                      .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    4387              
    4388              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    4389                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    4390                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    4391              
    4392              $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4393                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    4394                      .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4395              
    4396              
    4397              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4398                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   85

    4399                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    4400              $C$DW$293       .dwtag  DW_TAG_member
    4401                      .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$3)
    4402                      .dwattr $C$DW$293, DW_AT_name("OSFlagNodeNext")
    4403                      .dwattr $C$DW$293, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    4404                      .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4405                      .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    4406              
    4407              $C$DW$294       .dwtag  DW_TAG_member
    4408                      .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$3)
    4409                      .dwattr $C$DW$294, DW_AT_name("OSFlagNodePrev")
    4410                      .dwattr $C$DW$294, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    4411                      .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4412                      .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    4413              
    4414              $C$DW$295       .dwtag  DW_TAG_member
    4415                      .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$3)
    4416                      .dwattr $C$DW$295, DW_AT_name("OSFlagNodeTCB")
    4417                      .dwattr $C$DW$295, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    4418                      .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4419                      .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    4420              
    4421              $C$DW$296       .dwtag  DW_TAG_member
    4422                      .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$3)
    4423                      .dwattr $C$DW$296, DW_AT_name("OSFlagNodeFlagGrp")
    4424                      .dwattr $C$DW$296, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    4425                      .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4426                      .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    4427              
    4428              $C$DW$297       .dwtag  DW_TAG_member
    4429                      .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$25)
    4430                      .dwattr $C$DW$297, DW_AT_name("OSFlagNodeFlags")
    4431                      .dwattr $C$DW$297, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    4432                      .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4433                      .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    4434              
    4435              $C$DW$298       .dwtag  DW_TAG_member
    4436                      .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    4437                      .dwattr $C$DW$298, DW_AT_name("OSFlagNodeWaitType")
    4438                      .dwattr $C$DW$298, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    4439                      .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4440                      .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    4441              
    4442                      .dwendtag $C$DW$T$26
    4443              
    4444              $C$DW$T$35      .dwtag  DW_TAG_typedef
    4445                      .dwattr $C$DW$T$35, DW_AT_name("OS_FLAG_NODE")
    4446                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$26)
    4447                      .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4448              
    4449              $C$DW$T$36      .dwtag  DW_TAG_pointer_type
    4450                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$35)
    4451                      .dwattr $C$DW$T$36, DW_AT_address_class(0x20)
    4452              
    4453              
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   86

    4454              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4455                      .dwattr $C$DW$T$28, DW_AT_name("os_stk_data")
    4456                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    4457              $C$DW$299       .dwtag  DW_TAG_member
    4458                      .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$27)
    4459                      .dwattr $C$DW$299, DW_AT_name("OSFree")
    4460                      .dwattr $C$DW$299, DW_AT_TI_symbol_name("_OSFree")
    4461                      .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4462                      .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    4463              
    4464              $C$DW$300       .dwtag  DW_TAG_member
    4465                      .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$27)
    4466                      .dwattr $C$DW$300, DW_AT_name("OSUsed")
    4467                      .dwattr $C$DW$300, DW_AT_TI_symbol_name("_OSUsed")
    4468                      .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4469                      .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    4470              
    4471                      .dwendtag $C$DW$T$28
    4472              
    4473              $C$DW$T$75      .dwtag  DW_TAG_typedef
    4474                      .dwattr $C$DW$T$75, DW_AT_name("OS_STK_DATA")
    4475                      .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    4476                      .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    4477              
    4478              $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    4479                      .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    4480                      .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    4481              
    4482              
    4483              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4484                      .dwattr $C$DW$T$38, DW_AT_name("os_tcb")
    4485                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x30)
    4486              $C$DW$301       .dwtag  DW_TAG_member
    4487                      .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$30)
    4488                      .dwattr $C$DW$301, DW_AT_name("OSTCBStkPtr")
    4489                      .dwattr $C$DW$301, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    4490                      .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4491                      .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    4492              
    4493              $C$DW$302       .dwtag  DW_TAG_member
    4494                      .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$3)
    4495                      .dwattr $C$DW$302, DW_AT_name("OSTCBExtPtr")
    4496                      .dwattr $C$DW$302, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    4497                      .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4498                      .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    4499              
    4500              $C$DW$303       .dwtag  DW_TAG_member
    4501                      .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$30)
    4502                      .dwattr $C$DW$303, DW_AT_name("OSTCBStkBottom")
    4503                      .dwattr $C$DW$303, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    4504                      .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4505                      .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    4506              
    4507              $C$DW$304       .dwtag  DW_TAG_member
    4508                      .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$27)
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   87

    4509                      .dwattr $C$DW$304, DW_AT_name("OSTCBStkSize")
    4510                      .dwattr $C$DW$304, DW_AT_TI_symbol_name("_OSTCBStkSize")
    4511                      .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4512                      .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    4513              
    4514              $C$DW$305       .dwtag  DW_TAG_member
    4515                      .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$20)
    4516                      .dwattr $C$DW$305, DW_AT_name("OSTCBOpt")
    4517                      .dwattr $C$DW$305, DW_AT_TI_symbol_name("_OSTCBOpt")
    4518                      .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4519                      .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    4520              
    4521              $C$DW$306       .dwtag  DW_TAG_member
    4522                      .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$20)
    4523                      .dwattr $C$DW$306, DW_AT_name("OSTCBId")
    4524                      .dwattr $C$DW$306, DW_AT_TI_symbol_name("_OSTCBId")
    4525                      .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4526                      .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    4527              
    4528              $C$DW$307       .dwtag  DW_TAG_member
    4529                      .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$31)
    4530                      .dwattr $C$DW$307, DW_AT_name("OSTCBNext")
    4531                      .dwattr $C$DW$307, DW_AT_TI_symbol_name("_OSTCBNext")
    4532                      .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4533                      .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    4534              
    4535              $C$DW$308       .dwtag  DW_TAG_member
    4536                      .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$31)
    4537                      .dwattr $C$DW$308, DW_AT_name("OSTCBPrev")
    4538                      .dwattr $C$DW$308, DW_AT_TI_symbol_name("_OSTCBPrev")
    4539                      .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4540                      .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    4541              
    4542              $C$DW$309       .dwtag  DW_TAG_member
    4543                      .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$33)
    4544                      .dwattr $C$DW$309, DW_AT_name("OSTCBEventPtr")
    4545                      .dwattr $C$DW$309, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    4546                      .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    4547                      .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    4548              
    4549              $C$DW$310       .dwtag  DW_TAG_member
    4550                      .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$34)
    4551                      .dwattr $C$DW$310, DW_AT_name("OSTCBEventMultiPtr")
    4552                      .dwattr $C$DW$310, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    4553                      .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4554                      .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    4555              
    4556              $C$DW$311       .dwtag  DW_TAG_member
    4557                      .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$3)
    4558                      .dwattr $C$DW$311, DW_AT_name("OSTCBMsg")
    4559                      .dwattr $C$DW$311, DW_AT_TI_symbol_name("_OSTCBMsg")
    4560                      .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    4561                      .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    4562              
    4563              $C$DW$312       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   88

    4564                      .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$36)
    4565                      .dwattr $C$DW$312, DW_AT_name("OSTCBFlagNode")
    4566                      .dwattr $C$DW$312, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    4567                      .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4568                      .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    4569              
    4570              $C$DW$313       .dwtag  DW_TAG_member
    4571                      .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$25)
    4572                      .dwattr $C$DW$313, DW_AT_name("OSTCBFlagsRdy")
    4573                      .dwattr $C$DW$313, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    4574                      .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4575                      .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    4576              
    4577              $C$DW$314       .dwtag  DW_TAG_member
    4578                      .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$27)
    4579                      .dwattr $C$DW$314, DW_AT_name("OSTCBDly")
    4580                      .dwattr $C$DW$314, DW_AT_TI_symbol_name("_OSTCBDly")
    4581                      .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4582                      .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    4583              
    4584              $C$DW$315       .dwtag  DW_TAG_member
    4585                      .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    4586                      .dwattr $C$DW$315, DW_AT_name("OSTCBStat")
    4587                      .dwattr $C$DW$315, DW_AT_TI_symbol_name("_OSTCBStat")
    4588                      .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    4589                      .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    4590              
    4591              $C$DW$316       .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    4593                      .dwattr $C$DW$316, DW_AT_name("OSTCBStatPend")
    4594                      .dwattr $C$DW$316, DW_AT_TI_symbol_name("_OSTCBStatPend")
    4595                      .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    4596                      .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    4597              
    4598              $C$DW$317       .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    4600                      .dwattr $C$DW$317, DW_AT_name("OSTCBPrio")
    4601                      .dwattr $C$DW$317, DW_AT_TI_symbol_name("_OSTCBPrio")
    4602                      .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4603                      .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    4604              
    4605              $C$DW$318       .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    4607                      .dwattr $C$DW$318, DW_AT_name("OSTCBX")
    4608                      .dwattr $C$DW$318, DW_AT_TI_symbol_name("_OSTCBX")
    4609                      .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    4610                      .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    4611              
    4612              $C$DW$319       .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    4614                      .dwattr $C$DW$319, DW_AT_name("OSTCBY")
    4615                      .dwattr $C$DW$319, DW_AT_TI_symbol_name("_OSTCBY")
    4616                      .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    4617                      .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    4618              
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   89

    4619              $C$DW$320       .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$21)
    4621                      .dwattr $C$DW$320, DW_AT_name("OSTCBBitX")
    4622                      .dwattr $C$DW$320, DW_AT_TI_symbol_name("_OSTCBBitX")
    4623                      .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    4624                      .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    4625              
    4626              $C$DW$321       .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$21)
    4628                      .dwattr $C$DW$321, DW_AT_name("OSTCBBitY")
    4629                      .dwattr $C$DW$321, DW_AT_TI_symbol_name("_OSTCBBitY")
    4630                      .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4631                      .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    4632              
    4633              $C$DW$322       .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$19)
    4635                      .dwattr $C$DW$322, DW_AT_name("OSTCBDelReq")
    4636                      .dwattr $C$DW$322, DW_AT_TI_symbol_name("_OSTCBDelReq")
    4637                      .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    4638                      .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    4639              
    4640              $C$DW$323       .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$27)
    4642                      .dwattr $C$DW$323, DW_AT_name("OSTCBCtxSwCtr")
    4643                      .dwattr $C$DW$323, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    4644                      .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    4645                      .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    4646              
    4647              $C$DW$324       .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$27)
    4649                      .dwattr $C$DW$324, DW_AT_name("OSTCBCyclesTot")
    4650                      .dwattr $C$DW$324, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    4651                      .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    4652                      .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4653              
    4654              $C$DW$325       .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$27)
    4656                      .dwattr $C$DW$325, DW_AT_name("OSTCBCyclesStart")
    4657                      .dwattr $C$DW$325, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    4658                      .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    4659                      .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4660              
    4661              $C$DW$326       .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$30)
    4663                      .dwattr $C$DW$326, DW_AT_name("OSTCBStkBase")
    4664                      .dwattr $C$DW$326, DW_AT_TI_symbol_name("_OSTCBStkBase")
    4665                      .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    4666                      .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4667              
    4668              $C$DW$327       .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$27)
    4670                      .dwattr $C$DW$327, DW_AT_name("OSTCBStkUsed")
    4671                      .dwattr $C$DW$327, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    4672                      .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    4673                      .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   90

    4674              
    4675              $C$DW$328       .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$23)
    4677                      .dwattr $C$DW$328, DW_AT_name("OSTCBTaskName")
    4678                      .dwattr $C$DW$328, DW_AT_TI_symbol_name("_OSTCBTaskName")
    4679                      .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    4680                      .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
    4681              
    4682              $C$DW$329       .dwtag  DW_TAG_member
    4683                      .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$37)
    4684                      .dwattr $C$DW$329, DW_AT_name("OSTCBRegTbl")
    4685                      .dwattr $C$DW$329, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    4686                      .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    4687                      .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4688              
    4689                      .dwendtag $C$DW$T$38
    4690              
    4691              $C$DW$T$44      .dwtag  DW_TAG_typedef
    4692                      .dwattr $C$DW$T$44, DW_AT_name("OS_TCB")
    4693                      .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$38)
    4694                      .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4695              
    4696              $C$DW$T$45      .dwtag  DW_TAG_pointer_type
    4697                      .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    4698                      .dwattr $C$DW$T$45, DW_AT_address_class(0x20)
    4699              
    4700              
    4701              $C$DW$T$87      .dwtag  DW_TAG_array_type
    4702                      .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$45)
    4703                      .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    4704                      .dwattr $C$DW$T$87, DW_AT_byte_size(0x80)
    4705              $C$DW$330       .dwtag  DW_TAG_subrange_type
    4706                      .dwattr $C$DW$330, DW_AT_upper_bound(0x3f)
    4707              
    4708                      .dwendtag $C$DW$T$87
    4709              
    4710              $C$DW$T$31      .dwtag  DW_TAG_pointer_type
    4711                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$38)
    4712                      .dwattr $C$DW$T$31, DW_AT_address_class(0x20)
    4713              
    4714                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    4715              
    4716              ;***************************************************************
    4717              ;* DWARF CIE ENTRIES                                           *
    4718              ;***************************************************************
    4719              
    4720              $C$DW$CIE       .dwcie 26
    4721                      .dwcfi  cfa_register, 20
    4722                      .dwcfi  cfa_offset, 0
    4723                      .dwcfi  same_value, 28
    4724                      .dwcfi  same_value, 6
    4725                      .dwcfi  same_value, 7
    4726                      .dwcfi  same_value, 8
    4727                      .dwcfi  same_value, 9
    4728                      .dwcfi  same_value, 10
TMS320C2000 Assembler PC v20.2.1 Mon Feb  8 19:02:48 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_task.asm                                                          PAGE   91

    4729                      .dwcfi  same_value, 11
    4730                      .dwendentry
    4731              
    4732              ;***************************************************************
    4733              ;* DWARF REGISTER MAP                                          *
    4734              ;***************************************************************
    4735              
    4736              $C$DW$331       .dwtag  DW_TAG_TI_assign_register
    4737                      .dwattr $C$DW$331, DW_AT_name("AL")
    4738                      .dwattr $C$DW$331, DW_AT_location[DW_OP_reg0]
    4739              
    4740              $C$DW$332       .dwtag  DW_TAG_TI_assign_register
    4741                      .dwattr $C$DW$332, DW_AT_name("AH")
    4742                      .dwattr $C$DW$332, DW_AT_location[DW_OP_reg1]
    4743              
    4744              $C$DW$333       .dwtag  DW_TAG_TI_assign_register
    4745                      .dwattr $C$DW$333, DW_AT_name("PL")
    4746                      .dwattr $C$DW$333, DW_AT_location[DW_OP_reg2]
    4747              
    4748              $C$DW$334       .dwtag  DW_TAG_TI_assign_register
    4749                      .dwattr $C$DW$334, DW_AT_name("PH")
    4750                      .dwattr $C$DW$334, DW_AT_location[DW_OP_reg3]
    4751              
