TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 G3 C/C++ Codegen                               PC v20.2.1.LTS *
       3              ;* Date/Time created: Tue Feb 16 00:16:00 2021                 *
       4              ;***************************************************************
       5                      .compiler_opts --abi=coffabi --diag_wrap=off --float_support=softlib --hll_source=on --mem_model:code
       6                      .asg    XAR2, FP
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("C:/ti/Workspace/PLC_certificate/Software/uCOS-II/Source/os_time.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TI TMS320C2000 G3 C/C++ Codegen PC v20.2.1.LTS Copyright (c) 1996-2
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("C:\ti\Workspace\PLC_certificate\Examples\TI\TMDSDOCK28335\OS2\CCS\D
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram
      15                      .dwattr $C$DW$1, DW_AT_name("OS_CPU_SR_Restore")

     962                      .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
     963              
     964              $C$DW$T$25      .dwtag  DW_TAG_typedef
     965                      .dwattr $C$DW$T$25, DW_AT_name("OS_FLAGS")
     966                      .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$20)
     967                      .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
     968              
     969              $C$DW$T$38      .dwtag  DW_TAG_typedef
     970                      .dwattr $C$DW$T$38, DW_AT_name("OS_CPU_SR")
     971                      .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$9)
     972                      .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
     973              
     974              $C$DW$T$27      .dwtag  DW_TAG_typedef
     975                      .dwattr $C$DW$T$27, DW_AT_name("OS_STK")
     976                      .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
     977                      .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
     978              
     979              $C$DW$T$28      .dwtag  DW_TAG_pointer_type
     980                      .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
     981                      .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
     982              
     983              $C$DW$T$10      .dwtag  DW_TAG_base_type
     984                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
     985                      .dwattr $C$DW$T$10, DW_AT_name("int")
     986                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
     987              
     988              $C$DW$T$11      .dwtag  DW_TAG_base_type
     989                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     990                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
     991                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
     992              
     993              $C$DW$T$12      .dwtag  DW_TAG_base_type
     994                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
     995                      .dwattr $C$DW$T$12, DW_AT_name("long")
     996                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
     997              
     998              $C$DW$T$13      .dwtag  DW_TAG_base_type
     999                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1000                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    1001                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    1002              
    1003              $C$DW$T$29      .dwtag  DW_TAG_typedef
    1004                      .dwattr $C$DW$T$29, DW_AT_name("INT32U")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   20

    1005                      .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$13)
    1006                      .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    1007              
    1008              $C$DW$60        .dwtag  DW_TAG_TI_far_type
    1009                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$29)
    1010              
    1011              $C$DW$T$50      .dwtag  DW_TAG_volatile_type
    1012                      .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$60)
    1013              
    1014              
    1015              $C$DW$T$36      .dwtag  DW_TAG_array_type
    1016                      .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$29)
    1017                      .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1018                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1019              $C$DW$61        .dwtag  DW_TAG_subrange_type
    1020                      .dwattr $C$DW$61, DW_AT_upper_bound(0x00)
    1021              
    1022                      .dwendtag $C$DW$T$36
    1023              
    1024              $C$DW$T$14      .dwtag  DW_TAG_base_type
    1025                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1026                      .dwattr $C$DW$T$14, DW_AT_name("long long")
    1027                      .dwattr $C$DW$T$14, DW_AT_byte_size(0x04)
    1028              
    1029              $C$DW$T$15      .dwtag  DW_TAG_base_type
    1030                      .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1031                      .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1032                      .dwattr $C$DW$T$15, DW_AT_byte_size(0x04)
    1033              
    1034              $C$DW$T$16      .dwtag  DW_TAG_base_type
    1035                      .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1036                      .dwattr $C$DW$T$16, DW_AT_name("float")
    1037                      .dwattr $C$DW$T$16, DW_AT_byte_size(0x02)
    1038              
    1039              $C$DW$T$17      .dwtag  DW_TAG_base_type
    1040                      .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1041                      .dwattr $C$DW$T$17, DW_AT_name("double")
    1042                      .dwattr $C$DW$T$17, DW_AT_byte_size(0x02)
    1043              
    1044              $C$DW$T$18      .dwtag  DW_TAG_base_type
    1045                      .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1046                      .dwattr $C$DW$T$18, DW_AT_name("long double")
    1047                      .dwattr $C$DW$T$18, DW_AT_byte_size(0x04)
    1048              
    1049              
    1050              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    1051                      .dwattr $C$DW$T$24, DW_AT_name("os_event")
    1052                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x10)
    1053              $C$DW$62        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1055                      .dwattr $C$DW$62, DW_AT_name("OSEventType")
    1056                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_OSEventType")
    1057                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1059              
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   21

    1060              $C$DW$63        .dwtag  DW_TAG_member
    1061                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$3)
    1062                      .dwattr $C$DW$63, DW_AT_name("OSEventPtr")
    1063                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_OSEventPtr")
    1064                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1065                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1066              
    1067              $C$DW$64        .dwtag  DW_TAG_member
    1068                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
    1069                      .dwattr $C$DW$64, DW_AT_name("OSEventCnt")
    1070                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_OSEventCnt")
    1071                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1072                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1073              
    1074              $C$DW$65        .dwtag  DW_TAG_member
    1075                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$21)
    1076                      .dwattr $C$DW$65, DW_AT_name("OSEventGrp")
    1077                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_OSEventGrp")
    1078                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1079                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1080              
    1081              $C$DW$66        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$22)
    1083                      .dwattr $C$DW$66, DW_AT_name("OSEventTbl")
    1084                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_OSEventTbl")
    1085                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1086                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1087              
    1088              $C$DW$67        .dwtag  DW_TAG_member
    1089                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$23)
    1090                      .dwattr $C$DW$67, DW_AT_name("OSEventName")
    1091                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_OSEventName")
    1092                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1093                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1094              
    1095                      .dwendtag $C$DW$T$24
    1096              
    1097              $C$DW$T$31      .dwtag  DW_TAG_typedef
    1098                      .dwattr $C$DW$T$31, DW_AT_name("OS_EVENT")
    1099                      .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$24)
    1100                      .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    1101              
    1102              $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    1103                      .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$31)
    1104                      .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    1105              
    1106              $C$DW$T$33      .dwtag  DW_TAG_pointer_type
    1107                      .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$32)
    1108                      .dwattr $C$DW$T$33, DW_AT_address_class(0x20)
    1109              
    1110              
    1111              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    1112                      .dwattr $C$DW$T$26, DW_AT_name("os_flag_node")
    1113                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x0a)
    1114              $C$DW$68        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   22

    1115                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$3)
    1116                      .dwattr $C$DW$68, DW_AT_name("OSFlagNodeNext")
    1117                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_OSFlagNodeNext")
    1118                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1120              
    1121              $C$DW$69        .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$3)
    1123                      .dwattr $C$DW$69, DW_AT_name("OSFlagNodePrev")
    1124                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_OSFlagNodePrev")
    1125                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1126                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1127              
    1128              $C$DW$70        .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$3)
    1130                      .dwattr $C$DW$70, DW_AT_name("OSFlagNodeTCB")
    1131                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_OSFlagNodeTCB")
    1132                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1133                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1134              
    1135              $C$DW$71        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$3)
    1137                      .dwattr $C$DW$71, DW_AT_name("OSFlagNodeFlagGrp")
    1138                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_OSFlagNodeFlagGrp")
    1139                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1140                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1141              
    1142              $C$DW$72        .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$25)
    1144                      .dwattr $C$DW$72, DW_AT_name("OSFlagNodeFlags")
    1145                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_OSFlagNodeFlags")
    1146                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1147                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1148              
    1149              $C$DW$73        .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$73, DW_AT_name("OSFlagNodeWaitType")
    1152                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_OSFlagNodeWaitType")
    1153                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1154                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1155              
    1156                      .dwendtag $C$DW$T$26
    1157              
    1158              $C$DW$T$34      .dwtag  DW_TAG_typedef
    1159                      .dwattr $C$DW$T$34, DW_AT_name("OS_FLAG_NODE")
    1160                      .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$26)
    1161                      .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1162              
    1163              $C$DW$T$35      .dwtag  DW_TAG_pointer_type
    1164                      .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$34)
    1165                      .dwattr $C$DW$T$35, DW_AT_address_class(0x20)
    1166              
    1167              
    1168              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1169                      .dwattr $C$DW$T$37, DW_AT_name("os_tcb")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   23

    1170                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x30)
    1171              $C$DW$74        .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$28)
    1173                      .dwattr $C$DW$74, DW_AT_name("OSTCBStkPtr")
    1174                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_OSTCBStkPtr")
    1175                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1177              
    1178              $C$DW$75        .dwtag  DW_TAG_member
    1179                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$3)
    1180                      .dwattr $C$DW$75, DW_AT_name("OSTCBExtPtr")
    1181                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_OSTCBExtPtr")
    1182                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1183                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1184              
    1185              $C$DW$76        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$28)
    1187                      .dwattr $C$DW$76, DW_AT_name("OSTCBStkBottom")
    1188                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_OSTCBStkBottom")
    1189                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1190                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1191              
    1192              $C$DW$77        .dwtag  DW_TAG_member
    1193                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$29)
    1194                      .dwattr $C$DW$77, DW_AT_name("OSTCBStkSize")
    1195                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_OSTCBStkSize")
    1196                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1197                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1198              
    1199              $C$DW$78        .dwtag  DW_TAG_member
    1200                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1201                      .dwattr $C$DW$78, DW_AT_name("OSTCBOpt")
    1202                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_OSTCBOpt")
    1203                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1204                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1205              
    1206              $C$DW$79        .dwtag  DW_TAG_member
    1207                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
    1208                      .dwattr $C$DW$79, DW_AT_name("OSTCBId")
    1209                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_OSTCBId")
    1210                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1211                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1212              
    1213              $C$DW$80        .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$30)
    1215                      .dwattr $C$DW$80, DW_AT_name("OSTCBNext")
    1216                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_OSTCBNext")
    1217                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1218                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1219              
    1220              $C$DW$81        .dwtag  DW_TAG_member
    1221                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$30)
    1222                      .dwattr $C$DW$81, DW_AT_name("OSTCBPrev")
    1223                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_OSTCBPrev")
    1224                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   24

    1225                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1226              
    1227              $C$DW$82        .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$32)
    1229                      .dwattr $C$DW$82, DW_AT_name("OSTCBEventPtr")
    1230                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_OSTCBEventPtr")
    1231                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1232                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1233              
    1234              $C$DW$83        .dwtag  DW_TAG_member
    1235                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$33)
    1236                      .dwattr $C$DW$83, DW_AT_name("OSTCBEventMultiPtr")
    1237                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_OSTCBEventMultiPtr")
    1238                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1239                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1240              
    1241              $C$DW$84        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$3)
    1243                      .dwattr $C$DW$84, DW_AT_name("OSTCBMsg")
    1244                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_OSTCBMsg")
    1245                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1246                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1247              
    1248              $C$DW$85        .dwtag  DW_TAG_member
    1249                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$35)
    1250                      .dwattr $C$DW$85, DW_AT_name("OSTCBFlagNode")
    1251                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_OSTCBFlagNode")
    1252                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1253                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1254              
    1255              $C$DW$86        .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$25)
    1257                      .dwattr $C$DW$86, DW_AT_name("OSTCBFlagsRdy")
    1258                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_OSTCBFlagsRdy")
    1259                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1260                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1261              
    1262              $C$DW$87        .dwtag  DW_TAG_member
    1263                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$29)
    1264                      .dwattr $C$DW$87, DW_AT_name("OSTCBDly")
    1265                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_OSTCBDly")
    1266                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1267                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1268              
    1269              $C$DW$88        .dwtag  DW_TAG_member
    1270                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1271                      .dwattr $C$DW$88, DW_AT_name("OSTCBStat")
    1272                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_OSTCBStat")
    1273                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1274                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1275              
    1276              $C$DW$89        .dwtag  DW_TAG_member
    1277                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1278                      .dwattr $C$DW$89, DW_AT_name("OSTCBStatPend")
    1279                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_OSTCBStatPend")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   25

    1280                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1281                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1282              
    1283              $C$DW$90        .dwtag  DW_TAG_member
    1284                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1285                      .dwattr $C$DW$90, DW_AT_name("OSTCBPrio")
    1286                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_OSTCBPrio")
    1287                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1288                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1289              
    1290              $C$DW$91        .dwtag  DW_TAG_member
    1291                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1292                      .dwattr $C$DW$91, DW_AT_name("OSTCBX")
    1293                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_OSTCBX")
    1294                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1295                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1296              
    1297              $C$DW$92        .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1299                      .dwattr $C$DW$92, DW_AT_name("OSTCBY")
    1300                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_OSTCBY")
    1301                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1302                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1303              
    1304              $C$DW$93        .dwtag  DW_TAG_member
    1305                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1306                      .dwattr $C$DW$93, DW_AT_name("OSTCBBitX")
    1307                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_OSTCBBitX")
    1308                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    1309                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1310              
    1311              $C$DW$94        .dwtag  DW_TAG_member
    1312                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
    1313                      .dwattr $C$DW$94, DW_AT_name("OSTCBBitY")
    1314                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_OSTCBBitY")
    1315                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1316                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1317              
    1318              $C$DW$95        .dwtag  DW_TAG_member
    1319                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1320                      .dwattr $C$DW$95, DW_AT_name("OSTCBDelReq")
    1321                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_OSTCBDelReq")
    1322                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x21]
    1323                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1324              
    1325              $C$DW$96        .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$29)
    1327                      .dwattr $C$DW$96, DW_AT_name("OSTCBCtxSwCtr")
    1328                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_OSTCBCtxSwCtr")
    1329                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1330                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1331              
    1332              $C$DW$97        .dwtag  DW_TAG_member
    1333                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$29)
    1334                      .dwattr $C$DW$97, DW_AT_name("OSTCBCyclesTot")
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   26

    1335                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_OSTCBCyclesTot")
    1336                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1337                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1338              
    1339              $C$DW$98        .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$29)
    1341                      .dwattr $C$DW$98, DW_AT_name("OSTCBCyclesStart")
    1342                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_OSTCBCyclesStart")
    1343                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1344                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1345              
    1346              $C$DW$99        .dwtag  DW_TAG_member
    1347                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$28)
    1348                      .dwattr $C$DW$99, DW_AT_name("OSTCBStkBase")
    1349                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_OSTCBStkBase")
    1350                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1351                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1352              
    1353              $C$DW$100       .dwtag  DW_TAG_member
    1354                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$29)
    1355                      .dwattr $C$DW$100, DW_AT_name("OSTCBStkUsed")
    1356                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_OSTCBStkUsed")
    1357                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1358                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1359              
    1360              $C$DW$101       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1362                      .dwattr $C$DW$101, DW_AT_name("OSTCBTaskName")
    1363                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_OSTCBTaskName")
    1364                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1365                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1366              
    1367              $C$DW$102       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$36)
    1369                      .dwattr $C$DW$102, DW_AT_name("OSTCBRegTbl")
    1370                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_OSTCBRegTbl")
    1371                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1372                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1373              
    1374                      .dwendtag $C$DW$T$37
    1375              
    1376              $C$DW$T$52      .dwtag  DW_TAG_typedef
    1377                      .dwattr $C$DW$T$52, DW_AT_name("OS_TCB")
    1378                      .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$37)
    1379                      .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    1380              
    1381              $C$DW$T$53      .dwtag  DW_TAG_pointer_type
    1382                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$52)
    1383                      .dwattr $C$DW$T$53, DW_AT_address_class(0x20)
    1384              
    1385              
    1386              $C$DW$T$54      .dwtag  DW_TAG_array_type
    1387                      .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$53)
    1388                      .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    1389                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x80)
TMS320C2000 Assembler PC v20.2.1 Tue Feb 16 00:16:00 2021

Copyright (c) 1996-2018 Texas Instruments Incorporated
os_time.asm                                                          PAGE   27

    1390              $C$DW$103       .dwtag  DW_TAG_subrange_type
    1391                      .dwattr $C$DW$103, DW_AT_upper_bound(0x3f)
    1392              
    1393                      .dwendtag $C$DW$T$54
    1394              
    1395              $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    1396                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$37)
    1397                      .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    1398              
    1399                      .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1400              
    1401              ;***************************************************************
    1402              ;* DWARF CIE ENTRIES                                           *
    1403              ;***************************************************************
    1404              
    1405              $C$DW$CIE       .dwcie 26
    1406                      .dwcfi  cfa_register, 20
    1407                      .dwcfi  cfa_offset, 0
    1408                      .dwcfi  same_value, 28
    1409                      .dwcfi  same_value, 6
    1410                      .dwcfi  same_value, 7
    1411                      .dwcfi  same_value, 8
    1412                      .dwcfi  same_value, 9
    1413                      .dwcfi  same_value, 10
    1414                      .dwcfi  same_value, 11
    1415                      .dwendentry
    1416              
    1417              ;***************************************************************
    1418              ;* DWARF REGISTER MAP                                          *
    1419              ;***************************************************************
    1420              
    1421              $C$DW$104       .dwtag  DW_TAG_TI_assign_register
    1422                      .dwattr $C$DW$104, DW_AT_name("AL")
    1423                      .dwattr $C$DW$104, DW_AT_location[DW_OP_reg0]
    1424              
    1425              $C$DW$105       .dwtag  DW_TAG_TI_assign_register
    1426                      .dwattr $C$DW$105, DW_AT_name("AH")
    1427                      .dwattr $C$DW$105, DW_AT_location[DW_OP_reg1]
    1428              
    1429              $C$DW$106       .dwtag  DW_TAG_TI_assign_register
    1430                      .dwattr $C$DW$106, DW_AT_name("PL")
    1431                      .dwattr $C$DW$106, DW_AT_location[DW_OP_reg2]
    1432              
    1433              $C$DW$107       .dwtag  DW_TAG_TI_assign_register
    1434                      .dwattr $C$DW$107, DW_AT_name("PH")
    1435                      .dwattr $C$DW$107, DW_AT_location[DW_OP_reg3]
    1436              
